var area={
  "province": [
    {
      "name": "北京市",
      "code": "010000",
      "city": [
        {
          "name": "北京市",
          "code": "010100",
          "district": [
            {
              "name": "东城区",
              "code": "010101"
            },
            {
              "name": "西城区",
              "code": "010102"
            },
            {
              "name": "朝阳区",
              "code": "010103"
            },
            {
              "name": "丰台区",
              "code": "010104"
            },
            {
              "name": "石景山区",
              "code": "010105"
            },
            {
              "name": "海淀区",
              "code": "010106"
            },
            {
              "name": "门头沟区",
              "code": "010107"
            },
            {
              "name": "房山区",
              "code": "010108"
            },
            {
              "name": "通州区",
              "code": "010109"
            },
            {
              "name": "顺义区",
              "code": "010110"
            },
            {
              "name": "昌平区",
              "code": "010111"
            },
            {
              "name": "大兴区",
              "code": "010112"
            },
            {
              "name": "怀柔区",
              "code": "010113"
            },
            {
              "name": "平谷区",
              "code": "010114"
            },
            {
              "name": "密云县",
              "code": "010115"
            },
            {
              "name": "延庆县",
              "code": "010116"
            }
          ]
        }
      ]
    },
    {
      "name": "天津市",
      "code": "020000",
      "city": [
        {
          "name": "天津市",
          "code": "020100",
          "district": [
            {
              "name": "河西区",
              "code": "020101"
            },
            {
              "name": "和平区",
              "code": "020102"
            },
            {
              "name": "河东区",
              "code": "020103"
            },
            {
              "name": "南开区",
              "code": "020104"
            },
            {
              "name": "河北区",
              "code": "020105"
            },
            {
              "name": "红桥区",
              "code": "020106"
            },
            {
              "name": "东丽区",
              "code": "020107"
            },
            {
              "name": "西青区",
              "code": "020108"
            },
            {
              "name": "津南区",
              "code": "020109"
            },
            {
              "name": "北辰区",
              "code": "020110"
            },
            {
              "name": "武清区",
              "code": "020111"
            },
            {
              "name": "宝坻区",
              "code": "020112"
            },
            {
              "name": "滨海新区",
              "code": "020113"
            },
            {
              "name": "宁河区",
              "code": "020114"
            },
            {
              "name": "静海区",
              "code": "020115"
            },
            {
              "name": "蓟州区",
              "code": "020116"
            }
          ]
        }
      ]
    },
    {
      "name": "河北省",
      "code": "030000",
      "city": [
        {
          "name": "石家庄市",
          "code": "030100",
          "district": [
            {
              "name": "长安区",
              "code": "030101"
            },
            {
              "name": "桥西区",
              "code": "030102"
            },
            {
              "name": "新华区",
              "code": "030103"
            },
            {
              "name": "井陉矿区",
              "code": "030104"
            },
            {
              "name": "裕华区",
              "code": "030105"
            },
            {
              "name": "藁城区",
              "code": "030106"
            },
            {
              "name": "鹿泉区",
              "code": "030107"
            },
            {
              "name": "栾城区",
              "code": "030108"
            },
            {
              "name": "辛集市",
              "code": "030109"
            },
            {
              "name": "晋州市",
              "code": "030110"
            },
            {
              "name": "新乐市",
              "code": "030111"
            },
            {
              "name": "井陉县",
              "code": "030112"
            },
            {
              "name": "正定县",
              "code": "030113"
            },
            {
              "name": "行唐县",
              "code": "030114"
            },
            {
              "name": "灵寿县",
              "code": "030115"
            },
            {
              "name": "高邑县",
              "code": "030116"
            },
            {
              "name": "深泽县",
              "code": "030117"
            },
            {
              "name": "赞皇县",
              "code": "030118"
            },
            {
              "name": "无极县",
              "code": "030119"
            },
            {
              "name": "平山县",
              "code": "030120"
            },
            {
              "name": "元氏县",
              "code": "030121"
            },
            {
              "name": "赵县",
              "code": "030122"
            }
          ]
        },
        {
          "name": "唐山市",
          "code": "030200",
          "district": [
            {
              "name": "路北区",
              "code": "030201"
            },
            {
              "name": "路南区",
              "code": "030202"
            },
            {
              "name": "古冶区",
              "code": "030203"
            },
            {
              "name": "开平区",
              "code": "030204"
            },
            {
              "name": "丰南区",
              "code": "030205"
            },
            {
              "name": "丰润区",
              "code": "030206"
            },
            {
              "name": "曹妃甸区",
              "code": "030207"
            },
            {
              "name": "遵化市",
              "code": "030208"
            },
            {
              "name": "迁安市",
              "code": "030209"
            },
            {
              "name": "滦县",
              "code": "030210"
            },
            {
              "name": "滦南县",
              "code": "030211"
            },
            {
              "name": "乐亭县",
              "code": "030212"
            },
            {
              "name": "迁西县",
              "code": "030213"
            },
            {
              "name": "玉田县",
              "code": "030214"
            }
          ]
        },
        {
          "name": "秦皇岛市",
          "code": "030300",
          "district": [
            {
              "name": "海港区",
              "code": "030301"
            },
            {
              "name": "山海关区",
              "code": "030302"
            },
            {
              "name": "北戴河区",
              "code": "030303"
            },
            {
              "name": "抚宁县",
              "code": "030304"
            },
            {
              "name": "昌黎县",
              "code": "030305"
            },
            {
              "name": "卢龙县",
              "code": "030306"
            },
            {
              "name": "青龙满族自治县",
              "code": "030307"
            }
          ]
        },
        {
          "name": "邯郸市",
          "code": "030400",
          "district": [
            {
              "name": "丛台区",
              "code": "030401"
            },
            {
              "name": "邯山区",
              "code": "030402"
            },
            {
              "name": "复兴区",
              "code": "030403"
            },
            {
              "name": "峰峰矿区",
              "code": "030404"
            },
            {
              "name": "肥乡县",
              "code": "030405"
            },
            {
              "name": "永年县",
              "code": "030406"
            },
            {
              "name": "武安市",
              "code": "030407"
            },
            {
              "name": "临漳县",
              "code": "030408"
            },
            {
              "name": "成安县",
              "code": "030409"
            },
            {
              "name": "大名县",
              "code": "030410"
            },
            {
              "name": "涉县",
              "code": "030411"
            },
            {
              "name": "磁县",
              "code": "030412"
            },
            {
              "name": "邱县",
              "code": "030413"
            },
            {
              "name": "鸡泽县",
              "code": "030414"
            },
            {
              "name": "广平县",
              "code": "030415"
            },
            {
              "name": "馆陶县",
              "code": "030416"
            },
            {
              "name": "魏县",
              "code": "030417"
            },
            {
              "name": "曲周县",
              "code": "030418"
            }
          ]
        },
        {
          "name": "邢台市",
          "code": "030500",
          "district": [
            {
              "name": "桥东区",
              "code": "030501"
            },
            {
              "name": "桥西区",
              "code": "030502"
            },
            {
              "name": "南宫市",
              "code": "030503"
            },
            {
              "name": "沙河市",
              "code": "030504"
            },
            {
              "name": "邢台县",
              "code": "030505"
            },
            {
              "name": "临城县",
              "code": "030506"
            },
            {
              "name": "内丘县",
              "code": "030507"
            },
            {
              "name": "柏乡县",
              "code": "030508"
            },
            {
              "name": "隆尧县",
              "code": "030509"
            },
            {
              "name": "任县",
              "code": "030510"
            },
            {
              "name": "南和县",
              "code": "030511"
            },
            {
              "name": "宁晋县",
              "code": "030512"
            },
            {
              "name": "巨鹿县",
              "code": "030513"
            },
            {
              "name": "新河县",
              "code": "030514"
            },
            {
              "name": "广宗县",
              "code": "030515"
            },
            {
              "name": "平乡县",
              "code": "030516"
            },
            {
              "name": "威县",
              "code": "030517"
            },
            {
              "name": "清河县",
              "code": "030518"
            },
            {
              "name": "临西县",
              "code": "030519"
            }
          ]
        },
        {
          "name": "保定市",
          "code": "030600",
          "district": [
            {
              "name": "新市区",
              "code": "030601"
            },
            {
              "name": "北市区",
              "code": "030602"
            },
            {
              "name": "南市区",
              "code": "030603"
            },
            {
              "name": "满城县",
              "code": "030604"
            },
            {
              "name": "清苑县",
              "code": "030605"
            },
            {
              "name": "徐水区",
              "code": "030606"
            },
            {
              "name": "涿州市",
              "code": "030607"
            },
            {
              "name": "定州市",
              "code": "030608"
            },
            {
              "name": "安国市",
              "code": "030609"
            },
            {
              "name": "高碑店市",
              "code": "030610"
            },
            {
              "name": "涞水县",
              "code": "030611"
            },
            {
              "name": "阜平县",
              "code": "030612"
            },
            {
              "name": "定兴县",
              "code": "030613"
            },
            {
              "name": "唐县",
              "code": "030614"
            },
            {
              "name": "高阳县",
              "code": "030615"
            },
            {
              "name": "容城县",
              "code": "030616"
            },
            {
              "name": "涞源县",
              "code": "030617"
            },
            {
              "name": "望都县",
              "code": "030618"
            },
            {
              "name": "安新县",
              "code": "030619"
            },
            {
              "name": "易县",
              "code": "030620"
            },
            {
              "name": "曲阳县",
              "code": "030621"
            },
            {
              "name": "蠡县",
              "code": "030622"
            },
            {
              "name": "顺平县",
              "code": "030623"
            },
            {
              "name": "博野县",
              "code": "030624"
            },
            {
              "name": "雄县",
              "code": "030625"
            }
          ]
        },
        {
          "name": "张家口市",
          "code": "030700",
          "district": [
            {
              "name": "桥西区",
              "code": "030701"
            },
            {
              "name": "桥东区",
              "code": "030702"
            },
            {
              "name": "宣化区",
              "code": "030703"
            },
            {
              "name": "下花园区",
              "code": "030704"
            },
            {
              "name": "万全县",
              "code": "030705"
            },
            {
              "name": "崇礼县",
              "code": "030706"
            },
            {
              "name": "张北县",
              "code": "030707"
            },
            {
              "name": "康保县",
              "code": "030708"
            },
            {
              "name": "沽源县",
              "code": "030709"
            },
            {
              "name": "尚义县",
              "code": "030710"
            },
            {
              "name": "蔚  县",
              "code": "030711"
            },
            {
              "name": "阳原县",
              "code": "030712"
            },
            {
              "name": "怀安县",
              "code": "030713"
            },
            {
              "name": "怀来县",
              "code": "030714"
            },
            {
              "name": "涿鹿县",
              "code": "030715"
            },
            {
              "name": "赤城县",
              "code": "030716"
            }
          ]
        },
        {
          "name": "承德市",
          "code": "030800",
          "district": [
            {
              "name": "双桥区",
              "code": "030801"
            },
            {
              "name": "双滦区",
              "code": "030802"
            },
            {
              "name": "鹰手营子矿区",
              "code": "030803"
            },
            {
              "name": "平泉县",
              "code": "030804"
            },
            {
              "name": "承德县",
              "code": "030805"
            },
            {
              "name": "兴隆县",
              "code": "030806"
            },
            {
              "name": "滦平县",
              "code": "030807"
            },
            {
              "name": "隆化县",
              "code": "030808"
            },
            {
              "name": "丰宁满族自治县",
              "code": "030809"
            },
            {
              "name": "宽城满族自治县",
              "code": "030810"
            },
            {
              "name": "围场满族蒙古族自治县",
              "code": "030811"
            }
          ]
        },
        {
          "name": "沧州市",
          "code": "030900",
          "district": [
            {
              "name": "运河区",
              "code": "030901"
            },
            {
              "name": "新华区",
              "code": "030902"
            },
            {
              "name": "泊头市",
              "code": "030903"
            },
            {
              "name": "任丘市",
              "code": "030904"
            },
            {
              "name": "黄骅市",
              "code": "030905"
            },
            {
              "name": "河间市",
              "code": "030906"
            },
            {
              "name": "沧县",
              "code": "030907"
            },
            {
              "name": "青县",
              "code": "030908"
            },
            {
              "name": "东光县",
              "code": "030909"
            },
            {
              "name": "海兴县",
              "code": "030910"
            },
            {
              "name": "盐山县",
              "code": "030911"
            },
            {
              "name": "肃宁县",
              "code": "030912"
            },
            {
              "name": "南皮县",
              "code": "030913"
            },
            {
              "name": "吴桥县",
              "code": "030914"
            },
            {
              "name": "献县",
              "code": "030915"
            },
            {
              "name": "孟村回族自治县",
              "code": "030916"
            }
          ]
        },
        {
          "name": "廊坊市",
          "code": "031000",
          "district": [
            {
              "name": "广阳区",
              "code": "031001"
            },
            {
              "name": "安次区",
              "code": "031002"
            },
            {
              "name": "霸州市",
              "code": "031003"
            },
            {
              "name": "三河市",
              "code": "031004"
            },
            {
              "name": "固安县",
              "code": "031005"
            },
            {
              "name": "永清县",
              "code": "031006"
            },
            {
              "name": "香河县",
              "code": "031007"
            },
            {
              "name": "大城县",
              "code": "031008"
            },
            {
              "name": "文安县",
              "code": "031009"
            },
            {
              "name": "大厂回族自治县",
              "code": "031010"
            }
          ]
        },
        {
          "name": "衡水市",
          "code": "031100",
          "district": [
            {
              "name": "桃城区",
              "code": "031101"
            },
            {
              "name": "冀州市",
              "code": "031102"
            },
            {
              "name": "深州市",
              "code": "031103"
            },
            {
              "name": "枣强县",
              "code": "031104"
            },
            {
              "name": "武邑县",
              "code": "031105"
            },
            {
              "name": "武强县",
              "code": "031106"
            },
            {
              "name": "饶阳县",
              "code": "031107"
            },
            {
              "name": "安平县",
              "code": "031108"
            },
            {
              "name": "故城县",
              "code": "031109"
            },
            {
              "name": "景县",
              "code": "031110"
            },
            {
              "name": "阜城县",
              "code": "031111"
            }
          ]
        }
      ]
    },
    {
      "name": "山西省",
      "code": "040000",
      "city": [
        {
          "name": "太原市",
          "code": "040100",
          "district": [
            {
              "name": "杏花岭区",
              "code": "040101"
            },
            {
              "name": "小店区",
              "code": "040102"
            },
            {
              "name": "迎泽区",
              "code": "040103"
            },
            {
              "name": "尖草坪区",
              "code": "040104"
            },
            {
              "name": "万柏林区",
              "code": "040105"
            },
            {
              "name": "晋源区",
              "code": "040106"
            },
            {
              "name": "古交市",
              "code": "040107"
            },
            {
              "name": "清徐县",
              "code": "040108"
            },
            {
              "name": "阳曲县",
              "code": "040109"
            },
            {
              "name": "娄烦县",
              "code": "040110"
            }
          ]
        },
        {
          "name": "大同市",
          "code": "040200",
          "district": [
            {
              "name": "城区",
              "code": "040201"
            },
            {
              "name": "矿区",
              "code": "040202"
            },
            {
              "name": "南郊区",
              "code": "040203"
            },
            {
              "name": "新荣区",
              "code": "040204"
            },
            {
              "name": "阳高县",
              "code": "040205"
            },
            {
              "name": "天镇县",
              "code": "040206"
            },
            {
              "name": "广灵县",
              "code": "040207"
            },
            {
              "name": "灵丘县",
              "code": "040208"
            },
            {
              "name": "浑源县",
              "code": "040209"
            },
            {
              "name": "左云县",
              "code": "040210"
            },
            {
              "name": "大同县",
              "code": "040211"
            }
          ]
        },
        {
          "name": "阳泉市",
          "code": "040300",
          "district": [
            {
              "name": "城区",
              "code": "040301"
            },
            {
              "name": "矿区",
              "code": "040302"
            },
            {
              "name": "郊区",
              "code": "040303"
            },
            {
              "name": "平定县",
              "code": "040304"
            },
            {
              "name": "盂县",
              "code": "040305"
            }
          ]
        },
        {
          "name": "长治市",
          "code": "040400",
          "district": [
            {
              "name": "城区",
              "code": "040401"
            },
            {
              "name": "郊区",
              "code": "040402"
            },
            {
              "name": "潞城市",
              "code": "040403"
            },
            {
              "name": "长治县",
              "code": "040404"
            },
            {
              "name": "襄垣县",
              "code": "040405"
            },
            {
              "name": "屯留县",
              "code": "040406"
            },
            {
              "name": "平顺县",
              "code": "040407"
            },
            {
              "name": "黎城县",
              "code": "040408"
            },
            {
              "name": "壶关县",
              "code": "040409"
            },
            {
              "name": "长子县",
              "code": "040410"
            },
            {
              "name": "武乡县",
              "code": "040411"
            },
            {
              "name": "沁县",
              "code": "040412"
            },
            {
              "name": "沁源县",
              "code": "040413"
            }
          ]
        },
        {
          "name": "晋城市",
          "code": "040500",
          "district": [
            {
              "name": "城区",
              "code": "040501"
            },
            {
              "name": "高平市",
              "code": "040502"
            },
            {
              "name": "沁水县",
              "code": "040503"
            },
            {
              "name": "阳城县",
              "code": "040504"
            },
            {
              "name": "陵川县",
              "code": "040505"
            },
            {
              "name": "泽州县",
              "code": "040506"
            }
          ]
        },
        {
          "name": "朔州市",
          "code": "040600",
          "district": [
            {
              "name": "朔城区",
              "code": "040601"
            },
            {
              "name": "平鲁区",
              "code": "040602"
            },
            {
              "name": "山阴县",
              "code": "040603"
            },
            {
              "name": "应县",
              "code": "040604"
            },
            {
              "name": "右玉县",
              "code": "040605"
            },
            {
              "name": "怀仁县",
              "code": "040606"
            }
          ]
        },
        {
          "name": "晋中市",
          "code": "040700",
          "district": [
            {
              "name": "榆次市",
              "code": "040701"
            },
            {
              "name": "介休市",
              "code": "040702"
            },
            {
              "name": "榆社县",
              "code": "040703"
            },
            {
              "name": "左权县",
              "code": "040704"
            },
            {
              "name": "和顺县",
              "code": "040705"
            },
            {
              "name": "昔阳县",
              "code": "040706"
            },
            {
              "name": "寿阳县",
              "code": "040707"
            },
            {
              "name": "太谷县",
              "code": "040708"
            },
            {
              "name": "祁县",
              "code": "040709"
            },
            {
              "name": "平遥县",
              "code": "040710"
            },
            {
              "name": "灵石县",
              "code": "040711"
            }
          ]
        },
        {
          "name": "运城市",
          "code": "040800",
          "district": [
            {
              "name": "盐湖区",
              "code": "040801"
            },
            {
              "name": "永济市",
              "code": "040802"
            },
            {
              "name": "河津市",
              "code": "040803"
            },
            {
              "name": "临猗县",
              "code": "040804"
            },
            {
              "name": "万荣县",
              "code": "040805"
            },
            {
              "name": "闻喜县",
              "code": "040806"
            },
            {
              "name": "稷山县",
              "code": "040807"
            },
            {
              "name": "新绛县",
              "code": "040808"
            },
            {
              "name": "绛县",
              "code": "040809"
            },
            {
              "name": "垣曲县",
              "code": "040810"
            },
            {
              "name": "夏县",
              "code": "040811"
            },
            {
              "name": "平陆县",
              "code": "040812"
            },
            {
              "name": "芮城县",
              "code": "040813"
            }
          ]
        },
        {
          "name": "忻州市",
          "code": "040900",
          "district": [
            {
              "name": "忻府区",
              "code": "040901"
            },
            {
              "name": "原平市",
              "code": "040902"
            },
            {
              "name": "定襄县",
              "code": "040903"
            },
            {
              "name": "五台县",
              "code": "040904"
            },
            {
              "name": "代县",
              "code": "040905"
            },
            {
              "name": "繁峙县",
              "code": "040906"
            },
            {
              "name": "宁武县",
              "code": "040907"
            },
            {
              "name": "静乐县",
              "code": "040908"
            },
            {
              "name": "神池县",
              "code": "040909"
            },
            {
              "name": "五寨县",
              "code": "040910"
            },
            {
              "name": "岢岚县",
              "code": "040911"
            },
            {
              "name": "河曲县",
              "code": "040912"
            },
            {
              "name": "保德县",
              "code": "040913"
            },
            {
              "name": "偏关县",
              "code": "040914"
            }
          ]
        },
        {
          "name": "临汾市",
          "code": "041000",
          "district": [
            {
              "name": "尧都区",
              "code": "041001"
            },
            {
              "name": "侯马市",
              "code": "041002"
            },
            {
              "name": "霍州市",
              "code": "041003"
            },
            {
              "name": "曲沃县",
              "code": "041004"
            },
            {
              "name": "翼城县",
              "code": "041005"
            },
            {
              "name": "襄汾县",
              "code": "041006"
            },
            {
              "name": "洪洞县",
              "code": "041007"
            },
            {
              "name": "古县",
              "code": "041008"
            },
            {
              "name": "安泽县",
              "code": "041009"
            },
            {
              "name": "浮山县",
              "code": "041010"
            },
            {
              "name": "吉县",
              "code": "041011"
            },
            {
              "name": "乡宁县",
              "code": "041012"
            },
            {
              "name": "大宁县",
              "code": "041013"
            },
            {
              "name": "隰  县",
              "code": "041014"
            },
            {
              "name": "永和县",
              "code": "041015"
            },
            {
              "name": "蒲  县",
              "code": "041016"
            },
            {
              "name": "汾西县",
              "code": "041017"
            }
          ]
        },
        {
          "name": "吕梁市",
          "code": "041100",
          "district": [
            {
              "name": "离石区",
              "code": "041101"
            },
            {
              "name": "孝义市",
              "code": "041102"
            },
            {
              "name": "汾阳市",
              "code": "041103"
            },
            {
              "name": "文水县",
              "code": "041104"
            },
            {
              "name": "交城县",
              "code": "041105"
            },
            {
              "name": "兴县",
              "code": "041106"
            },
            {
              "name": "临县",
              "code": "041107"
            },
            {
              "name": "柳林县",
              "code": "041108"
            },
            {
              "name": "石楼县",
              "code": "041109"
            },
            {
              "name": "岚县",
              "code": "041110"
            },
            {
              "name": "方山县",
              "code": "041111"
            },
            {
              "name": "中阳县",
              "code": "041112"
            },
            {
              "name": "交口县",
              "code": "041113"
            }
          ]
        }
      ]
    },
    {
      "name": "内蒙古自治区",
      "code": "050000",
      "city": [
        {
          "name": "呼和浩特市",
          "code": "050100",
          "district": [
            {
              "name": "新城区",
              "code": "050101"
            },
            {
              "name": "回民区",
              "code": "050102"
            },
            {
              "name": "玉泉区",
              "code": "050103"
            },
            {
              "name": "赛罕区",
              "code": "050104"
            },
            {
              "name": "托克托县",
              "code": "050105"
            },
            {
              "name": "和林格尔县",
              "code": "050106"
            },
            {
              "name": "清水河县",
              "code": "050107"
            },
            {
              "name": "武川县",
              "code": "050108"
            },
            {
              "name": "土默特左旗",
              "code": "050109"
            }
          ]
        },
        {
          "name": "包头市",
          "code": "050200",
          "district": [
            {
              "name": "昆都伦区",
              "code": "050201"
            },
            {
              "name": "东河区",
              "code": "050202"
            },
            {
              "name": "青山区",
              "code": "050203"
            },
            {
              "name": "石拐区",
              "code": "050204"
            },
            {
              "name": "白云鄂博矿区",
              "code": "050205"
            },
            {
              "name": "九原区",
              "code": "050206"
            },
            {
              "name": "固阳县",
              "code": "050207"
            },
            {
              "name": "土默特右旗",
              "code": "050208"
            },
            {
              "name": "达尔罕茂明安联合旗",
              "code": "050209"
            }
          ]
        },
        {
          "name": "乌海市",
          "code": "050300",
          "district": [
            {
              "name": "海勃湾区",
              "code": "050301"
            },
            {
              "name": "海南区",
              "code": "050302"
            },
            {
              "name": "乌达区",
              "code": "050303"
            }
          ]
        },
        {
          "name": "赤峰市",
          "code": "050400",
          "district": [
            {
              "name": "红山区",
              "code": "050401"
            },
            {
              "name": "元宝山区",
              "code": "050402"
            },
            {
              "name": "松山区",
              "code": "050403"
            },
            {
              "name": "林西县",
              "code": "050404"
            },
            {
              "name": "宁城县",
              "code": "050405"
            },
            {
              "name": "阿鲁科尔沁旗",
              "code": "050406"
            },
            {
              "name": "巴林左旗",
              "code": "050407"
            },
            {
              "name": "巴林右旗",
              "code": "050408"
            },
            {
              "name": "克什克腾旗",
              "code": "050409"
            },
            {
              "name": "翁牛特旗",
              "code": "050410"
            },
            {
              "name": "喀喇沁旗",
              "code": "050411"
            },
            {
              "name": "敖汉旗",
              "code": "050412"
            }
          ]
        },
        {
          "name": "通辽市",
          "code": "050500",
          "district": [
            {
              "name": "科尔沁区",
              "code": "050501"
            },
            {
              "name": "霍林郭勒市",
              "code": "050502"
            },
            {
              "name": "科尔沁左翼中旗",
              "code": "050503"
            },
            {
              "name": "科尔沁左翼后旗",
              "code": "050504"
            },
            {
              "name": "开鲁县",
              "code": "050505"
            },
            {
              "name": "库伦旗",
              "code": "050506"
            },
            {
              "name": "奈曼旗",
              "code": "050507"
            },
            {
              "name": "扎鲁特旗",
              "code": "050508"
            }
          ]
        },
        {
          "name": "鄂尔多斯市",
          "code": "050600",
          "district": [
            {
              "name": "东胜区",
              "code": "050601"
            },
            {
              "name": "康巴什区",
              "code": "050602"
            },
            {
              "name": "达拉特旗",
              "code": "050603"
            },
            {
              "name": "准格尔旗",
              "code": "050604"
            },
            {
              "name": "鄂托克前旗",
              "code": "050605"
            },
            {
              "name": "鄂托克旗",
              "code": "050606"
            },
            {
              "name": "杭锦旗",
              "code": "050607"
            },
            {
              "name": "乌审旗",
              "code": "050608"
            },
            {
              "name": "伊金霍洛旗",
              "code": "050609"
            }
          ]
        },
        {
          "name": "呼伦贝尔市",
          "code": "050700",
          "district": [
            {
              "name": "海拉尔市",
              "code": "050701"
            },
            {
              "name": "扎赉诺尔区",
              "code": "050702"
            },
            {
              "name": "满洲里市",
              "code": "050703"
            },
            {
              "name": "牙克石市",
              "code": "050704"
            },
            {
              "name": "扎兰屯市",
              "code": "050705"
            },
            {
              "name": "额尔古纳市",
              "code": "050706"
            },
            {
              "name": "根河市",
              "code": "050707"
            },
            {
              "name": "阿荣旗",
              "code": "050708"
            },
            {
              "name": "陈巴尔虎旗",
              "code": "050709"
            },
            {
              "name": "新巴尔虎左旗",
              "code": "050710"
            },
            {
              "name": "新巴尔虎右旗",
              "code": "050711"
            },
            {
              "name": "莫力达瓦达斡尔族自治旗",
              "code": "050712"
            },
            {
              "name": "鄂伦春自治旗",
              "code": "050713"
            },
            {
              "name": "鄂温克族自治旗",
              "code": "050714"
            }
          ]
        },
        {
          "name": "巴彦淖尔市",
          "code": "050800",
          "district": [
            {
              "name": "临河市",
              "code": "050801"
            },
            {
              "name": "五原县",
              "code": "050802"
            },
            {
              "name": "磴口县",
              "code": "050803"
            },
            {
              "name": "乌拉特前旗",
              "code": "050804"
            },
            {
              "name": "乌拉特中旗",
              "code": "050805"
            },
            {
              "name": "乌拉特后旗",
              "code": "050806"
            },
            {
              "name": "杭锦后旗",
              "code": "050807"
            }
          ]
        },
        {
          "name": "乌兰察布盟",
          "code": "050900",
          "district": [
            {
              "name": "集宁市",
              "code": "050901"
            },
            {
              "name": "丰镇市",
              "code": "050902"
            },
            {
              "name": "卓资县",
              "code": "050903"
            },
            {
              "name": "化德县",
              "code": "050904"
            },
            {
              "name": "商都县",
              "code": "050905"
            },
            {
              "name": "兴和县",
              "code": "050906"
            },
            {
              "name": "凉城县",
              "code": "050907"
            },
            {
              "name": "察哈尔右翼前旗",
              "code": "050908"
            },
            {
              "name": "察哈尔右翼中旗",
              "code": "050909"
            },
            {
              "name": "察哈尔右翼后旗",
              "code": "050910"
            },
            {
              "name": "四子王旗",
              "code": "050911"
            }
          ]
        },
        {
          "name": "兴安盟",
          "code": "051000",
          "district": [
            {
              "name": "乌兰浩特市",
              "code": "051001"
            },
            {
              "name": "阿尔山市",
              "code": "051002"
            },
            {
              "name": "突泉县",
              "code": "051003"
            },
            {
              "name": "科尔沁右翼前旗",
              "code": "051004"
            },
            {
              "name": "科尔沁右翼中旗",
              "code": "051005"
            },
            {
              "name": "扎赉特旗",
              "code": "051006"
            }
          ]
        },
        {
          "name": "锡林郭勒盟",
          "code": "051100",
          "district": [
            {
              "name": "锡林浩特市",
              "code": "051101"
            },
            {
              "name": "二连浩特市",
              "code": "051102"
            },
            {
              "name": "多伦县",
              "code": "051103"
            },
            {
              "name": "阿巴嘎旗",
              "code": "051104"
            },
            {
              "name": "苏尼特左旗",
              "code": "051105"
            },
            {
              "name": "苏尼特右旗",
              "code": "051106"
            },
            {
              "name": "东乌珠穆沁旗",
              "code": "051107"
            },
            {
              "name": "西乌珠穆沁旗",
              "code": "051108"
            },
            {
              "name": "太仆寺旗",
              "code": "051109"
            },
            {
              "name": "镶黄旗",
              "code": "051110"
            },
            {
              "name": "正镶白旗",
              "code": "051111"
            },
            {
              "name": "正蓝旗",
              "code": "051112"
            }
          ]
        },
        {
          "name": "阿拉善盟",
          "code": "051200",
          "district": [
            {
              "name": "阿拉善左旗",
              "code": "051201"
            },
            {
              "name": "阿拉善右旗",
              "code": "051202"
            },
            {
              "name": "额济纳旗",
              "code": "051203"
            }
          ]
        }
      ]
    },
    {
      "name": "辽宁省",
      "code": "060000",
      "city": [
        {
          "name": "沈阳市",
          "code": "060100",
          "district": [
            {
              "name": "沈河区",
              "code": "060101"
            },
            {
              "name": "和平区",
              "code": "060102"
            },
            {
              "name": "大东区",
              "code": "060103"
            },
            {
              "name": "皇姑区",
              "code": "060104"
            },
            {
              "name": "铁西区",
              "code": "060105"
            },
            {
              "name": "苏家屯区",
              "code": "060106"
            },
            {
              "name": "浑南区",
              "code": "060107"
            },
            {
              "name": "沈北新区",
              "code": "060108"
            },
            {
              "name": "于洪区",
              "code": "060109"
            },
            {
              "name": "辽中县",
              "code": "060110"
            },
            {
              "name": "新民市",
              "code": "060111"
            },
            {
              "name": "康平县",
              "code": "060112"
            },
            {
              "name": "法库县",
              "code": "060113"
            }
          ]
        },
        {
          "name": "大连市",
          "code": "060200",
          "district": [
            {
              "name": "西岗区",
              "code": "060201"
            },
            {
              "name": "中山区",
              "code": "060202"
            },
            {
              "name": "沙河口区",
              "code": "060203"
            },
            {
              "name": "甘井子区",
              "code": "060204"
            },
            {
              "name": "旅顺口区",
              "code": "060205"
            },
            {
              "name": "金州区",
              "code": "060206"
            },
            {
              "name": "瓦房店市",
              "code": "060207"
            },
            {
              "name": "普兰店市",
              "code": "060208"
            },
            {
              "name": "庄河市",
              "code": "060209"
            },
            {
              "name": "长海县",
              "code": "060210"
            }
          ]
        },
        {
          "name": "鞍山市",
          "code": "060300",
          "district": [
            {
              "name": "铁东区",
              "code": "060301"
            },
            {
              "name": "铁西区",
              "code": "060302"
            },
            {
              "name": "立山区",
              "code": "060303"
            },
            {
              "name": "千山区",
              "code": "060304"
            },
            {
              "name": "海城市",
              "code": "060305"
            },
            {
              "name": "台安县",
              "code": "060306"
            },
            {
              "name": "岫岩满族自治县",
              "code": "060307"
            }
          ]
        },
        {
          "name": "抚顺市",
          "code": "060400",
          "district": [
            {
              "name": "顺城区",
              "code": "060401"
            },
            {
              "name": "新抚区",
              "code": "060402"
            },
            {
              "name": "东洲区",
              "code": "060403"
            },
            {
              "name": "望花区",
              "code": "060404"
            },
            {
              "name": "抚顺县",
              "code": "060405"
            },
            {
              "name": "清原满族自治县",
              "code": "060406"
            },
            {
              "name": "新宾满族自治县",
              "code": "060407"
            }
          ]
        },
        {
          "name": "本溪市",
          "code": "060500",
          "district": [
            {
              "name": "平山区",
              "code": "060501"
            },
            {
              "name": "溪湖区",
              "code": "060502"
            },
            {
              "name": "明山区",
              "code": "060503"
            },
            {
              "name": "南芬区",
              "code": "060504"
            },
            {
              "name": "本溪满族自治县",
              "code": "060505"
            },
            {
              "name": "桓仁满族自治县",
              "code": "060506"
            }
          ]
        },
        {
          "name": "丹东市",
          "code": "060600",
          "district": [
            {
              "name": "振兴区",
              "code": "060601"
            },
            {
              "name": "元宝区",
              "code": "060602"
            },
            {
              "name": "振安区",
              "code": "060603"
            },
            {
              "name": "东港市",
              "code": "060604"
            },
            {
              "name": "凤城市",
              "code": "060605"
            },
            {
              "name": "宽甸满族自治县",
              "code": "060606"
            }
          ]
        },
        {
          "name": "锦州市",
          "code": "060700",
          "district": [
            {
              "name": "太和区",
              "code": "060701"
            },
            {
              "name": "古塔区",
              "code": "060702"
            },
            {
              "name": "凌河区",
              "code": "060703"
            },
            {
              "name": "凌海市",
              "code": "060704"
            },
            {
              "name": "北镇市",
              "code": "060705"
            },
            {
              "name": "黑山县",
              "code": "060706"
            },
            {
              "name": "义县",
              "code": "060707"
            }
          ]
        },
        {
          "name": "营口市",
          "code": "060800",
          "district": [
            {
              "name": "站前区",
              "code": "060801"
            },
            {
              "name": "西市区",
              "code": "060802"
            },
            {
              "name": "鲅鱼圈区",
              "code": "060803"
            },
            {
              "name": "老边区",
              "code": "060804"
            },
            {
              "name": "盖州市",
              "code": "060805"
            },
            {
              "name": "大石桥市",
              "code": "060806"
            }
          ]
        },
        {
          "name": "阜新市",
          "code": "060900",
          "district": [
            {
              "name": "细河区",
              "code": "060901"
            },
            {
              "name": "海州区",
              "code": "060902"
            },
            {
              "name": "新邱区",
              "code": "060903"
            },
            {
              "name": "太平区",
              "code": "060904"
            },
            {
              "name": "清河门区",
              "code": "060905"
            },
            {
              "name": "彰武县",
              "code": "060906"
            },
            {
              "name": "阜新蒙古族自治县",
              "code": "060907"
            }
          ]
        },
        {
          "name": "辽阳市",
          "code": "061000",
          "district": [
            {
              "name": "白塔区",
              "code": "061001"
            },
            {
              "name": "文圣区",
              "code": "061002"
            },
            {
              "name": "宏伟区",
              "code": "061003"
            },
            {
              "name": "弓长岭区",
              "code": "061004"
            },
            {
              "name": "太子河区",
              "code": "061005"
            },
            {
              "name": "灯塔市",
              "code": "061006"
            },
            {
              "name": "辽阳县",
              "code": "061007"
            }
          ]
        },
        {
          "name": "盘锦市",
          "code": "061100",
          "district": [
            {
              "name": "兴隆台区",
              "code": "061101"
            },
            {
              "name": "双台子区",
              "code": "061102"
            },
            {
              "name": "大洼区",
              "code": "061103"
            },
            {
              "name": "盘山县",
              "code": "061104"
            }
          ]
        },
        {
          "name": "铁岭市",
          "code": "061200",
          "district": [
            {
              "name": "银州区",
              "code": "061201"
            },
            {
              "name": "清河区",
              "code": "061202"
            },
            {
              "name": "调兵山市",
              "code": "061203"
            },
            {
              "name": "开原市",
              "code": "061204"
            },
            {
              "name": "铁岭县",
              "code": "061205"
            },
            {
              "name": "西丰县",
              "code": "061206"
            },
            {
              "name": "昌图县",
              "code": "061207"
            }
          ]
        },
        {
          "name": "朝阳市",
          "code": "061300",
          "district": [
            {
              "name": "双塔区",
              "code": "061301"
            },
            {
              "name": "龙城区",
              "code": "061302"
            },
            {
              "name": "北票市",
              "code": "061303"
            },
            {
              "name": "凌源市",
              "code": "061304"
            },
            {
              "name": "朝阳县",
              "code": "061305"
            },
            {
              "name": "建平县",
              "code": "061306"
            },
            {
              "name": "喀喇沁左翼蒙古族自治县",
              "code": "061307"
            }
          ]
        },
        {
          "name": "葫芦岛市",
          "code": "061400",
          "district": [
            {
              "name": "龙港区",
              "code": "061401"
            },
            {
              "name": "连山区",
              "code": "061402"
            },
            {
              "name": "南票区",
              "code": "061403"
            },
            {
              "name": "兴城市",
              "code": "061404"
            },
            {
              "name": "绥中县",
              "code": "061405"
            },
            {
              "name": "建昌县",
              "code": "061406"
            }
          ]
        }
      ]
    },
    {
      "name": "吉林省",
      "code": "070000",
      "city": [
        {
          "name": "长春市",
          "code": "070100",
          "district": [
            {
              "name": "南关区",
              "code": "070101"
            },
            {
              "name": "宽城区",
              "code": "070102"
            },
            {
              "name": "朝阳区",
              "code": "070103"
            },
            {
              "name": "二道区",
              "code": "070104"
            },
            {
              "name": "绿园区",
              "code": "070105"
            },
            {
              "name": "双阳区",
              "code": "070106"
            },
            {
              "name": "九台市",
              "code": "070107"
            },
            {
              "name": "榆树市",
              "code": "070108"
            },
            {
              "name": "德惠市",
              "code": "070109"
            },
            {
              "name": "农安县",
              "code": "070110"
            }
          ]
        },
        {
          "name": "吉林市",
          "code": "070200",
          "district": [
            {
              "name": "船营区",
              "code": "070201"
            },
            {
              "name": "昌邑区",
              "code": "070202"
            },
            {
              "name": "龙潭区",
              "code": "070203"
            },
            {
              "name": "丰满区",
              "code": "070204"
            },
            {
              "name": "蛟河市",
              "code": "070205"
            },
            {
              "name": "桦甸市",
              "code": "070206"
            },
            {
              "name": "舒兰市",
              "code": "070207"
            },
            {
              "name": "磐石市",
              "code": "070208"
            },
            {
              "name": "永吉县",
              "code": "070209"
            }
          ]
        },
        {
          "name": "四平市",
          "code": "070300",
          "district": [
            {
              "name": "铁西区",
              "code": "070301"
            },
            {
              "name": "铁东区",
              "code": "070302"
            },
            {
              "name": "公主岭市",
              "code": "070303"
            },
            {
              "name": "双辽市",
              "code": "070304"
            },
            {
              "name": "梨树县",
              "code": "070305"
            },
            {
              "name": "伊通满族自治县",
              "code": "070306"
            }
          ]
        },
        {
          "name": "辽源市",
          "code": "070400",
          "district": [
            {
              "name": "龙山区",
              "code": "070401"
            },
            {
              "name": "西安区",
              "code": "070402"
            },
            {
              "name": "东丰县",
              "code": "070403"
            },
            {
              "name": "东辽县",
              "code": "070404"
            }
          ]
        },
        {
          "name": "通化市",
          "code": "070500",
          "district": [
            {
              "name": "东昌区",
              "code": "070501"
            },
            {
              "name": "二道江区",
              "code": "070502"
            },
            {
              "name": "梅河口市",
              "code": "070503"
            },
            {
              "name": "集安市",
              "code": "070504"
            },
            {
              "name": "通化县",
              "code": "070505"
            },
            {
              "name": "辉南县",
              "code": "070506"
            },
            {
              "name": "柳河县",
              "code": "070507"
            }
          ]
        },
        {
          "name": "白山市",
          "code": "070600",
          "district": [
            {
              "name": "浑江区",
              "code": "070601"
            },
            {
              "name": "江源区",
              "code": "070602"
            },
            {
              "name": "临江市",
              "code": "070603"
            },
            {
              "name": "抚松县",
              "code": "070604"
            },
            {
              "name": "靖宇县",
              "code": "070605"
            },
            {
              "name": "长白朝鲜族自治县",
              "code": "070606"
            }
          ]
        },
        {
          "name": "松原市",
          "code": "070700",
          "district": [
            {
              "name": "宁江区",
              "code": "070701"
            },
            {
              "name": "扶余县",
              "code": "070702"
            },
            {
              "name": "长岭县",
              "code": "070703"
            },
            {
              "name": "乾安县",
              "code": "070704"
            },
            {
              "name": "前郭尔罗斯蒙古族自治县",
              "code": "070705"
            }
          ]
        },
        {
          "name": "白城市",
          "code": "070800",
          "district": [
            {
              "name": "洮北区",
              "code": "070801"
            },
            {
              "name": "洮南市",
              "code": "070802"
            },
            {
              "name": "大安市",
              "code": "070803"
            },
            {
              "name": "镇赉县",
              "code": "070804"
            },
            {
              "name": "通榆县",
              "code": "070805"
            }
          ]
        },
        {
          "name": "延边朝鲜族自治州",
          "code": "070900",
          "district": [
            {
              "name": "延吉市",
              "code": "070901"
            },
            {
              "name": "图们市",
              "code": "070902"
            },
            {
              "name": "敦化市",
              "code": "070903"
            },
            {
              "name": "珲春市",
              "code": "070904"
            },
            {
              "name": "龙井市",
              "code": "070905"
            },
            {
              "name": "和龙市",
              "code": "070906"
            },
            {
              "name": "汪清县",
              "code": "070907"
            },
            {
              "name": "安图县",
              "code": "070908"
            }
          ]
        }
      ]
    },
    {
      "name": "黑龙江省",
      "code": "080000",
      "city": [
        {
          "name": "哈尔滨市",
          "code": "080100",
          "district": [
            {
              "name": "松北区",
              "code": "080101"
            },
            {
              "name": "道里区",
              "code": "080102"
            },
            {
              "name": "南岗区",
              "code": "080103"
            },
            {
              "name": "道外区",
              "code": "080104"
            },
            {
              "name": "平房区",
              "code": "080105"
            },
            {
              "name": "香坊区",
              "code": "080106"
            },
            {
              "name": "呼兰区",
              "code": "080107"
            },
            {
              "name": "阿城区",
              "code": "080108"
            },
            {
              "name": "双城市",
              "code": "080109"
            },
            {
              "name": "尚志市",
              "code": "080110"
            },
            {
              "name": "五常市",
              "code": "080111"
            },
            {
              "name": "依兰县",
              "code": "080112"
            },
            {
              "name": "方正县",
              "code": "080113"
            },
            {
              "name": "宾县",
              "code": "080114"
            },
            {
              "name": "巴彦县",
              "code": "080115"
            },
            {
              "name": "通河县",
              "code": "080116"
            },
            {
              "name": "木兰县",
              "code": "080117"
            },
            {
              "name": "延寿县",
              "code": "080118"
            }
          ]
        },
        {
          "name": "齐齐哈尔市",
          "code": "080200",
          "district": [
            {
              "name": "建华区",
              "code": "080201"
            },
            {
              "name": "龙沙区",
              "code": "080202"
            },
            {
              "name": "铁锋区",
              "code": "080203"
            },
            {
              "name": "昂昂溪区",
              "code": "080204"
            },
            {
              "name": "富拉尔基区",
              "code": "080205"
            },
            {
              "name": "碾子山区",
              "code": "080206"
            },
            {
              "name": "梅里斯达斡尔族区",
              "code": "080207"
            },
            {
              "name": "讷河市",
              "code": "080208"
            },
            {
              "name": "龙江县",
              "code": "080209"
            },
            {
              "name": "依安县",
              "code": "080210"
            },
            {
              "name": "泰来县",
              "code": "080211"
            },
            {
              "name": "甘南县",
              "code": "080212"
            },
            {
              "name": "富裕县",
              "code": "080213"
            },
            {
              "name": "克山县",
              "code": "080214"
            },
            {
              "name": "克东县",
              "code": "080215"
            },
            {
              "name": "拜泉县",
              "code": "080216"
            }
          ]
        },
        {
          "name": "鸡西市",
          "code": "080300",
          "district": [
            {
              "name": "鸡冠区",
              "code": "080301"
            },
            {
              "name": "恒山区",
              "code": "080302"
            },
            {
              "name": "滴道区",
              "code": "080303"
            },
            {
              "name": "梨树区",
              "code": "080304"
            },
            {
              "name": "城子河区",
              "code": "080305"
            },
            {
              "name": "麻山区",
              "code": "080306"
            },
            {
              "name": "虎林市",
              "code": "080307"
            },
            {
              "name": "密山市",
              "code": "080308"
            },
            {
              "name": "鸡东县",
              "code": "080309"
            }
          ]
        },
        {
          "name": "鹤岗市",
          "code": "080400",
          "district": [
            {
              "name": "向阳区",
              "code": "080401"
            },
            {
              "name": "工农区",
              "code": "080402"
            },
            {
              "name": "南山区",
              "code": "080403"
            },
            {
              "name": "兴安区",
              "code": "080404"
            },
            {
              "name": "东山区",
              "code": "080405"
            },
            {
              "name": "兴山区",
              "code": "080406"
            },
            {
              "name": "萝北县",
              "code": "080407"
            },
            {
              "name": "绥滨县",
              "code": "080408"
            }
          ]
        },
        {
          "name": "双鸭山市",
          "code": "080500",
          "district": [
            {
              "name": "尖山区",
              "code": "080501"
            },
            {
              "name": "岭东区",
              "code": "080502"
            },
            {
              "name": "四方台区",
              "code": "080503"
            },
            {
              "name": "宝山区",
              "code": "080504"
            },
            {
              "name": "集贤县",
              "code": "080505"
            },
            {
              "name": "友谊县",
              "code": "080506"
            },
            {
              "name": "宝清县",
              "code": "080507"
            },
            {
              "name": "饶河县",
              "code": "080508"
            }
          ]
        },
        {
          "name": "大庆市",
          "code": "080600",
          "district": [
            {
              "name": "萨尔图区",
              "code": "080601"
            },
            {
              "name": "龙凤区",
              "code": "080602"
            },
            {
              "name": "让胡路区",
              "code": "080603"
            },
            {
              "name": "红岗区",
              "code": "080604"
            },
            {
              "name": "大同区",
              "code": "080605"
            },
            {
              "name": "肇州县",
              "code": "080606"
            },
            {
              "name": "肇源县",
              "code": "080607"
            },
            {
              "name": "林甸县",
              "code": "080608"
            },
            {
              "name": "杜尔伯特蒙古族自治县",
              "code": "080609"
            }
          ]
        },
        {
          "name": "伊春市",
          "code": "080700",
          "district": [
            {
              "name": "伊春区",
              "code": "080701"
            },
            {
              "name": "南岔区",
              "code": "080702"
            },
            {
              "name": "友好区",
              "code": "080703"
            },
            {
              "name": "西林区",
              "code": "080704"
            },
            {
              "name": "翠峦区",
              "code": "080705"
            },
            {
              "name": "新青区",
              "code": "080706"
            },
            {
              "name": "美溪区",
              "code": "080707"
            },
            {
              "name": "金山屯区",
              "code": "080708"
            },
            {
              "name": "五营区",
              "code": "080709"
            },
            {
              "name": "乌马河区",
              "code": "080710"
            },
            {
              "name": "汤旺河区",
              "code": "080711"
            },
            {
              "name": "带岭区",
              "code": "080712"
            },
            {
              "name": "乌伊岭区",
              "code": "080713"
            },
            {
              "name": "红星区",
              "code": "080714"
            },
            {
              "name": "上甘岭区",
              "code": "080715"
            },
            {
              "name": "铁力市",
              "code": "080716"
            },
            {
              "name": "嘉荫县",
              "code": "080717"
            }
          ]
        },
        {
          "name": "佳木斯市",
          "code": "080800",
          "district": [
            {
              "name": "前进区",
              "code": "080801"
            },
            {
              "name": "向阳区",
              "code": "080802"
            },
            {
              "name": "东风区",
              "code": "080803"
            },
            {
              "name": "郊区",
              "code": "080804"
            },
            {
              "name": "同江市",
              "code": "080805"
            },
            {
              "name": "富锦市",
              "code": "080806"
            },
            {
              "name": "抚远市",
              "code": "080807"
            },
            {
              "name": "桦南县",
              "code": "080808"
            },
            {
              "name": "桦川县",
              "code": "080809"
            },
            {
              "name": "汤原县",
              "code": "080810"
            }
          ]
        },
        {
          "name": "七台河市",
          "code": "080900",
          "district": [
            {
              "name": "桃山区",
              "code": "080901"
            },
            {
              "name": "新兴区",
              "code": "080902"
            },
            {
              "name": "茄子河区",
              "code": "080903"
            },
            {
              "name": "勃利县",
              "code": "080904"
            }
          ]
        },
        {
          "name": "牡丹江市",
          "code": "081000",
          "district": [
            {
              "name": "东安区",
              "code": "081001"
            },
            {
              "name": "阳明区",
              "code": "081002"
            },
            {
              "name": "爱民区",
              "code": "081003"
            },
            {
              "name": "西安区",
              "code": "081004"
            },
            {
              "name": "绥芬河市",
              "code": "081005"
            },
            {
              "name": "海林市",
              "code": "081006"
            },
            {
              "name": "宁安市",
              "code": "081007"
            },
            {
              "name": "穆棱市",
              "code": "081008"
            },
            {
              "name": "东宁县",
              "code": "081009"
            },
            {
              "name": "林口县",
              "code": "081010"
            }
          ]
        },
        {
          "name": "黑河市",
          "code": "081100",
          "district": [
            {
              "name": "爱辉区",
              "code": "081101"
            },
            {
              "name": "北安市",
              "code": "081102"
            },
            {
              "name": "五大连池市",
              "code": "081103"
            },
            {
              "name": "嫩江县",
              "code": "081104"
            },
            {
              "name": "逊克县",
              "code": "081105"
            },
            {
              "name": "孙吴县",
              "code": "081106"
            }
          ]
        },
        {
          "name": "绥化市",
          "code": "081200",
          "district": [
            {
              "name": "北林区",
              "code": "081201"
            },
            {
              "name": "安达市",
              "code": "081202"
            },
            {
              "name": "肇东市",
              "code": "081203"
            },
            {
              "name": "海伦市",
              "code": "081204"
            },
            {
              "name": "望奎县",
              "code": "081205"
            },
            {
              "name": "兰西县",
              "code": "081206"
            },
            {
              "name": "青冈县",
              "code": "081207"
            },
            {
              "name": "庆安县",
              "code": "081208"
            },
            {
              "name": "明水县",
              "code": "081209"
            },
            {
              "name": "绥棱县",
              "code": "081210"
            }
          ]
        },
        {
          "name": "大兴安岭地区",
          "code": "081300",
          "district": [
            {
              "name": "呼玛县",
              "code": "081301"
            },
            {
              "name": "塔河县",
              "code": "081302"
            },
            {
              "name": "漠河县",
              "code": "081303"
            }
          ]
        }
      ]
    },
    {
      "name": "上海市",
      "code": "090000",
      "city": [
        {
          "name": "上海市",
          "code": "090100",
          "district": [
            {
              "name": "黄浦区",
              "code": "090101"
            },
            {
              "name": "徐汇区",
              "code": "090102"
            },
            {
              "name": "长宁区",
              "code": "090103"
            },
            {
              "name": "静安区",
              "code": "090104"
            },
            {
              "name": "普陀区",
              "code": "090105"
            },
            {
              "name": "虹口区",
              "code": "090106"
            },
            {
              "name": "杨浦区",
              "code": "090107"
            },
            {
              "name": "闵行区",
              "code": "090108"
            },
            {
              "name": "宝山区",
              "code": "090109"
            },
            {
              "name": "嘉定区",
              "code": "090110"
            },
            {
              "name": "浦东新区",
              "code": "090111"
            },
            {
              "name": "金山区",
              "code": "090112"
            },
            {
              "name": "松江区",
              "code": "090113"
            },
            {
              "name": "青浦区",
              "code": "090114"
            },
            {
              "name": "奉贤区",
              "code": "090115"
            },
            {
              "name": "崇明区",
              "code": "090116"
            }
          ]
        }
      ]
    },
    {
      "name": "江苏省",
      "code": "100000",
      "city": [
        {
          "name": "南京市",
          "code": "100100",
          "district": [
            {
              "name": "玄武区",
              "code": "100101"
            },
            {
              "name": "秦淮区",
              "code": "100102"
            },
            {
              "name": "建邺区",
              "code": "100103"
            },
            {
              "name": "鼓楼区",
              "code": "100104"
            },
            {
              "name": "浦口区",
              "code": "100105"
            },
            {
              "name": "栖霞区",
              "code": "100106"
            },
            {
              "name": "雨花台区",
              "code": "100107"
            },
            {
              "name": "江宁区",
              "code": "100108"
            },
            {
              "name": "六合区",
              "code": "100109"
            },
            {
              "name": "溧水区",
              "code": "100110"
            },
            {
              "name": "高淳区",
              "code": "100111"
            }
          ]
        },
        {
          "name": "无锡市",
          "code": "100200",
          "district": [
            {
              "name": "梁溪区",
              "code": "100201"
            },
            {
              "name": "锡山区",
              "code": "100202"
            },
            {
              "name": "惠山区",
              "code": "100203"
            },
            {
              "name": "滨湖区",
              "code": "100204"
            },
            {
              "name": "新吴区",
              "code": "100205"
            },
            {
              "name": "江阴市",
              "code": "100206"
            },
            {
              "name": "宜兴市",
              "code": "100207"
            }
          ]
        },
        {
          "name": "徐州市",
          "code": "100300",
          "district": [
            {
              "name": "云龙区",
              "code": "100301"
            },
            {
              "name": "鼓楼区",
              "code": "100302"
            },
            {
              "name": "贾汪区",
              "code": "100303"
            },
            {
              "name": "泉山区",
              "code": "100304"
            },
            {
              "name": "铜山县",
              "code": "100305"
            },
            {
              "name": "新沂市",
              "code": "100306"
            },
            {
              "name": "邳州市",
              "code": "100307"
            },
            {
              "name": "沛县",
              "code": "100308"
            },
            {
              "name": "丰县",
              "code": "100309"
            },
            {
              "name": "睢宁县",
              "code": "100310"
            }
          ]
        },
        {
          "name": "常州市",
          "code": "100400",
          "district": [
            {
              "name": "新北区",
              "code": "100401"
            },
            {
              "name": "天宁区",
              "code": "100402"
            },
            {
              "name": "钟楼区",
              "code": "100403"
            },
            {
              "name": "武进区",
              "code": "100404"
            },
            {
              "name": "金坛区",
              "code": "100405"
            },
            {
              "name": "溧阳市",
              "code": "100406"
            }
          ]
        },
        {
          "name": "苏州市",
          "code": "100500",
          "district": [
            {
              "name": "姑苏区",
              "code": "100501"
            },
            {
              "name": "虎丘区",
              "code": "100502"
            },
            {
              "name": "吴中区",
              "code": "100503"
            },
            {
              "name": "相城区",
              "code": "100504"
            },
            {
              "name": "吴江区",
              "code": "100505"
            },
            {
              "name": "常熟市",
              "code": "100506"
            },
            {
              "name": "张家港市",
              "code": "100507"
            },
            {
              "name": "昆山市",
              "code": "100508"
            },
            {
              "name": "太仓市",
              "code": "100509"
            }
          ]
        },
        {
          "name": "南通市",
          "code": "100600",
          "district": [
            {
              "name": "崇川区",
              "code": "100601"
            },
            {
              "name": "港闸区",
              "code": "100602"
            },
            {
              "name": "通州市",
              "code": "100603"
            },
            {
              "name": "启东市",
              "code": "100604"
            },
            {
              "name": "如皋市",
              "code": "100605"
            },
            {
              "name": "海门市",
              "code": "100606"
            },
            {
              "name": "海安县",
              "code": "100607"
            },
            {
              "name": "如东县",
              "code": "100608"
            }
          ]
        },
        {
          "name": "连云港市",
          "code": "100700",
          "district": [
            {
              "name": "海州区",
              "code": "100701"
            },
            {
              "name": "连云区",
              "code": "100702"
            },
            {
              "name": "赣榆县",
              "code": "100703"
            },
            {
              "name": "东海县",
              "code": "100704"
            },
            {
              "name": "灌云县",
              "code": "100705"
            },
            {
              "name": "灌南县",
              "code": "100706"
            }
          ]
        },
        {
          "name": "淮安市",
          "code": "100800",
          "district": [
            {
              "name": "淮安区",
              "code": "100801"
            },
            {
              "name": "淮阴区",
              "code": "100802"
            },
            {
              "name": "清江浦区",
              "code": "100803"
            },
            {
              "name": "洪泽区",
              "code": "100804"
            },
            {
              "name": "涟水县",
              "code": "100805"
            },
            {
              "name": "盱眙县",
              "code": "100806"
            },
            {
              "name": "金湖县",
              "code": "100807"
            }
          ]
        },
        {
          "name": "盐城市",
          "code": "100900",
          "district": [
            {
              "name": "亭湖区",
              "code": "100901"
            },
            {
              "name": "盐都区",
              "code": "100902"
            },
            {
              "name": "大丰市",
              "code": "100903"
            },
            {
              "name": "东台市",
              "code": "100904"
            },
            {
              "name": "响水县",
              "code": "100905"
            },
            {
              "name": "滨海县",
              "code": "100906"
            },
            {
              "name": "阜宁县",
              "code": "100907"
            },
            {
              "name": "射阳县",
              "code": "100908"
            },
            {
              "name": "建湖县",
              "code": "100909"
            }
          ]
        },
        {
          "name": "扬州市",
          "code": "101000",
          "district": [
            {
              "name": "邗江区",
              "code": "101001"
            },
            {
              "name": "广陵区",
              "code": "101002"
            },
            {
              "name": "江都市",
              "code": "101003"
            },
            {
              "name": "仪征市",
              "code": "101004"
            },
            {
              "name": "高邮市",
              "code": "101005"
            },
            {
              "name": "宝应县",
              "code": "101006"
            }
          ]
        },
        {
          "name": "镇江市",
          "code": "101100",
          "district": [
            {
              "name": "京口区",
              "code": "101101"
            },
            {
              "name": "润州区",
              "code": "101102"
            },
            {
              "name": "丹徒区",
              "code": "101103"
            },
            {
              "name": "丹阳市",
              "code": "101104"
            },
            {
              "name": "扬中市",
              "code": "101105"
            },
            {
              "name": "句容市",
              "code": "101106"
            }
          ]
        },
        {
          "name": "泰州市",
          "code": "101200",
          "district": [
            {
              "name": "海陵区",
              "code": "101201"
            },
            {
              "name": "高港区",
              "code": "101202"
            },
            {
              "name": "姜堰市",
              "code": "101203"
            },
            {
              "name": "兴化市",
              "code": "101204"
            },
            {
              "name": "靖江市",
              "code": "101205"
            },
            {
              "name": "泰兴市",
              "code": "101206"
            }
          ]
        },
        {
          "name": "宿迁市",
          "code": "101300",
          "district": [
            {
              "name": "宿城区",
              "code": "101301"
            },
            {
              "name": "宿豫区",
              "code": "101302"
            },
            {
              "name": "沭阳县",
              "code": "101303"
            },
            {
              "name": "泗阳县",
              "code": "101304"
            },
            {
              "name": "泗洪县",
              "code": "101305"
            }
          ]
        }
      ]
    },
    {
      "name": "浙江省",
      "code": "110000",
      "city": [
        {
          "name": "杭州市",
          "code": "110100",
          "district": [
            {
              "name": "拱墅区",
              "code": "110101"
            },
            {
              "name": "上城区",
              "code": "110102"
            },
            {
              "name": "下城区",
              "code": "110103"
            },
            {
              "name": "江干区",
              "code": "110104"
            },
            {
              "name": "西湖区",
              "code": "110105"
            },
            {
              "name": "滨江区",
              "code": "110106"
            },
            {
              "name": "萧山区",
              "code": "110107"
            },
            {
              "name": "余杭区",
              "code": "110108"
            },
            {
              "name": "富阳区",
              "code": "110109"
            },
            {
              "name": "临安区",
              "code": "110110"
            },
            {
              "name": "建德市",
              "code": "110111"
            },
            {
              "name": "桐庐县",
              "code": "110112"
            },
            {
              "name": "淳安县",
              "code": "110113"
            }
          ]
        },
        {
          "name": "宁波市",
          "code": "110200",
          "district": [
            {
              "name": "海曙区",
              "code": "110201"
            },
            {
              "name": "江北区",
              "code": "110202"
            },
            {
              "name": "北仑区",
              "code": "110203"
            },
            {
              "name": "镇海区",
              "code": "110204"
            },
            {
              "name": "鄞州区",
              "code": "110205"
            },
            {
              "name": "奉化区",
              "code": "110206"
            },
            {
              "name": "余姚市",
              "code": "110207"
            },
            {
              "name": "慈溪市",
              "code": "110208"
            },
            {
              "name": "象山县",
              "code": "110209"
            },
            {
              "name": "宁海县",
              "code": "110210"
            }
          ]
        },
        {
          "name": "温州市",
          "code": "110300",
          "district": [
            {
              "name": "鹿城区",
              "code": "110301"
            },
            {
              "name": "龙湾区",
              "code": "110302"
            },
            {
              "name": "瓯海区",
              "code": "110303"
            },
            {
              "name": "洞头区",
              "code": "110304"
            },
            {
              "name": "瑞安市",
              "code": "110305"
            },
            {
              "name": "乐清市",
              "code": "110306"
            },
            {
              "name": "永嘉县",
              "code": "110307"
            },
            {
              "name": "平阳县",
              "code": "110308"
            },
            {
              "name": "苍南县",
              "code": "110309"
            },
            {
              "name": "文成县",
              "code": "110310"
            },
            {
              "name": "泰顺县",
              "code": "110311"
            }
          ]
        },
        {
          "name": "嘉兴市",
          "code": "110400",
          "district": [
            {
              "name": "南湖区",
              "code": "110401"
            },
            {
              "name": "秀洲区",
              "code": "110402"
            },
            {
              "name": "海宁市",
              "code": "110403"
            },
            {
              "name": "平湖市",
              "code": "110404"
            },
            {
              "name": "桐乡市",
              "code": "110405"
            },
            {
              "name": "嘉善县",
              "code": "110406"
            },
            {
              "name": "海盐县",
              "code": "110407"
            }
          ]
        },
        {
          "name": "湖州市",
          "code": "110500",
          "district": [
            {
              "name": "吴兴区",
              "code": "110501"
            },
            {
              "name": "南浔区",
              "code": "110502"
            },
            {
              "name": "德清县",
              "code": "110503"
            },
            {
              "name": "长兴县",
              "code": "110504"
            },
            {
              "name": "安吉县",
              "code": "110505"
            }
          ]
        },
        {
          "name": "绍兴市",
          "code": "110600",
          "district": [
            {
              "name": "越城区",
              "code": "110601"
            },
            {
              "name": "柯桥区",
              "code": "110602"
            },
            {
              "name": "上虞市",
              "code": "110603"
            },
            {
              "name": "诸暨市",
              "code": "110604"
            },
            {
              "name": "嵊州市",
              "code": "110605"
            },
            {
              "name": "新昌县",
              "code": "110606"
            }
          ]
        },
        {
          "name": "金华市",
          "code": "110700",
          "district": [
            {
              "name": "婺城区",
              "code": "110701"
            },
            {
              "name": "金东区",
              "code": "110702"
            },
            {
              "name": "兰溪市",
              "code": "110703"
            },
            {
              "name": "义乌市",
              "code": "110704"
            },
            {
              "name": "东阳市",
              "code": "110705"
            },
            {
              "name": "永康市",
              "code": "110706"
            },
            {
              "name": "武义县",
              "code": "110707"
            },
            {
              "name": "浦江县",
              "code": "110708"
            },
            {
              "name": "磐安县",
              "code": "110709"
            }
          ]
        },
        {
          "name": "衢州市",
          "code": "110800",
          "district": [
            {
              "name": "柯城区",
              "code": "110801"
            },
            {
              "name": "衢江区",
              "code": "110802"
            },
            {
              "name": "江山市",
              "code": "110803"
            },
            {
              "name": "常山县",
              "code": "110804"
            },
            {
              "name": "开化县",
              "code": "110805"
            },
            {
              "name": "龙游县",
              "code": "110806"
            }
          ]
        },
        {
          "name": "舟山市",
          "code": "110900",
          "district": [
            {
              "name": "定海区",
              "code": "110901"
            },
            {
              "name": "普陀区",
              "code": "110902"
            },
            {
              "name": "岱山县",
              "code": "110903"
            },
            {
              "name": "嵊泗县",
              "code": "110904"
            }
          ]
        },
        {
          "name": "台州市",
          "code": "111000",
          "district": [
            {
              "name": "椒江区",
              "code": "111001"
            },
            {
              "name": "黄岩区",
              "code": "111002"
            },
            {
              "name": "路桥区",
              "code": "111003"
            },
            {
              "name": "温岭市",
              "code": "111004"
            },
            {
              "name": "临海市",
              "code": "111005"
            },
            {
              "name": "玉环县",
              "code": "111006"
            },
            {
              "name": "三门县",
              "code": "111007"
            },
            {
              "name": "天台县",
              "code": "111008"
            },
            {
              "name": "仙居县",
              "code": "111009"
            }
          ]
        },
        {
          "name": "丽水市",
          "code": "111100",
          "district": [
            {
              "name": "莲都区",
              "code": "111101"
            },
            {
              "name": "龙泉市",
              "code": "111102"
            },
            {
              "name": "青田县",
              "code": "111103"
            },
            {
              "name": "缙云县",
              "code": "111104"
            },
            {
              "name": "遂昌县",
              "code": "111105"
            },
            {
              "name": "松阳县",
              "code": "111106"
            },
            {
              "name": "云和县",
              "code": "111107"
            },
            {
              "name": "庆元县",
              "code": "111108"
            },
            {
              "name": "景宁畲族自治县",
              "code": "111109"
            }
          ]
        }
      ]
    },
    {
      "name": "安徽省",
      "code": "120000",
      "city": [
        {
          "name": "合肥市",
          "code": "120100",
          "district": [
            {
              "name": "蜀山区",
              "code": "120101"
            },
            {
              "name": "瑶海区",
              "code": "120102"
            },
            {
              "name": "庐阳区",
              "code": "120103"
            },
            {
              "name": "包河区",
              "code": "120104"
            },
            {
              "name": "巢湖市",
              "code": "120105"
            },
            {
              "name": "长丰县",
              "code": "120106"
            },
            {
              "name": "肥东县",
              "code": "120107"
            },
            {
              "name": "肥西县",
              "code": "120108"
            },
            {
              "name": "庐江县",
              "code": "120109"
            }
          ]
        },
        {
          "name": "芜湖市",
          "code": "120200",
          "district": [
            {
              "name": "鸠江区",
              "code": "120201"
            },
            {
              "name": "镜湖区",
              "code": "120202"
            },
            {
              "name": "弋江区",
              "code": "120203"
            },
            {
              "name": "三山区",
              "code": "120204"
            },
            {
              "name": "芜湖县",
              "code": "120205"
            },
            {
              "name": "繁昌县",
              "code": "120206"
            },
            {
              "name": "南陵县",
              "code": "120207"
            },
            {
              "name": "无为县",
              "code": "120208"
            }
          ]
        },
        {
          "name": "蚌埠市",
          "code": "120300",
          "district": [
            {
              "name": "蚌山区",
              "code": "120301"
            },
            {
              "name": "龙子湖区",
              "code": "120302"
            },
            {
              "name": "禹会区",
              "code": "120303"
            },
            {
              "name": "淮上区",
              "code": "120304"
            },
            {
              "name": "怀远县",
              "code": "120305"
            },
            {
              "name": "五河县",
              "code": "120306"
            },
            {
              "name": "固镇县",
              "code": "120307"
            }
          ]
        },
        {
          "name": "淮南市",
          "code": "120400",
          "district": [
            {
              "name": "田家庵区",
              "code": "120401"
            },
            {
              "name": "大通区",
              "code": "120402"
            },
            {
              "name": "谢家集区",
              "code": "120403"
            },
            {
              "name": "八公山区",
              "code": "120404"
            },
            {
              "name": "潘集区",
              "code": "120405"
            },
            {
              "name": "凤台县",
              "code": "120406"
            },
            {
              "name": "寿县",
              "code": "120407"
            }
          ]
        },
        {
          "name": "马鞍山市",
          "code": "120500",
          "district": [
            {
              "name": "雨山区",
              "code": "120501"
            },
            {
              "name": "花山区",
              "code": "120502"
            },
            {
              "name": "博望区",
              "code": "120503"
            },
            {
              "name": "当涂县",
              "code": "120504"
            },
            {
              "name": "含山县",
              "code": "120505"
            },
            {
              "name": "和县",
              "code": "120506"
            }
          ]
        },
        {
          "name": "淮北市",
          "code": "120600",
          "district": [
            {
              "name": "相山区",
              "code": "120601"
            },
            {
              "name": "杜集区",
              "code": "120602"
            },
            {
              "name": "烈山区",
              "code": "120603"
            },
            {
              "name": "濉溪县",
              "code": "120604"
            }
          ]
        },
        {
          "name": "铜陵市",
          "code": "120700",
          "district": [
            {
              "name": "铜官区",
              "code": "120701"
            },
            {
              "name": "义安区",
              "code": "120702"
            },
            {
              "name": "郊区",
              "code": "120703"
            },
            {
              "name": "枞阳县",
              "code": "120704"
            }
          ]
        },
        {
          "name": "安庆市",
          "code": "120800",
          "district": [
            {
              "name": "大观区",
              "code": "120801"
            },
            {
              "name": "迎江区",
              "code": "120802"
            },
            {
              "name": "宜秀区",
              "code": "120803"
            },
            {
              "name": "桐城市",
              "code": "120804"
            },
            {
              "name": "怀宁县",
              "code": "120805"
            },
            {
              "name": "潜山县",
              "code": "120806"
            },
            {
              "name": "太湖县",
              "code": "120807"
            },
            {
              "name": "宿松县",
              "code": "120808"
            },
            {
              "name": "望江县",
              "code": "120809"
            },
            {
              "name": "岳西县",
              "code": "120810"
            }
          ]
        },
        {
          "name": "黄山市",
          "code": "120900",
          "district": [
            {
              "name": "屯溪区",
              "code": "120901"
            },
            {
              "name": "黄山区",
              "code": "120902"
            },
            {
              "name": "徽州区",
              "code": "120903"
            },
            {
              "name": "歙县",
              "code": "120904"
            },
            {
              "name": "休宁县",
              "code": "120905"
            },
            {
              "name": "黟县",
              "code": "120906"
            },
            {
              "name": "祁门县",
              "code": "120907"
            }
          ]
        },
        {
          "name": "滁州市",
          "code": "121000",
          "district": [
            {
              "name": "琅琊区",
              "code": "121001"
            },
            {
              "name": "南谯区",
              "code": "121002"
            },
            {
              "name": "天长市",
              "code": "121003"
            },
            {
              "name": "明光市",
              "code": "121004"
            },
            {
              "name": "来安县",
              "code": "121005"
            },
            {
              "name": "全椒县",
              "code": "121006"
            },
            {
              "name": "定远县",
              "code": "121007"
            },
            {
              "name": "凤阳县",
              "code": "121008"
            }
          ]
        },
        {
          "name": "阜阳市",
          "code": "121100",
          "district": [
            {
              "name": "颍州区",
              "code": "121101"
            },
            {
              "name": "颍东区",
              "code": "121102"
            },
            {
              "name": "颍泉区",
              "code": "121103"
            },
            {
              "name": "界首市",
              "code": "121104"
            },
            {
              "name": "临泉县",
              "code": "121105"
            },
            {
              "name": "太和县",
              "code": "121106"
            },
            {
              "name": "阜南县",
              "code": "121107"
            },
            {
              "name": "颍上县",
              "code": "121108"
            }
          ]
        },
        {
          "name": "宿州市",
          "code": "121200",
          "district": [
            {
              "name": "埇桥区",
              "code": "121201"
            },
            {
              "name": "砀山县",
              "code": "121202"
            },
            {
              "name": "萧县",
              "code": "121203"
            },
            {
              "name": "灵璧县",
              "code": "121204"
            },
            {
              "name": "泗县",
              "code": "121205"
            }
          ]
        },
        {
          "name": "六安市",
          "code": "121300",
          "district": [
            {
              "name": "金安区",
              "code": "121301"
            },
            {
              "name": "裕安区",
              "code": "121302"
            },
            {
              "name": "叶集区",
              "code": "121303"
            },
            {
              "name": "霍邱县",
              "code": "121304"
            },
            {
              "name": "舒城县",
              "code": "121305"
            },
            {
              "name": "金寨县",
              "code": "121306"
            },
            {
              "name": "霍山县",
              "code": "121307"
            }
          ]
        },
        {
          "name": "亳州市",
          "code": "121400",
          "district": [
            {
              "name": "谯城区",
              "code": "121401"
            },
            {
              "name": "涡阳县",
              "code": "121402"
            },
            {
              "name": "蒙城县",
              "code": "121403"
            },
            {
              "name": "利辛县",
              "code": "121404"
            }
          ]
        },
        {
          "name": "池州市",
          "code": "121500",
          "district": [
            {
              "name": "贵池区",
              "code": "121501"
            },
            {
              "name": "东至县",
              "code": "121502"
            },
            {
              "name": "石台县",
              "code": "121503"
            },
            {
              "name": "青阳县",
              "code": "121504"
            }
          ]
        },
        {
          "name": "宣城市",
          "code": "121600",
          "district": [
            {
              "name": "宣州区",
              "code": "121601"
            },
            {
              "name": "宁国市",
              "code": "121602"
            },
            {
              "name": "郎溪县",
              "code": "121603"
            },
            {
              "name": "广德县",
              "code": "121604"
            },
            {
              "name": "泾县",
              "code": "121605"
            },
            {
              "name": "绩溪县",
              "code": "121606"
            },
            {
              "name": "旌德县",
              "code": "121607"
            }
          ]
        }
      ]
    },
    {
      "name": "福建省",
      "code": "130000",
      "city": [
        {
          "name": "福州市",
          "code": "130100",
          "district": [
            {
              "name": "鼓楼区",
              "code": "130101"
            },
            {
              "name": "台江区",
              "code": "130102"
            },
            {
              "name": "仓山区",
              "code": "130103"
            },
            {
              "name": "马尾区",
              "code": "130104"
            },
            {
              "name": "晋安区",
              "code": "130105"
            },
            {
              "name": "长乐市",
              "code": "130106"
            },
            {
              "name": "福清市",
              "code": "130107"
            },
            {
              "name": "闽侯县",
              "code": "130108"
            },
            {
              "name": "连江县",
              "code": "130109"
            },
            {
              "name": "罗源县",
              "code": "130110"
            },
            {
              "name": "闽清县",
              "code": "130111"
            },
            {
              "name": "永泰县",
              "code": "130112"
            },
            {
              "name": "平潭县",
              "code": "130113"
            }
          ]
        },
        {
          "name": "厦门市",
          "code": "130200",
          "district": [
            {
              "name": "思明区",
              "code": "130201"
            },
            {
              "name": "海沧区",
              "code": "130202"
            },
            {
              "name": "湖里区",
              "code": "130203"
            },
            {
              "name": "集美区",
              "code": "130204"
            },
            {
              "name": "同安区",
              "code": "130205"
            },
            {
              "name": "翔安区",
              "code": "130206"
            }
          ]
        },
        {
          "name": "莆田市",
          "code": "130300",
          "district": [
            {
              "name": "城厢区",
              "code": "130301"
            },
            {
              "name": "涵江区",
              "code": "130302"
            },
            {
              "name": "荔城区",
              "code": "130303"
            },
            {
              "name": "秀屿区",
              "code": "130304"
            },
            {
              "name": "仙游县",
              "code": "130305"
            }
          ]
        },
        {
          "name": "三明市",
          "code": "130400",
          "district": [
            {
              "name": "梅列区",
              "code": "130401"
            },
            {
              "name": "三元区",
              "code": "130402"
            },
            {
              "name": "永安市",
              "code": "130403"
            },
            {
              "name": "明溪县",
              "code": "130404"
            },
            {
              "name": "清流县",
              "code": "130405"
            },
            {
              "name": "宁化县",
              "code": "130406"
            },
            {
              "name": "大田县",
              "code": "130407"
            },
            {
              "name": "尤溪县",
              "code": "130408"
            },
            {
              "name": "沙县",
              "code": "130409"
            },
            {
              "name": "将乐县",
              "code": "130410"
            },
            {
              "name": "泰宁县",
              "code": "130411"
            },
            {
              "name": "建宁县",
              "code": "130412"
            }
          ]
        },
        {
          "name": "泉州市",
          "code": "130500",
          "district": [
            {
              "name": "丰泽区",
              "code": "130501"
            },
            {
              "name": "鲤城区",
              "code": "130502"
            },
            {
              "name": "洛江区",
              "code": "130503"
            },
            {
              "name": "泉港区",
              "code": "130504"
            },
            {
              "name": "石狮市",
              "code": "130505"
            },
            {
              "name": "晋江市",
              "code": "130506"
            },
            {
              "name": "南安市",
              "code": "130507"
            },
            {
              "name": "惠安县",
              "code": "130508"
            },
            {
              "name": "安溪县",
              "code": "130509"
            },
            {
              "name": "永春县",
              "code": "130510"
            },
            {
              "name": "德化县",
              "code": "130511"
            },
            {
              "name": "金门县",
              "code": "130512"
            }
          ]
        },
        {
          "name": "漳州市",
          "code": "130600",
          "district": [
            {
              "name": "龙文区",
              "code": "130601"
            },
            {
              "name": "芗城区",
              "code": "130602"
            },
            {
              "name": "龙海市",
              "code": "130603"
            },
            {
              "name": "云霄县",
              "code": "130604"
            },
            {
              "name": "漳浦县",
              "code": "130605"
            },
            {
              "name": "诏安县",
              "code": "130606"
            },
            {
              "name": "长泰县",
              "code": "130607"
            },
            {
              "name": "东山县",
              "code": "130608"
            },
            {
              "name": "南靖县",
              "code": "130609"
            },
            {
              "name": "平和县",
              "code": "130610"
            },
            {
              "name": "华安县",
              "code": "130611"
            }
          ]
        },
        {
          "name": "南平市",
          "code": "130700",
          "district": [
            {
              "name": "建阳区",
              "code": "130701"
            },
            {
              "name": "延平区",
              "code": "130702"
            },
            {
              "name": "邵武市",
              "code": "130703"
            },
            {
              "name": "武夷山市",
              "code": "130704"
            },
            {
              "name": "建瓯市",
              "code": "130705"
            },
            {
              "name": "顺昌县",
              "code": "130706"
            },
            {
              "name": "浦城县",
              "code": "130707"
            },
            {
              "name": "光泽县",
              "code": "130708"
            },
            {
              "name": "松溪县",
              "code": "130709"
            },
            {
              "name": "政和县",
              "code": "130710"
            }
          ]
        },
        {
          "name": "龙岩市",
          "code": "130800",
          "district": [
            {
              "name": "新罗区",
              "code": "130801"
            },
            {
              "name": "永定县",
              "code": "130802"
            },
            {
              "name": "漳平市",
              "code": "130803"
            },
            {
              "name": "长汀县",
              "code": "130804"
            },
            {
              "name": "上杭县",
              "code": "130805"
            },
            {
              "name": "武平县",
              "code": "130806"
            },
            {
              "name": "连城县",
              "code": "130807"
            }
          ]
        },
        {
          "name": "宁德市",
          "code": "130900",
          "district": [
            {
              "name": "蕉城区",
              "code": "130901"
            },
            {
              "name": "福安市",
              "code": "130902"
            },
            {
              "name": "福鼎市",
              "code": "130903"
            },
            {
              "name": "霞浦县",
              "code": "130904"
            },
            {
              "name": "古田县",
              "code": "130905"
            },
            {
              "name": "屏南县",
              "code": "130906"
            },
            {
              "name": "寿宁县",
              "code": "130907"
            },
            {
              "name": "周宁县",
              "code": "130908"
            },
            {
              "name": "柘荣县",
              "code": "130909"
            }
          ]
        }
      ]
    },
    {
      "name": "江西省",
      "code": "140000",
      "city": [
        {
          "name": "南昌市",
          "code": "140100",
          "district": [
            {
              "name": "东湖区",
              "code": "140101"
            },
            {
              "name": "西湖区",
              "code": "140102"
            },
            {
              "name": "青云谱区",
              "code": "140103"
            },
            {
              "name": "湾里区",
              "code": "140104"
            },
            {
              "name": "青山湖区",
              "code": "140105"
            },
            {
              "name": "新建县",
              "code": "140106"
            },
            {
              "name": "南昌县",
              "code": "140107"
            },
            {
              "name": "安义县",
              "code": "140108"
            },
            {
              "name": "进贤县",
              "code": "140109"
            }
          ]
        },
        {
          "name": "景德镇市",
          "code": "140200",
          "district": [
            {
              "name": "昌江区",
              "code": "140201"
            },
            {
              "name": "珠山区",
              "code": "140202"
            },
            {
              "name": "乐平市",
              "code": "140203"
            },
            {
              "name": "浮梁县",
              "code": "140204"
            }
          ]
        },
        {
          "name": "萍乡市",
          "code": "140300",
          "district": [
            {
              "name": "安源区",
              "code": "140301"
            },
            {
              "name": "湘东区",
              "code": "140302"
            },
            {
              "name": "莲花县",
              "code": "140303"
            },
            {
              "name": "上栗县",
              "code": "140304"
            },
            {
              "name": "芦溪县",
              "code": "140305"
            }
          ]
        },
        {
          "name": "九江市",
          "code": "140400",
          "district": [
            {
              "name": "浔阳区",
              "code": "140401"
            },
            {
              "name": "濂溪区",
              "code": "140402"
            },
            {
              "name": "柴桑区",
              "code": "140403"
            },
            {
              "name": "瑞昌市",
              "code": "140404"
            },
            {
              "name": "共青城市",
              "code": "140405"
            },
            {
              "name": "庐山市",
              "code": "140406"
            },
            {
              "name": "武宁县",
              "code": "140407"
            },
            {
              "name": "修水县",
              "code": "140408"
            },
            {
              "name": "永修县",
              "code": "140409"
            },
            {
              "name": "德安县",
              "code": "140410"
            },
            {
              "name": "都昌县",
              "code": "140411"
            },
            {
              "name": "湖口县",
              "code": "140412"
            },
            {
              "name": "彭泽县",
              "code": "140413"
            }
          ]
        },
        {
          "name": "新余市",
          "code": "140500",
          "district": [
            {
              "name": "渝水区",
              "code": "140501"
            },
            {
              "name": "分宜县",
              "code": "140502"
            }
          ]
        },
        {
          "name": "鹰潭市",
          "code": "140600",
          "district": [
            {
              "name": "月湖区",
              "code": "140601"
            },
            {
              "name": "贵溪市",
              "code": "140602"
            },
            {
              "name": "余江县",
              "code": "140603"
            }
          ]
        },
        {
          "name": "赣州市",
          "code": "140700",
          "district": [
            {
              "name": "章贡区",
              "code": "140701"
            },
            {
              "name": "南康区",
              "code": "140702"
            },
            {
              "name": "赣县区",
              "code": "140703"
            },
            {
              "name": "瑞金市",
              "code": "140704"
            },
            {
              "name": "信丰县",
              "code": "140705"
            },
            {
              "name": "大余县",
              "code": "140706"
            },
            {
              "name": "上犹县",
              "code": "140707"
            },
            {
              "name": "崇义县",
              "code": "140708"
            },
            {
              "name": "安远县",
              "code": "140709"
            },
            {
              "name": "龙南县",
              "code": "140710"
            },
            {
              "name": "定南县",
              "code": "140711"
            },
            {
              "name": "全南县",
              "code": "140712"
            },
            {
              "name": "宁都县",
              "code": "140713"
            },
            {
              "name": "于都县",
              "code": "140714"
            },
            {
              "name": "兴国县",
              "code": "140715"
            },
            {
              "name": "会昌县",
              "code": "140716"
            },
            {
              "name": "寻乌县",
              "code": "140717"
            },
            {
              "name": "石城县",
              "code": "140718"
            }
          ]
        },
        {
          "name": "吉安市",
          "code": "140800",
          "district": [
            {
              "name": "吉州区",
              "code": "140801"
            },
            {
              "name": "青原区",
              "code": "140802"
            },
            {
              "name": "井冈山市",
              "code": "140803"
            },
            {
              "name": "吉安县",
              "code": "140804"
            },
            {
              "name": "吉水县",
              "code": "140805"
            },
            {
              "name": "峡江县",
              "code": "140806"
            },
            {
              "name": "新干县",
              "code": "140807"
            },
            {
              "name": "永丰县",
              "code": "140808"
            },
            {
              "name": "泰和县",
              "code": "140809"
            },
            {
              "name": "遂川县",
              "code": "140810"
            },
            {
              "name": "万安县",
              "code": "140811"
            },
            {
              "name": "安福县",
              "code": "140812"
            },
            {
              "name": "永新县",
              "code": "140813"
            }
          ]
        },
        {
          "name": "宜春市",
          "code": "140900",
          "district": [
            {
              "name": "袁州区",
              "code": "140901"
            },
            {
              "name": "丰城市",
              "code": "140902"
            },
            {
              "name": "樟树市",
              "code": "140903"
            },
            {
              "name": "高安市",
              "code": "140904"
            },
            {
              "name": "奉新县",
              "code": "140905"
            },
            {
              "name": "万载县",
              "code": "140906"
            },
            {
              "name": "上高县",
              "code": "140907"
            },
            {
              "name": "宜丰县",
              "code": "140908"
            },
            {
              "name": "靖安县",
              "code": "140909"
            },
            {
              "name": "铜鼓县",
              "code": "140910"
            }
          ]
        },
        {
          "name": "抚州市",
          "code": "141000",
          "district": [
            {
              "name": "临川区",
              "code": "141001"
            },
            {
              "name": "东乡县",
              "code": "141002"
            },
            {
              "name": "南城县",
              "code": "141003"
            },
            {
              "name": "黎川县",
              "code": "141004"
            },
            {
              "name": "南丰县",
              "code": "141005"
            },
            {
              "name": "崇仁县",
              "code": "141006"
            },
            {
              "name": "乐安县",
              "code": "141007"
            },
            {
              "name": "宜黄县",
              "code": "141008"
            },
            {
              "name": "金溪县",
              "code": "141009"
            },
            {
              "name": "资溪县",
              "code": "141010"
            },
            {
              "name": "广昌县",
              "code": "141011"
            }
          ]
        },
        {
          "name": "上饶市",
          "code": "141100",
          "district": [
            {
              "name": "信州区",
              "code": "141101"
            },
            {
              "name": "广丰县",
              "code": "141102"
            },
            {
              "name": "德兴市",
              "code": "141103"
            },
            {
              "name": "上饶县",
              "code": "141104"
            },
            {
              "name": "玉山县",
              "code": "141105"
            },
            {
              "name": "铅山县",
              "code": "141106"
            },
            {
              "name": "横峰县",
              "code": "141107"
            },
            {
              "name": "弋阳县",
              "code": "141108"
            },
            {
              "name": "余干县",
              "code": "141109"
            },
            {
              "name": "鄱阳县",
              "code": "141110"
            },
            {
              "name": "万年县",
              "code": "141111"
            },
            {
              "name": "婺源县",
              "code": "141112"
            }
          ]
        }
      ]
    },
    {
      "name": "山东省",
      "code": "150000",
      "city": [
        {
          "name": "济南市",
          "code": "150100",
          "district": [
            {
              "name": "市中区",
              "code": "150101"
            },
            {
              "name": "历下区",
              "code": "150102"
            },
            {
              "name": "槐荫区",
              "code": "150103"
            },
            {
              "name": "天桥区",
              "code": "150104"
            },
            {
              "name": "历城区",
              "code": "150105"
            },
            {
              "name": "长清区",
              "code": "150106"
            },
            {
              "name": "章丘市",
              "code": "150107"
            },
            {
              "name": "平阴县",
              "code": "150108"
            },
            {
              "name": "济阳县",
              "code": "150109"
            },
            {
              "name": "商河县",
              "code": "150110"
            }
          ]
        },
        {
          "name": "青岛市",
          "code": "150200",
          "district": [
            {
              "name": "市南区",
              "code": "150201"
            },
            {
              "name": "市北区",
              "code": "150202"
            },
            {
              "name": "黄岛区",
              "code": "150203"
            },
            {
              "name": "崂山区",
              "code": "150204"
            },
            {
              "name": "李沧区",
              "code": "150205"
            },
            {
              "name": "城阳区",
              "code": "150206"
            },
            {
              "name": "即墨市",
              "code": "150207"
            },
            {
              "name": "胶州市",
              "code": "150208"
            },
            {
              "name": "平度市",
              "code": "150209"
            },
            {
              "name": "莱西市",
              "code": "150210"
            }
          ]
        },
        {
          "name": "淄博市",
          "code": "150300",
          "district": [
            {
              "name": "张店区",
              "code": "150301"
            },
            {
              "name": "淄川区",
              "code": "150302"
            },
            {
              "name": "博山区",
              "code": "150303"
            },
            {
              "name": "临淄区",
              "code": "150304"
            },
            {
              "name": "周村区",
              "code": "150305"
            },
            {
              "name": "桓台县",
              "code": "150306"
            },
            {
              "name": "高青县",
              "code": "150307"
            },
            {
              "name": "沂源县",
              "code": "150308"
            }
          ]
        },
        {
          "name": "枣庄市",
          "code": "150400",
          "district": [
            {
              "name": "薛城区",
              "code": "150401"
            },
            {
              "name": "市中区",
              "code": "150402"
            },
            {
              "name": "峄城区",
              "code": "150403"
            },
            {
              "name": "台儿庄区",
              "code": "150404"
            },
            {
              "name": "山亭区",
              "code": "150405"
            },
            {
              "name": "滕州市",
              "code": "150406"
            }
          ]
        },
        {
          "name": "东营市",
          "code": "150500",
          "district": [
            {
              "name": "东营区",
              "code": "150501"
            },
            {
              "name": "河口区",
              "code": "150502"
            },
            {
              "name": "垦利县",
              "code": "150503"
            },
            {
              "name": "利津县",
              "code": "150504"
            },
            {
              "name": "广饶县",
              "code": "150505"
            }
          ]
        },
        {
          "name": "烟台市",
          "code": "150600",
          "district": [
            {
              "name": "莱山区",
              "code": "150601"
            },
            {
              "name": "芝罘区",
              "code": "150602"
            },
            {
              "name": "福山区",
              "code": "150603"
            },
            {
              "name": "牟平区",
              "code": "150604"
            },
            {
              "name": "龙口市",
              "code": "150605"
            },
            {
              "name": "莱阳市",
              "code": "150606"
            },
            {
              "name": "莱州市",
              "code": "150607"
            },
            {
              "name": "蓬莱市",
              "code": "150608"
            },
            {
              "name": "招远市",
              "code": "150609"
            },
            {
              "name": "栖霞市",
              "code": "150610"
            },
            {
              "name": "海阳市",
              "code": "150611"
            },
            {
              "name": "长岛县",
              "code": "150612"
            }
          ]
        },
        {
          "name": "潍坊市",
          "code": "150700",
          "district": [
            {
              "name": "奎文区",
              "code": "150701"
            },
            {
              "name": "潍城区",
              "code": "150702"
            },
            {
              "name": "寒亭区",
              "code": "150703"
            },
            {
              "name": "坊子区",
              "code": "150704"
            },
            {
              "name": "青州市",
              "code": "150705"
            },
            {
              "name": "诸城市",
              "code": "150706"
            },
            {
              "name": "寿光市",
              "code": "150707"
            },
            {
              "name": "安丘市",
              "code": "150708"
            },
            {
              "name": "高密市",
              "code": "150709"
            },
            {
              "name": "昌邑市",
              "code": "150710"
            },
            {
              "name": "临朐县",
              "code": "150711"
            },
            {
              "name": "昌乐县",
              "code": "150712"
            }
          ]
        },
        {
          "name": "济宁市",
          "code": "150800",
          "district": [
            {
              "name": "任城区",
              "code": "150801"
            },
            {
              "name": "兖州市",
              "code": "150802"
            },
            {
              "name": "曲阜市",
              "code": "150803"
            },
            {
              "name": "邹城市",
              "code": "150804"
            },
            {
              "name": "微山县",
              "code": "150805"
            },
            {
              "name": "鱼台县",
              "code": "150806"
            },
            {
              "name": "金乡县",
              "code": "150807"
            },
            {
              "name": "嘉祥县",
              "code": "150808"
            },
            {
              "name": "汶上县",
              "code": "150809"
            },
            {
              "name": "泗水县",
              "code": "150810"
            },
            {
              "name": "梁山县",
              "code": "150811"
            }
          ]
        },
        {
          "name": "泰安市",
          "code": "150900",
          "district": [
            {
              "name": "泰山区",
              "code": "150901"
            },
            {
              "name": "岱岳区",
              "code": "150902"
            },
            {
              "name": "新泰市",
              "code": "150903"
            },
            {
              "name": "肥城市",
              "code": "150904"
            },
            {
              "name": "宁阳县",
              "code": "150905"
            },
            {
              "name": "东平县",
              "code": "150906"
            }
          ]
        },
        {
          "name": "威海市",
          "code": "151000",
          "district": [
            {
              "name": "环翠区",
              "code": "151001"
            },
            {
              "name": "文登区",
              "code": "151002"
            },
            {
              "name": "荣成市",
              "code": "151003"
            },
            {
              "name": "乳山市",
              "code": "151004"
            }
          ]
        },
        {
          "name": "日照市",
          "code": "151100",
          "district": [
            {
              "name": "东港区",
              "code": "151101"
            },
            {
              "name": "岚山区",
              "code": "151102"
            },
            {
              "name": "五莲县",
              "code": "151103"
            },
            {
              "name": "莒县",
              "code": "151104"
            }
          ]
        },
        {
          "name": "莱芜市",
          "code": "151200",
          "district": [
            {
              "name": "莱城区",
              "code": "151201"
            },
            {
              "name": "钢城区",
              "code": "151202"
            }
          ]
        },
        {
          "name": "临沂市",
          "code": "151300",
          "district": [
            {
              "name": "兰山区",
              "code": "151301"
            },
            {
              "name": "罗庄区",
              "code": "151302"
            },
            {
              "name": "河东区",
              "code": "151303"
            },
            {
              "name": "沂南县",
              "code": "151304"
            },
            {
              "name": "郯城县",
              "code": "151305"
            },
            {
              "name": "沂水县",
              "code": "151306"
            },
            {
              "name": "兰陵县",
              "code": "151307"
            },
            {
              "name": "费县",
              "code": "151308"
            },
            {
              "name": "平邑县",
              "code": "151309"
            },
            {
              "name": "莒南县",
              "code": "151310"
            },
            {
              "name": "蒙阴县",
              "code": "151311"
            },
            {
              "name": "临沭县",
              "code": "151312"
            }
          ]
        },
        {
          "name": "德州市",
          "code": "151400",
          "district": [
            {
              "name": "德城区",
              "code": "151401"
            },
            {
              "name": "陵城区",
              "code": "151402"
            },
            {
              "name": "乐陵市",
              "code": "151403"
            },
            {
              "name": "禹城市",
              "code": "151404"
            },
            {
              "name": "宁津县",
              "code": "151405"
            },
            {
              "name": "庆云县",
              "code": "151406"
            },
            {
              "name": "临邑县",
              "code": "151407"
            },
            {
              "name": "齐河县",
              "code": "151408"
            },
            {
              "name": "平原县",
              "code": "151409"
            },
            {
              "name": "夏津县",
              "code": "151410"
            },
            {
              "name": "武城县",
              "code": "151411"
            }
          ]
        },
        {
          "name": "聊城市",
          "code": "151500",
          "district": [
            {
              "name": "东昌府区",
              "code": "151501"
            },
            {
              "name": "临清市",
              "code": "151502"
            },
            {
              "name": "阳谷县",
              "code": "151503"
            },
            {
              "name": "莘县",
              "code": "151504"
            },
            {
              "name": "茌平县",
              "code": "151505"
            },
            {
              "name": "东阿县",
              "code": "151506"
            },
            {
              "name": "冠县",
              "code": "151507"
            },
            {
              "name": "高唐县",
              "code": "151508"
            }
          ]
        },
        {
          "name": "滨州市",
          "code": "151600",
          "district": [
            {
              "name": "滨城区",
              "code": "151601"
            },
            {
              "name": "沾化县",
              "code": "151602"
            },
            {
              "name": "惠民县",
              "code": "151603"
            },
            {
              "name": "阳信县",
              "code": "151604"
            },
            {
              "name": "无棣县",
              "code": "151605"
            },
            {
              "name": "博兴县",
              "code": "151606"
            },
            {
              "name": "邹平县",
              "code": "151607"
            }
          ]
        },
        {
          "name": "菏泽市",
          "code": "151700",
          "district": [
            {
              "name": "牡丹区",
              "code": "151701"
            },
            {
              "name": "定陶区",
              "code": "151702"
            },
            {
              "name": "曹县",
              "code": "151703"
            },
            {
              "name": "单县",
              "code": "151704"
            },
            {
              "name": "成武县",
              "code": "151705"
            },
            {
              "name": "巨野县",
              "code": "151706"
            },
            {
              "name": "郓城县",
              "code": "151707"
            },
            {
              "name": "鄄城县",
              "code": "151708"
            },
            {
              "name": "东明县",
              "code": "151709"
            }
          ]
        }
      ]
    },
    {
      "name": "河南省",
      "code": "160000",
      "city": [
        {
          "name": "郑州市",
          "code": "160100",
          "district": [
            {
              "name": "中原区",
              "code": "160101"
            },
            {
              "name": "二七区",
              "code": "160102"
            },
            {
              "name": "管城回族区",
              "code": "160103"
            },
            {
              "name": "金水区",
              "code": "160104"
            },
            {
              "name": "上街区",
              "code": "160105"
            },
            {
              "name": "惠济区",
              "code": "160106"
            },
            {
              "name": "巩义市",
              "code": "160107"
            },
            {
              "name": "荥阳市",
              "code": "160108"
            },
            {
              "name": "新密市",
              "code": "160109"
            },
            {
              "name": "新郑市",
              "code": "160110"
            },
            {
              "name": "登封市",
              "code": "160111"
            },
            {
              "name": "中牟县",
              "code": "160112"
            }
          ]
        },
        {
          "name": "开封市",
          "code": "160200",
          "district": [
            {
              "name": "鼓楼区",
              "code": "160201"
            },
            {
              "name": "龙亭区",
              "code": "160202"
            },
            {
              "name": "顺河回族区",
              "code": "160203"
            },
            {
              "name": "禹王台区",
              "code": "160204"
            },
            {
              "name": "祥符区",
              "code": "160205"
            },
            {
              "name": "杞县",
              "code": "160206"
            },
            {
              "name": "通许县",
              "code": "160207"
            },
            {
              "name": "尉氏县",
              "code": "160208"
            },
            {
              "name": "兰考县",
              "code": "160209"
            }
          ]
        },
        {
          "name": "洛阳市",
          "code": "160300",
          "district": [
            {
              "name": "西工区",
              "code": "160301"
            },
            {
              "name": "老城区",
              "code": "160302"
            },
            {
              "name": "瀍河回族区",
              "code": "160303"
            },
            {
              "name": "涧西区",
              "code": "160304"
            },
            {
              "name": "吉利区",
              "code": "160305"
            },
            {
              "name": "洛龙区",
              "code": "160306"
            },
            {
              "name": "偃师市",
              "code": "160307"
            },
            {
              "name": "孟津县",
              "code": "160308"
            },
            {
              "name": "新安县",
              "code": "160309"
            },
            {
              "name": "栾川县",
              "code": "160310"
            },
            {
              "name": "嵩县",
              "code": "160311"
            },
            {
              "name": "汝阳县",
              "code": "160312"
            },
            {
              "name": "宜阳县",
              "code": "160313"
            },
            {
              "name": "洛宁县",
              "code": "160314"
            },
            {
              "name": "伊川县",
              "code": "160315"
            }
          ]
        },
        {
          "name": "平顶山市",
          "code": "160400",
          "district": [
            {
              "name": "新华区",
              "code": "160401"
            },
            {
              "name": "卫东区",
              "code": "160402"
            },
            {
              "name": "石龙区",
              "code": "160403"
            },
            {
              "name": "湛河区",
              "code": "160404"
            },
            {
              "name": "舞钢市",
              "code": "160405"
            },
            {
              "name": "汝州市",
              "code": "160406"
            },
            {
              "name": "宝丰县",
              "code": "160407"
            },
            {
              "name": "叶县",
              "code": "160408"
            },
            {
              "name": "鲁山县",
              "code": "160409"
            },
            {
              "name": "郏县",
              "code": "160410"
            }
          ]
        },
        {
          "name": "安阳市",
          "code": "160500",
          "district": [
            {
              "name": "北关区",
              "code": "160501"
            },
            {
              "name": "文峰区",
              "code": "160502"
            },
            {
              "name": "殷都区",
              "code": "160503"
            },
            {
              "name": "龙安区",
              "code": "160504"
            },
            {
              "name": "林州市",
              "code": "160505"
            },
            {
              "name": "安阳县",
              "code": "160506"
            },
            {
              "name": "汤阴县",
              "code": "160507"
            },
            {
              "name": "滑县",
              "code": "160508"
            },
            {
              "name": "内黄县",
              "code": "160509"
            }
          ]
        },
        {
          "name": "鹤壁市",
          "code": "160600",
          "district": [
            {
              "name": "淇滨区",
              "code": "160601"
            },
            {
              "name": "鹤山区",
              "code": "160602"
            },
            {
              "name": "山城区",
              "code": "160603"
            },
            {
              "name": "浚县",
              "code": "160604"
            },
            {
              "name": "淇县",
              "code": "160605"
            }
          ]
        },
        {
          "name": "新乡市",
          "code": "160700",
          "district": [
            {
              "name": "卫滨区",
              "code": "160701"
            },
            {
              "name": "红旗区",
              "code": "160702"
            },
            {
              "name": "凤泉区",
              "code": "160703"
            },
            {
              "name": "牧野区",
              "code": "160704"
            },
            {
              "name": "卫辉市",
              "code": "160705"
            },
            {
              "name": "辉县市",
              "code": "160706"
            },
            {
              "name": "新乡县",
              "code": "160707"
            },
            {
              "name": "获嘉县",
              "code": "160708"
            },
            {
              "name": "原阳县",
              "code": "160709"
            },
            {
              "name": "延津县",
              "code": "160710"
            },
            {
              "name": "封丘县",
              "code": "160711"
            },
            {
              "name": "长垣县",
              "code": "160712"
            }
          ]
        },
        {
          "name": "焦作市",
          "code": "160800",
          "district": [
            {
              "name": "解放区",
              "code": "160801"
            },
            {
              "name": "中站区",
              "code": "160802"
            },
            {
              "name": "马村区",
              "code": "160803"
            },
            {
              "name": "山阳区",
              "code": "160804"
            },
            {
              "name": "沁阳市",
              "code": "160805"
            },
            {
              "name": "孟州市",
              "code": "160806"
            },
            {
              "name": "修武县",
              "code": "160807"
            },
            {
              "name": "博爱县",
              "code": "160808"
            },
            {
              "name": "武陟县",
              "code": "160809"
            },
            {
              "name": "温县",
              "code": "160810"
            }
          ]
        },
        {
          "name": "濮阳市",
          "code": "160900",
          "district": [
            {
              "name": "华龙区",
              "code": "160901"
            },
            {
              "name": "清丰县",
              "code": "160902"
            },
            {
              "name": "南乐县",
              "code": "160903"
            },
            {
              "name": "范县",
              "code": "160904"
            },
            {
              "name": "台前县",
              "code": "160905"
            },
            {
              "name": "濮阳县",
              "code": "160906"
            }
          ]
        },
        {
          "name": "许昌市",
          "code": "161000",
          "district": [
            {
              "name": "魏都区",
              "code": "161001"
            },
            {
              "name": "建安区",
              "code": "161002"
            },
            {
              "name": "禹州市",
              "code": "161003"
            },
            {
              "name": "长葛市",
              "code": "161004"
            },
            {
              "name": "鄢陵县",
              "code": "161005"
            },
            {
              "name": "襄城县",
              "code": "161006"
            }
          ]
        },
        {
          "name": "漯河市",
          "code": "161100",
          "district": [
            {
              "name": "郾城区",
              "code": "161101"
            },
            {
              "name": "源汇区",
              "code": "161102"
            },
            {
              "name": "召陵区",
              "code": "161103"
            },
            {
              "name": "舞阳县",
              "code": "161104"
            },
            {
              "name": "临颍县",
              "code": "161105"
            }
          ]
        },
        {
          "name": "三门峡市",
          "code": "161200",
          "district": [
            {
              "name": "湖滨区",
              "code": "161201"
            },
            {
              "name": "陕州区",
              "code": "161202"
            },
            {
              "name": "义马市",
              "code": "161203"
            },
            {
              "name": "灵宝市",
              "code": "161204"
            },
            {
              "name": "渑池县",
              "code": "161205"
            },
            {
              "name": "卢氏县",
              "code": "161206"
            }
          ]
        },
        {
          "name": "南阳市",
          "code": "161300",
          "district": [
            {
              "name": "卧龙区",
              "code": "161301"
            },
            {
              "name": "宛城区",
              "code": "161302"
            },
            {
              "name": "邓州市",
              "code": "161303"
            },
            {
              "name": "南召县",
              "code": "161304"
            },
            {
              "name": "方城县",
              "code": "161305"
            },
            {
              "name": "西峡县",
              "code": "161306"
            },
            {
              "name": "镇平县",
              "code": "161307"
            },
            {
              "name": "内乡县",
              "code": "161308"
            },
            {
              "name": "淅川县",
              "code": "161309"
            },
            {
              "name": "社旗县",
              "code": "161310"
            },
            {
              "name": "唐河县",
              "code": "161311"
            },
            {
              "name": "新野县",
              "code": "161312"
            },
            {
              "name": "桐柏县",
              "code": "161313"
            }
          ]
        },
        {
          "name": "商丘市",
          "code": "161400",
          "district": [
            {
              "name": "梁园区",
              "code": "161401"
            },
            {
              "name": "睢阳区",
              "code": "161402"
            },
            {
              "name": "永城市",
              "code": "161403"
            },
            {
              "name": "民权县",
              "code": "161404"
            },
            {
              "name": "睢县",
              "code": "161405"
            },
            {
              "name": "宁陵县",
              "code": "161406"
            },
            {
              "name": "柘城县",
              "code": "161407"
            },
            {
              "name": "虞城县",
              "code": "161408"
            },
            {
              "name": "夏邑县",
              "code": "161409"
            }
          ]
        },
        {
          "name": "信阳市",
          "code": "161500",
          "district": [
            {
              "name": "浉河区",
              "code": "161501"
            },
            {
              "name": "平桥区",
              "code": "161502"
            },
            {
              "name": "罗山县",
              "code": "161503"
            },
            {
              "name": "光山县",
              "code": "161504"
            },
            {
              "name": "新县",
              "code": "161505"
            },
            {
              "name": "商城县",
              "code": "161506"
            },
            {
              "name": "固始县",
              "code": "161507"
            },
            {
              "name": "潢川县",
              "code": "161508"
            },
            {
              "name": "淮滨县",
              "code": "161509"
            },
            {
              "name": "息县",
              "code": "161510"
            }
          ]
        },
        {
          "name": "周口市",
          "code": "161600",
          "district": [
            {
              "name": "川汇区",
              "code": "161601"
            },
            {
              "name": "项城市",
              "code": "161602"
            },
            {
              "name": "扶沟县",
              "code": "161603"
            },
            {
              "name": "西华县",
              "code": "161604"
            },
            {
              "name": "商水县",
              "code": "161605"
            },
            {
              "name": "沈丘县",
              "code": "161606"
            },
            {
              "name": "郸城县",
              "code": "161607"
            },
            {
              "name": "淮阳县",
              "code": "161608"
            },
            {
              "name": "太康县",
              "code": "161609"
            },
            {
              "name": "鹿邑县",
              "code": "161610"
            }
          ]
        },
        {
          "name": "驻马店市",
          "code": "161700",
          "district": [
            {
              "name": "驿城区",
              "code": "161701"
            },
            {
              "name": "西平县",
              "code": "161702"
            },
            {
              "name": "上蔡县",
              "code": "161703"
            },
            {
              "name": "平舆县",
              "code": "161704"
            },
            {
              "name": "正阳县",
              "code": "161705"
            },
            {
              "name": "确山县",
              "code": "161706"
            },
            {
              "name": "泌阳县",
              "code": "161707"
            },
            {
              "name": "汝南县",
              "code": "161708"
            },
            {
              "name": "遂平县",
              "code": "161709"
            },
            {
              "name": "新蔡县",
              "code": "161710"
            }
          ]
        },
        {
          "name": "焦作市",
          "code": "161800",
          "district": [
            {
              "name": "济源市",
              "code": "161801"
            }
          ]
        }
      ]
    },
    {
      "name": "湖北省",
      "code": "170000",
      "city": [
        {
          "name": "武汉市",
          "code": "170100",
          "district": [
            {
              "name": "江岸区",
              "code": "170101"
            },
            {
              "name": "江汉区",
              "code": "170102"
            },
            {
              "name": "硚口区",
              "code": "170103"
            },
            {
              "name": "汉阳区",
              "code": "170104"
            },
            {
              "name": "武昌区",
              "code": "170105"
            },
            {
              "name": "青山区",
              "code": "170106"
            },
            {
              "name": "洪山区",
              "code": "170107"
            },
            {
              "name": "东西湖区",
              "code": "170108"
            },
            {
              "name": "汉南区",
              "code": "170109"
            },
            {
              "name": "蔡甸区",
              "code": "170110"
            },
            {
              "name": "江夏区",
              "code": "170111"
            },
            {
              "name": "黄陂区",
              "code": "170112"
            },
            {
              "name": "新洲区",
              "code": "170113"
            }
          ]
        },
        {
          "name": "黄石市",
          "code": "170200",
          "district": [
            {
              "name": "下陆区",
              "code": "170201"
            },
            {
              "name": "黄石港区",
              "code": "170202"
            },
            {
              "name": "西塞山区",
              "code": "170203"
            },
            {
              "name": "铁山区",
              "code": "170204"
            },
            {
              "name": "大冶市",
              "code": "170205"
            },
            {
              "name": "阳新县",
              "code": "170206"
            }
          ]
        },
        {
          "name": "十堰市",
          "code": "170300",
          "district": [
            {
              "name": "茅箭区",
              "code": "170301"
            },
            {
              "name": "张湾区",
              "code": "170302"
            },
            {
              "name": "郧阳县",
              "code": "170303"
            },
            {
              "name": "丹江口市",
              "code": "170304"
            },
            {
              "name": "郧西县",
              "code": "170305"
            },
            {
              "name": "竹山县",
              "code": "170306"
            },
            {
              "name": "竹溪县",
              "code": "170307"
            },
            {
              "name": "房县",
              "code": "170308"
            }
          ]
        },
        {
          "name": "宜昌市",
          "code": "170400",
          "district": [
            {
              "name": "西陵区",
              "code": "170401"
            },
            {
              "name": "伍家岗区",
              "code": "170402"
            },
            {
              "name": "点军区",
              "code": "170403"
            },
            {
              "name": "猇亭区",
              "code": "170404"
            },
            {
              "name": "夷陵区",
              "code": "170405"
            },
            {
              "name": "宜都市",
              "code": "170406"
            },
            {
              "name": "当阳市",
              "code": "170407"
            },
            {
              "name": "枝江市",
              "code": "170408"
            },
            {
              "name": "远安县",
              "code": "170409"
            },
            {
              "name": "兴山县",
              "code": "170410"
            },
            {
              "name": "秭归县",
              "code": "170411"
            },
            {
              "name": "长阳土家族自治县",
              "code": "170412"
            },
            {
              "name": "五峰土家族自治县",
              "code": "170413"
            }
          ]
        },
        {
          "name": "襄阳市",
          "code": "170500",
          "district": [
            {
              "name": "襄城区",
              "code": "170501"
            },
            {
              "name": "樊城区",
              "code": "170502"
            },
            {
              "name": "襄州区",
              "code": "170503"
            },
            {
              "name": "老河口市",
              "code": "170504"
            },
            {
              "name": "枣阳市",
              "code": "170505"
            },
            {
              "name": "宜城市",
              "code": "170506"
            },
            {
              "name": "南漳县",
              "code": "170507"
            },
            {
              "name": "谷城县",
              "code": "170508"
            },
            {
              "name": "保康县",
              "code": "170509"
            }
          ]
        },
        {
          "name": "鄂州市",
          "code": "170600",
          "district": [
            {
              "name": "鄂城区",
              "code": "170601"
            },
            {
              "name": "梁子湖区",
              "code": "170602"
            },
            {
              "name": "华容区",
              "code": "170603"
            }
          ]
        },
        {
          "name": "荆门市",
          "code": "170700",
          "district": [
            {
              "name": "东宝区",
              "code": "170701"
            },
            {
              "name": "掇刀区",
              "code": "170702"
            },
            {
              "name": "钟祥市",
              "code": "170703"
            },
            {
              "name": "京山县",
              "code": "170704"
            },
            {
              "name": "沙洋县",
              "code": "170705"
            }
          ]
        },
        {
          "name": "孝感市",
          "code": "170800",
          "district": [
            {
              "name": "孝南区",
              "code": "170801"
            },
            {
              "name": "应城市",
              "code": "170802"
            },
            {
              "name": "安陆市",
              "code": "170803"
            },
            {
              "name": "汉川市",
              "code": "170804"
            },
            {
              "name": "孝昌县",
              "code": "170805"
            },
            {
              "name": "大悟县",
              "code": "170806"
            },
            {
              "name": "云梦县",
              "code": "170807"
            }
          ]
        },
        {
          "name": "荆州市",
          "code": "170900",
          "district": [
            {
              "name": "沙市区",
              "code": "170901"
            },
            {
              "name": "荆州区",
              "code": "170902"
            },
            {
              "name": "石首市",
              "code": "170903"
            },
            {
              "name": "洪湖市",
              "code": "170904"
            },
            {
              "name": "松滋市",
              "code": "170905"
            },
            {
              "name": "公安县",
              "code": "170906"
            },
            {
              "name": "监利县",
              "code": "170907"
            },
            {
              "name": "江陵县",
              "code": "170908"
            }
          ]
        },
        {
          "name": "黄冈市",
          "code": "171000",
          "district": [
            {
              "name": "黄州区",
              "code": "171001"
            },
            {
              "name": "麻城市",
              "code": "171002"
            },
            {
              "name": "武穴市",
              "code": "171003"
            },
            {
              "name": "团风县",
              "code": "171004"
            },
            {
              "name": "红安县",
              "code": "171005"
            },
            {
              "name": "罗田县",
              "code": "171006"
            },
            {
              "name": "英山县",
              "code": "171007"
            },
            {
              "name": "浠水县",
              "code": "171008"
            },
            {
              "name": "蕲春县",
              "code": "171009"
            },
            {
              "name": "黄梅县",
              "code": "171010"
            }
          ]
        },
        {
          "name": "咸宁市",
          "code": "171100",
          "district": [
            {
              "name": "咸安区",
              "code": "171101"
            },
            {
              "name": "赤壁市",
              "code": "171102"
            },
            {
              "name": "嘉鱼县",
              "code": "171103"
            },
            {
              "name": "通城县",
              "code": "171104"
            },
            {
              "name": "崇阳县",
              "code": "171105"
            },
            {
              "name": "通山县",
              "code": "171106"
            }
          ]
        },
        {
          "name": "随州市",
          "code": "171200",
          "district": [
            {
              "name": "曾都区",
              "code": "171201"
            },
            {
              "name": "广水市",
              "code": "171202"
            },
            {
              "name": "随县",
              "code": "171203"
            }
          ]
        },
        {
          "name": "恩施土家族苗族自治州",
          "code": "171300",
          "district": [
            {
              "name": "恩施市",
              "code": "171301"
            },
            {
              "name": "利川市",
              "code": "171302"
            },
            {
              "name": "建始县",
              "code": "171303"
            },
            {
              "name": "巴东县",
              "code": "171304"
            },
            {
              "name": "宣恩县",
              "code": "171305"
            },
            {
              "name": "咸丰县",
              "code": "171306"
            },
            {
              "name": "来凤县",
              "code": "171307"
            },
            {
              "name": "鹤峰县",
              "code": "171308"
            }
          ]
        },
        {
          "name": "仙桃市",
          "code": "171400",
          "district": [
            {
              "name": "仙桃",
              "code": "171401"
            }
          ]
        },
        {
          "name": "天门市",
          "code": "171500",
          "district": [
            {
              "name": "天门",
              "code": "171501"
            }
          ]
        },
        {
          "name": "潜江市",
          "code": "171600",
          "district": [
            {
              "name": "潜江",
              "code": "171601"
            }
          ]
        },
        {
          "name": "神农架林区",
          "code": "171700",
          "district": [
            {
              "name": "神农架林区",
              "code": "171701"
            }
          ]
        }
      ]
    },
    {
      "name": "湖南省",
      "code": "180000",
      "city": [
        {
          "name": "长沙市",
          "code": "180100",
          "district": [
            {
              "name": "岳麓区",
              "code": "180101"
            },
            {
              "name": "芙蓉区",
              "code": "180102"
            },
            {
              "name": "天心区",
              "code": "180103"
            },
            {
              "name": "开福区",
              "code": "180104"
            },
            {
              "name": "雨花区",
              "code": "180105"
            },
            {
              "name": "望城县",
              "code": "180106"
            },
            {
              "name": "浏阳市",
              "code": "180107"
            },
            {
              "name": "宁乡县",
              "code": "180108"
            },
            {
              "name": "长沙县",
              "code": "180109"
            }
          ]
        },
        {
          "name": "株洲市",
          "code": "180200",
          "district": [
            {
              "name": "天元区",
              "code": "180201"
            },
            {
              "name": "荷塘区",
              "code": "180202"
            },
            {
              "name": "芦淞区",
              "code": "180203"
            },
            {
              "name": "石峰区",
              "code": "180204"
            },
            {
              "name": "醴陵市",
              "code": "180205"
            },
            {
              "name": "株洲县",
              "code": "180206"
            },
            {
              "name": "攸县",
              "code": "180207"
            },
            {
              "name": "茶陵县",
              "code": "180208"
            },
            {
              "name": "炎陵县",
              "code": "180209"
            }
          ]
        },
        {
          "name": "湘潭市",
          "code": "180300",
          "district": [
            {
              "name": "岳塘区",
              "code": "180301"
            },
            {
              "name": "雨湖区",
              "code": "180302"
            },
            {
              "name": "湘乡市",
              "code": "180303"
            },
            {
              "name": "韶山市",
              "code": "180304"
            },
            {
              "name": "湘潭县",
              "code": "180305"
            }
          ]
        },
        {
          "name": "衡阳市",
          "code": "180400",
          "district": [
            {
              "name": "蒸湘区",
              "code": "180401"
            },
            {
              "name": "珠晖区",
              "code": "180402"
            },
            {
              "name": "雁峰区",
              "code": "180403"
            },
            {
              "name": "石鼓区",
              "code": "180404"
            },
            {
              "name": "南岳区",
              "code": "180405"
            },
            {
              "name": "耒阳市",
              "code": "180406"
            },
            {
              "name": "常宁市",
              "code": "180407"
            },
            {
              "name": "衡阳县",
              "code": "180408"
            },
            {
              "name": "衡南县",
              "code": "180409"
            },
            {
              "name": "衡山县",
              "code": "180410"
            },
            {
              "name": "衡东县",
              "code": "180411"
            },
            {
              "name": "祁东县",
              "code": "180412"
            }
          ]
        },
        {
          "name": "邵阳市",
          "code": "180500",
          "district": [
            {
              "name": "大祥区",
              "code": "180501"
            },
            {
              "name": "双清区",
              "code": "180502"
            },
            {
              "name": "北塔区",
              "code": "180503"
            },
            {
              "name": "武冈市",
              "code": "180504"
            },
            {
              "name": "邵东县",
              "code": "180505"
            },
            {
              "name": "新邵县",
              "code": "180506"
            },
            {
              "name": "邵阳县",
              "code": "180507"
            },
            {
              "name": "隆回县",
              "code": "180508"
            },
            {
              "name": "洞口县",
              "code": "180509"
            },
            {
              "name": "绥宁县",
              "code": "180510"
            },
            {
              "name": "新宁县",
              "code": "180511"
            },
            {
              "name": "城步苗族自治县",
              "code": "180512"
            }
          ]
        },
        {
          "name": "岳阳市",
          "code": "180600",
          "district": [
            {
              "name": "岳阳楼区",
              "code": "180601"
            },
            {
              "name": "云溪区",
              "code": "180602"
            },
            {
              "name": "君山区",
              "code": "180603"
            },
            {
              "name": "汨罗市",
              "code": "180604"
            },
            {
              "name": "临湘市",
              "code": "180605"
            },
            {
              "name": "岳阳县",
              "code": "180606"
            },
            {
              "name": "华容县",
              "code": "180607"
            },
            {
              "name": "湘阴县",
              "code": "180608"
            },
            {
              "name": "平江县",
              "code": "180609"
            }
          ]
        },
        {
          "name": "常德市",
          "code": "180700",
          "district": [
            {
              "name": "武陵区",
              "code": "180701"
            },
            {
              "name": "鼎城区",
              "code": "180702"
            },
            {
              "name": "津市市",
              "code": "180703"
            },
            {
              "name": "安乡县",
              "code": "180704"
            },
            {
              "name": "汉寿县",
              "code": "180705"
            },
            {
              "name": "澧县",
              "code": "180706"
            },
            {
              "name": "临澧县",
              "code": "180707"
            },
            {
              "name": "桃源县",
              "code": "180708"
            },
            {
              "name": "石门县",
              "code": "180709"
            }
          ]
        },
        {
          "name": "张家界市",
          "code": "180800",
          "district": [
            {
              "name": "永定区",
              "code": "180801"
            },
            {
              "name": "武陵源区",
              "code": "180802"
            },
            {
              "name": "慈利县",
              "code": "180803"
            },
            {
              "name": "桑植县",
              "code": "180804"
            }
          ]
        },
        {
          "name": "益阳市",
          "code": "180900",
          "district": [
            {
              "name": "赫山区",
              "code": "180901"
            },
            {
              "name": "资阳区",
              "code": "180902"
            },
            {
              "name": "沅江市",
              "code": "180903"
            },
            {
              "name": "南县",
              "code": "180904"
            },
            {
              "name": "桃江县",
              "code": "180905"
            },
            {
              "name": "安化县",
              "code": "180906"
            }
          ]
        },
        {
          "name": "郴州市",
          "code": "181000",
          "district": [
            {
              "name": "北湖区",
              "code": "181001"
            },
            {
              "name": "苏仙区",
              "code": "181002"
            },
            {
              "name": "资兴市",
              "code": "181003"
            },
            {
              "name": "桂阳县",
              "code": "181004"
            },
            {
              "name": "宜章县",
              "code": "181005"
            },
            {
              "name": "永兴县",
              "code": "181006"
            },
            {
              "name": "嘉禾县",
              "code": "181007"
            },
            {
              "name": "临武县",
              "code": "181008"
            },
            {
              "name": "汝城县",
              "code": "181009"
            },
            {
              "name": "桂东县",
              "code": "181010"
            },
            {
              "name": "安仁县",
              "code": "181011"
            }
          ]
        },
        {
          "name": "永州市",
          "code": "181100",
          "district": [
            {
              "name": "冷水滩区",
              "code": "181101"
            },
            {
              "name": "零陵区",
              "code": "181102"
            },
            {
              "name": "祁阳县",
              "code": "181103"
            },
            {
              "name": "东安县",
              "code": "181104"
            },
            {
              "name": "双牌县",
              "code": "181105"
            },
            {
              "name": "道县",
              "code": "181106"
            },
            {
              "name": "江永县",
              "code": "181107"
            },
            {
              "name": "宁远县",
              "code": "181108"
            },
            {
              "name": "蓝山县",
              "code": "181109"
            },
            {
              "name": "新田县",
              "code": "181110"
            },
            {
              "name": "江华瑶族自治县",
              "code": "181111"
            }
          ]
        },
        {
          "name": "怀化市",
          "code": "181200",
          "district": [
            {
              "name": "鹤城区",
              "code": "181201"
            },
            {
              "name": "洪江市",
              "code": "181202"
            },
            {
              "name": "中方县",
              "code": "181203"
            },
            {
              "name": "沅陵县",
              "code": "181204"
            },
            {
              "name": "辰溪县",
              "code": "181205"
            },
            {
              "name": "溆浦县",
              "code": "181206"
            },
            {
              "name": "会同县",
              "code": "181207"
            },
            {
              "name": "麻阳苗族自治县",
              "code": "181208"
            },
            {
              "name": "新晃侗族自治县",
              "code": "181209"
            },
            {
              "name": "芷江侗族自治县",
              "code": "181210"
            },
            {
              "name": "靖州苗族侗族自治县",
              "code": "181211"
            },
            {
              "name": "通道侗族自治县",
              "code": "181212"
            }
          ]
        },
        {
          "name": "娄底市",
          "code": "181300",
          "district": [
            {
              "name": "娄星区",
              "code": "181301"
            },
            {
              "name": "冷水江市",
              "code": "181302"
            },
            {
              "name": "涟源市",
              "code": "181303"
            },
            {
              "name": "双峰县",
              "code": "181304"
            },
            {
              "name": "新化县",
              "code": "181305"
            }
          ]
        },
        {
          "name": "湘西土家族苗族自治州",
          "code": "181400",
          "district": [
            {
              "name": "吉首市",
              "code": "181401"
            },
            {
              "name": "泸溪县",
              "code": "181402"
            },
            {
              "name": "凤凰县",
              "code": "181403"
            },
            {
              "name": "花垣县",
              "code": "181404"
            },
            {
              "name": "保靖县",
              "code": "181405"
            },
            {
              "name": "古丈县",
              "code": "181406"
            },
            {
              "name": "永顺县",
              "code": "181407"
            },
            {
              "name": "龙山县",
              "code": "181408"
            }
          ]
        }
      ]
    },
    {
      "name": "广东省",
      "code": "190000",
      "city": [
        {
          "name": "广州市",
          "code": "190100",
          "district": [
            {
              "name": "越秀区",
              "code": "190101"
            },
            {
              "name": "荔湾区",
              "code": "190102"
            },
            {
              "name": "海珠区",
              "code": "190103"
            },
            {
              "name": "天河区",
              "code": "190104"
            },
            {
              "name": "白云区",
              "code": "190105"
            },
            {
              "name": "黄埔区",
              "code": "190106"
            },
            {
              "name": "番禺区",
              "code": "190107"
            },
            {
              "name": "花都区",
              "code": "190108"
            },
            {
              "name": "南沙区",
              "code": "190109"
            },
            {
              "name": "增城市",
              "code": "190110"
            },
            {
              "name": "从化市",
              "code": "190111"
            }
          ]
        },
        {
          "name": "韶关市",
          "code": "190200",
          "district": [
            {
              "name": "浈江区",
              "code": "190201"
            },
            {
              "name": "武江区",
              "code": "190202"
            },
            {
              "name": "曲江区",
              "code": "190203"
            },
            {
              "name": "乐昌市",
              "code": "190204"
            },
            {
              "name": "南雄市",
              "code": "190205"
            },
            {
              "name": "始兴县",
              "code": "190206"
            },
            {
              "name": "仁化县",
              "code": "190207"
            },
            {
              "name": "翁源县",
              "code": "190208"
            },
            {
              "name": "新丰县",
              "code": "190209"
            },
            {
              "name": "乳源瑶族自治县",
              "code": "190210"
            }
          ]
        },
        {
          "name": "深圳市",
          "code": "190300",
          "district": [
            {
              "name": "福田区",
              "code": "190301"
            },
            {
              "name": "罗湖区",
              "code": "190302"
            },
            {
              "name": "南山区",
              "code": "190303"
            },
            {
              "name": "宝安区",
              "code": "190304"
            },
            {
              "name": "龙岗区",
              "code": "190305"
            },
            {
              "name": "盐田区",
              "code": "190306"
            },
            {
              "name": "龙华区",
              "code": "190307"
            },
            {
              "name": "坪山区",
              "code": "190308"
            }
          ]
        },
        {
          "name": "珠海市",
          "code": "190400",
          "district": [
            {
              "name": "香洲区",
              "code": "190401"
            },
            {
              "name": "斗门区",
              "code": "190402"
            },
            {
              "name": "金湾区",
              "code": "190403"
            }
          ]
        },
        {
          "name": "汕头市",
          "code": "190500",
          "district": [
            {
              "name": "金平区",
              "code": "190501"
            },
            {
              "name": "龙湖区",
              "code": "190502"
            },
            {
              "name": "濠江区",
              "code": "190503"
            },
            {
              "name": "潮阳区",
              "code": "190504"
            },
            {
              "name": "潮南区",
              "code": "190505"
            },
            {
              "name": "澄海区",
              "code": "190506"
            },
            {
              "name": "南澳县",
              "code": "190507"
            }
          ]
        },
        {
          "name": "佛山市",
          "code": "190600",
          "district": [
            {
              "name": "禅城区",
              "code": "190601"
            },
            {
              "name": "南海区",
              "code": "190602"
            },
            {
              "name": "顺德区",
              "code": "190603"
            },
            {
              "name": "三水区",
              "code": "190604"
            },
            {
              "name": "高明区",
              "code": "190605"
            }
          ]
        },
        {
          "name": "江门市",
          "code": "190700",
          "district": [
            {
              "name": "蓬江区",
              "code": "190701"
            },
            {
              "name": "江海区",
              "code": "190702"
            },
            {
              "name": "新会区",
              "code": "190703"
            },
            {
              "name": "台山市",
              "code": "190704"
            },
            {
              "name": "开平市",
              "code": "190705"
            },
            {
              "name": "鹤山市",
              "code": "190706"
            },
            {
              "name": "恩平市",
              "code": "190707"
            }
          ]
        },
        {
          "name": "湛江市",
          "code": "190800",
          "district": [
            {
              "name": "赤坎区",
              "code": "190801"
            },
            {
              "name": "霞山区",
              "code": "190802"
            },
            {
              "name": "坡头区",
              "code": "190803"
            },
            {
              "name": "麻章区",
              "code": "190804"
            },
            {
              "name": "廉江市",
              "code": "190805"
            },
            {
              "name": "雷州市",
              "code": "190806"
            },
            {
              "name": "吴川市",
              "code": "190807"
            },
            {
              "name": "遂溪县",
              "code": "190808"
            },
            {
              "name": "徐闻县",
              "code": "190809"
            }
          ]
        },
        {
          "name": "茂名市",
          "code": "190900",
          "district": [
            {
              "name": "茂南区",
              "code": "190901"
            },
            {
              "name": "电白县",
              "code": "190902"
            },
            {
              "name": "高州市",
              "code": "190903"
            },
            {
              "name": "化州市",
              "code": "190904"
            },
            {
              "name": "信宜市",
              "code": "190905"
            }
          ]
        },
        {
          "name": "肇庆市",
          "code": "191000",
          "district": [
            {
              "name": "端州区",
              "code": "191001"
            },
            {
              "name": "鼎湖区",
              "code": "191002"
            },
            {
              "name": "高要市",
              "code": "191003"
            },
            {
              "name": "四会市",
              "code": "191004"
            },
            {
              "name": "广宁县",
              "code": "191005"
            },
            {
              "name": "怀集县",
              "code": "191006"
            },
            {
              "name": "封开县",
              "code": "191007"
            },
            {
              "name": "德庆县",
              "code": "191008"
            }
          ]
        },
        {
          "name": "惠州市",
          "code": "191100",
          "district": [
            {
              "name": "惠城区",
              "code": "191101"
            },
            {
              "name": "惠阳区",
              "code": "191102"
            },
            {
              "name": "博罗县",
              "code": "191103"
            },
            {
              "name": "惠东县",
              "code": "191104"
            },
            {
              "name": "龙门县",
              "code": "191105"
            }
          ]
        },
        {
          "name": "梅州市",
          "code": "191200",
          "district": [
            {
              "name": "梅江区",
              "code": "191201"
            },
            {
              "name": "梅县区",
              "code": "191202"
            },
            {
              "name": "兴宁市",
              "code": "191203"
            },
            {
              "name": "大埔县",
              "code": "191204"
            },
            {
              "name": "丰顺县",
              "code": "191205"
            },
            {
              "name": "五华县",
              "code": "191206"
            },
            {
              "name": "平远县",
              "code": "191207"
            },
            {
              "name": "蕉岭县",
              "code": "191208"
            }
          ]
        },
        {
          "name": "汕尾市",
          "code": "191300",
          "district": [
            {
              "name": "城区",
              "code": "191301"
            },
            {
              "name": "陆丰市",
              "code": "191302"
            },
            {
              "name": "海丰县",
              "code": "191303"
            },
            {
              "name": "陆河县",
              "code": "191304"
            }
          ]
        },
        {
          "name": "河源市",
          "code": "191400",
          "district": [
            {
              "name": "源城区",
              "code": "191401"
            },
            {
              "name": "紫金县",
              "code": "191402"
            },
            {
              "name": "龙川县",
              "code": "191403"
            },
            {
              "name": "连平县",
              "code": "191404"
            },
            {
              "name": "和平县",
              "code": "191405"
            },
            {
              "name": "东源县",
              "code": "191406"
            }
          ]
        },
        {
          "name": "阳江市",
          "code": "191500",
          "district": [
            {
              "name": "江城区",
              "code": "191501"
            },
            {
              "name": "阳东县",
              "code": "191502"
            },
            {
              "name": "阳春市",
              "code": "191503"
            },
            {
              "name": "阳西县",
              "code": "191504"
            }
          ]
        },
        {
          "name": "清远市",
          "code": "191600",
          "district": [
            {
              "name": "清城区",
              "code": "191601"
            },
            {
              "name": "清新县",
              "code": "191602"
            },
            {
              "name": "英德市",
              "code": "191603"
            },
            {
              "name": "连州市",
              "code": "191604"
            },
            {
              "name": "佛冈县",
              "code": "191605"
            },
            {
              "name": "阳山县",
              "code": "191606"
            },
            {
              "name": "连山壮族瑶族自治县",
              "code": "191607"
            },
            {
              "name": "连南瑶族自治县",
              "code": "191608"
            }
          ]
        },
        {
          "name": "东莞市",
          "code": "191700",
          "district": [
            {
              "name": "莞城",
              "code": "191701"
            },
            {
              "name": "常平",
              "code": "191702"
            },
            {
              "name": "塘厦",
              "code": "191703"
            },
            {
              "name": "塘厦",
              "code": "191704"
            },
            {
              "name": "塘厦",
              "code": "191705"
            }
          ]
        },
        {
          "name": "中山市",
          "code": "191800",
          "district": [
            {
              "name": "中山",
              "code": "191801"
            }
          ]
        },
        {
          "name": "潮州市",
          "code": "191900",
          "district": [
            {
              "name": "湘桥区",
              "code": "191901"
            },
            {
              "name": "潮安区",
              "code": "191902"
            },
            {
              "name": "饶平县",
              "code": "191903"
            }
          ]
        },
        {
          "name": "揭阳市",
          "code": "192000",
          "district": [
            {
              "name": "榕城区",
              "code": "192001"
            },
            {
              "name": "揭东县",
              "code": "192002"
            },
            {
              "name": "普宁市",
              "code": "192003"
            },
            {
              "name": "揭西县",
              "code": "192004"
            },
            {
              "name": "惠来县",
              "code": "192005"
            }
          ]
        },
        {
          "name": "云浮市",
          "code": "192100",
          "district": [
            {
              "name": "云城区",
              "code": "192101"
            },
            {
              "name": "云安县",
              "code": "192102"
            },
            {
              "name": "罗定市",
              "code": "192103"
            },
            {
              "name": "新兴县",
              "code": "192104"
            },
            {
              "name": "郁南县",
              "code": "192105"
            }
          ]
        }
      ]
    },
    {
      "name": "广西",
      "code": "200000",
      "city": [
        {
          "name": "南宁市",
          "code": "200100",
          "district": [
            {
              "name": "青秀区",
              "code": "200101"
            },
            {
              "name": "兴宁区",
              "code": "200102"
            },
            {
              "name": "江南区",
              "code": "200103"
            },
            {
              "name": "西乡塘区",
              "code": "200104"
            },
            {
              "name": "良庆区",
              "code": "200105"
            },
            {
              "name": "邕宁区",
              "code": "200106"
            },
            {
              "name": "武鸣县",
              "code": "200107"
            },
            {
              "name": "隆安县",
              "code": "200108"
            },
            {
              "name": "马山县",
              "code": "200109"
            },
            {
              "name": "上林县",
              "code": "200110"
            },
            {
              "name": "宾阳县",
              "code": "200111"
            },
            {
              "name": "横县",
              "code": "200112"
            }
          ]
        },
        {
          "name": "柳州市",
          "code": "200200",
          "district": [
            {
              "name": "柳北区",
              "code": "200201"
            },
            {
              "name": "城中区",
              "code": "200202"
            },
            {
              "name": "鱼峰区",
              "code": "200203"
            },
            {
              "name": "柳南区",
              "code": "200204"
            },
            {
              "name": "柳江县",
              "code": "200205"
            },
            {
              "name": "柳城县",
              "code": "200206"
            },
            {
              "name": "鹿寨县",
              "code": "200207"
            },
            {
              "name": "融安县",
              "code": "200208"
            },
            {
              "name": "融水苗族自治县",
              "code": "200209"
            },
            {
              "name": "三江侗族自治县",
              "code": "200210"
            }
          ]
        },
        {
          "name": "桂林市",
          "code": "200300",
          "district": [
            {
              "name": "临桂区",
              "code": "200301"
            },
            {
              "name": "秀峰区",
              "code": "200302"
            },
            {
              "name": "叠彩区",
              "code": "200303"
            },
            {
              "name": "象山区",
              "code": "200304"
            },
            {
              "name": "七星区",
              "code": "200305"
            },
            {
              "name": "雁山区",
              "code": "200306"
            },
            {
              "name": "阳朔县",
              "code": "200307"
            },
            {
              "name": "灵川县",
              "code": "200308"
            },
            {
              "name": "全州县",
              "code": "200309"
            },
            {
              "name": "兴安县",
              "code": "200310"
            },
            {
              "name": "永福县",
              "code": "200311"
            },
            {
              "name": "灌阳县",
              "code": "200312"
            },
            {
              "name": "资源县",
              "code": "200313"
            },
            {
              "name": "平乐县",
              "code": "200314"
            },
            {
              "name": "荔浦县",
              "code": "200315"
            },
            {
              "name": "龙胜各族自治县",
              "code": "200316"
            },
            {
              "name": "恭城瑶族自治县",
              "code": "200317"
            }
          ]
        },
        {
          "name": "梧州市",
          "code": "200400",
          "district": [
            {
              "name": "长洲区",
              "code": "200401"
            },
            {
              "name": "万秀区",
              "code": "200402"
            },
            {
              "name": "龙圩区",
              "code": "200403"
            },
            {
              "name": "岑溪市",
              "code": "200404"
            },
            {
              "name": "苍梧县",
              "code": "200405"
            },
            {
              "name": "藤县",
              "code": "200406"
            },
            {
              "name": "蒙山县",
              "code": "200407"
            }
          ]
        },
        {
          "name": "北海市",
          "code": "200500",
          "district": [
            {
              "name": "海城区",
              "code": "200501"
            },
            {
              "name": "银海区",
              "code": "200502"
            },
            {
              "name": "铁山港区",
              "code": "200503"
            },
            {
              "name": "合浦县",
              "code": "200504"
            }
          ]
        },
        {
          "name": "防城港市",
          "code": "200600",
          "district": [
            {
              "name": "港口区",
              "code": "200601"
            },
            {
              "name": "防城区",
              "code": "200602"
            },
            {
              "name": "东兴市",
              "code": "200603"
            },
            {
              "name": "上思县",
              "code": "200604"
            }
          ]
        },
        {
          "name": "钦州市",
          "code": "200700",
          "district": [
            {
              "name": "钦南区",
              "code": "200701"
            },
            {
              "name": "钦北区",
              "code": "200702"
            },
            {
              "name": "灵山县",
              "code": "200703"
            },
            {
              "name": "浦北县",
              "code": "200704"
            }
          ]
        },
        {
          "name": "贵港市",
          "code": "200800",
          "district": [
            {
              "name": "港北区",
              "code": "200801"
            },
            {
              "name": "港南区",
              "code": "200802"
            },
            {
              "name": "覃塘区",
              "code": "200803"
            },
            {
              "name": "桂平市",
              "code": "200804"
            },
            {
              "name": "平南县",
              "code": "200805"
            }
          ]
        },
        {
          "name": "玉林市",
          "code": "200900",
          "district": [
            {
              "name": "玉州区",
              "code": "200901"
            },
            {
              "name": "福绵区",
              "code": "200902"
            },
            {
              "name": "北流市",
              "code": "200903"
            },
            {
              "name": "容县",
              "code": "200904"
            },
            {
              "name": "陆川县",
              "code": "200905"
            },
            {
              "name": "博白县",
              "code": "200906"
            },
            {
              "name": "兴业县",
              "code": "200907"
            }
          ]
        },
        {
          "name": "百色市",
          "code": "201000",
          "district": [
            {
              "name": "右江区",
              "code": "201001"
            },
            {
              "name": "靖西县",
              "code": "201002"
            },
            {
              "name": "田阳县",
              "code": "201003"
            },
            {
              "name": "田东县",
              "code": "201004"
            },
            {
              "name": "平果县",
              "code": "201005"
            },
            {
              "name": "德保县",
              "code": "201006"
            },
            {
              "name": "那坡县",
              "code": "201007"
            },
            {
              "name": "凌云县",
              "code": "201008"
            },
            {
              "name": "乐业县",
              "code": "201009"
            },
            {
              "name": "田林县",
              "code": "201010"
            },
            {
              "name": "西林县",
              "code": "201011"
            },
            {
              "name": "隆林各族自治县",
              "code": "201012"
            }
          ]
        },
        {
          "name": "贺州市",
          "code": "201100",
          "district": [
            {
              "name": "八步区",
              "code": "201101"
            },
            {
              "name": "昭平县",
              "code": "201102"
            },
            {
              "name": "昭平县",
              "code": "201103"
            },
            {
              "name": "富川瑶族自治县",
              "code": "201104"
            }
          ]
        },
        {
          "name": "河池市",
          "code": "201200",
          "district": [
            {
              "name": "金城江区",
              "code": "201201"
            },
            {
              "name": "宜州市",
              "code": "201202"
            },
            {
              "name": "南丹县",
              "code": "201203"
            },
            {
              "name": "天峨县",
              "code": "201204"
            },
            {
              "name": "凤山县",
              "code": "201205"
            },
            {
              "name": "东兰县",
              "code": "201206"
            },
            {
              "name": "罗城仫佬族自治县",
              "code": "201207"
            },
            {
              "name": "环江毛南族自治县",
              "code": "201208"
            },
            {
              "name": "巴马瑶族自治县",
              "code": "201209"
            },
            {
              "name": "都安瑶族自治县",
              "code": "201210"
            },
            {
              "name": "大化瑶族自治县",
              "code": "201211"
            }
          ]
        },
        {
          "name": "来宾市",
          "code": "201300",
          "district": [
            {
              "name": "兴宾区",
              "code": "201301"
            },
            {
              "name": "合山市",
              "code": "201302"
            },
            {
              "name": "忻城县",
              "code": "201303"
            },
            {
              "name": "象州县",
              "code": "201304"
            },
            {
              "name": "武宣县",
              "code": "201305"
            },
            {
              "name": "金秀瑶族自治县",
              "code": "201306"
            }
          ]
        },
        {
          "name": "崇左市",
          "code": "201400",
          "district": [
            {
              "name": "江州区",
              "code": "201401"
            },
            {
              "name": "凭祥市",
              "code": "201402"
            },
            {
              "name": "扶绥县",
              "code": "201403"
            },
            {
              "name": "宁明县",
              "code": "201404"
            },
            {
              "name": "龙州县",
              "code": "201405"
            },
            {
              "name": "大新县",
              "code": "201406"
            },
            {
              "name": "天等县",
              "code": "201407"
            }
          ]
        }
      ]
    },
    {
      "name": "海南省",
      "code": "210000",
      "city": [
        {
          "name": "海口市",
          "code": "210100",
          "district": [
            {
              "name": "龙华区",
              "code": "210101"
            },
            {
              "name": "秀英区",
              "code": "210102"
            },
            {
              "name": "琼山区",
              "code": "210103"
            },
            {
              "name": "美兰区",
              "code": "210104"
            }
          ]
        },
        {
          "name": "三亚市",
          "code": "210200",
          "district": [
            {
              "name": "吉阳区",
              "code": "210201"
            },
            {
              "name": "海棠区",
              "code": "210202"
            },
            {
              "name": "天涯区",
              "code": "210203"
            },
            {
              "name": "崖州区",
              "code": "210204"
            }
          ]
        },
        {
          "name": "三沙市",
          "code": "210300",
          "district": [
            {
              "name": "三沙市",
              "code": "210301"
            }
          ]
        },
        {
          "name": "儋州市",
          "code": "210400",
          "district": [
            {
              "name": "儋州市",
              "code": "210401"
            }
          ]
        },
        {
          "name": "五指山市",
          "code": "210500",
          "district": [
            {
              "name": "五指山市",
              "code": "210501"
            }
          ]
        },
        {
          "name": "琼海市",
          "code": "210600",
          "district": [
            {
              "name": "琼海市",
              "code": "210601"
            }
          ]
        },
        {
          "name": "文昌市",
          "code": "210700",
          "district": [
            {
              "name": "文昌",
              "code": "210701"
            }
          ]
        },
        {
          "name": "万宁市",
          "code": "210800",
          "district": [
            {
              "name": "万宁",
              "code": "210801"
            }
          ]
        },
        {
          "name": "东方市",
          "code": "210900",
          "district": [
            {
              "name": "东方",
              "code": "210901"
            }
          ]
        },
        {
          "name": "定安县",
          "code": "211000",
          "district": [
            {
              "name": "定安县",
              "code": "211001"
            }
          ]
        },
        {
          "name": "屯昌县",
          "code": "211100",
          "district": [
            {
              "name": "屯昌县",
              "code": "211101"
            }
          ]
        },
        {
          "name": "澄迈县",
          "code": "211200",
          "district": [
            {
              "name": "澄迈县",
              "code": "211201"
            }
          ]
        },
        {
          "name": "临高县",
          "code": "211300",
          "district": [
            {
              "name": "临高县",
              "code": "211301"
            }
          ]
        },
        {
          "name": "白沙黎族自治县",
          "code": "211400",
          "district": [
            {
              "name": "白沙黎族自治县",
              "code": "211401"
            }
          ]
        },
        {
          "name": "昌江黎族自治县",
          "code": "211500",
          "district": [
            {
              "name": "昌江黎族自治县",
              "code": "211501"
            }
          ]
        },
        {
          "name": "乐东黎族自治县",
          "code": "211600",
          "district": [
            {
              "name": "乐东黎族自治县",
              "code": "211601"
            }
          ]
        },
        {
          "name": "陵水黎族自治县",
          "code": "211700",
          "district": [
            {
              "name": "陵水黎族自治县",
              "code": "211701"
            }
          ]
        },
        {
          "name": "保亭黎族苗族自治县",
          "code": "211800",
          "district": [
            {
              "name": "保亭黎族苗族自治县",
              "code": "211801"
            }
          ]
        },
        {
          "name": "琼中黎族苗族自治县",
          "code": "211900",
          "district": [
            {
              "name": "琼中黎族苗族自治县",
              "code": "211901"
            }
          ]
        }
      ]
    },
    {
      "name": "重庆市",
      "code": "220000",
      "city": [
        {
          "name": "重庆市",
          "code": "220100",
          "district": [
            {
              "name": "渝中区",
              "code": "220101"
            },
            {
              "name": "万州区",
              "code": "220102"
            },
            {
              "name": "涪陵区",
              "code": "220103"
            },
            {
              "name": "大渡口区",
              "code": "220104"
            },
            {
              "name": "江北区",
              "code": "220105"
            },
            {
              "name": "沙坪坝区",
              "code": "220106"
            },
            {
              "name": "九龙坡区",
              "code": "220107"
            },
            {
              "name": "南岸区",
              "code": "220108"
            },
            {
              "name": "北碚区",
              "code": "220109"
            },
            {
              "name": "綦江区",
              "code": "220110"
            },
            {
              "name": "大足区",
              "code": "220111"
            },
            {
              "name": "渝北区",
              "code": "220112"
            },
            {
              "name": "巴南区",
              "code": "220113"
            },
            {
              "name": "黔江区",
              "code": "220114"
            },
            {
              "name": "长寿区",
              "code": "220115"
            },
            {
              "name": "江津区",
              "code": "220116"
            },
            {
              "name": "合川区",
              "code": "220117"
            },
            {
              "name": "永川区",
              "code": "220118"
            },
            {
              "name": "南川区",
              "code": "220119"
            },
            {
              "name": "璧山区",
              "code": "220120"
            },
            {
              "name": "铜梁区",
              "code": "220121"
            },
            {
              "name": "潼南区",
              "code": "220122"
            },
            {
              "name": "荣昌区",
              "code": "220123"
            },
            {
              "name": "开州区",
              "code": "220124"
            },
            {
              "name": "梁平区",
              "code": "220125"
            },
            {
              "name": "武隆区",
              "code": "220126"
            },
            {
              "name": "城口县",
              "code": "220127"
            },
            {
              "name": "丰都县",
              "code": "220128"
            },
            {
              "name": "垫江县",
              "code": "220129"
            },
            {
              "name": "忠县",
              "code": "220130"
            },
            {
              "name": "云阳县",
              "code": "220131"
            },
            {
              "name": "奉节县",
              "code": "220132"
            },
            {
              "name": "巫山县",
              "code": "220133"
            },
            {
              "name": "巫溪县",
              "code": "220134"
            },
            {
              "name": "石柱土家族自治县",
              "code": "220135"
            },
            {
              "name": "秀山土家族苗族自治县",
              "code": "220136"
            },
            {
              "name": "酉阳土家族苗族自治县",
              "code": "220137"
            },
            {
              "name": "彭水苗族土家族自治县",
              "code": "220138"
            }
          ]
        }
      ]
    },
    {
      "name": "四川省",
      "code": "230000",
      "city": [
        {
          "name": "成都市",
          "code": "230100",
          "district": [
            {
              "name": "武侯区",
              "code": "230101"
            },
            {
              "name": "锦江区",
              "code": "230102"
            },
            {
              "name": "青羊区",
              "code": "230103"
            },
            {
              "name": "金牛区",
              "code": "230104"
            },
            {
              "name": "成华区",
              "code": "230105"
            },
            {
              "name": "龙泉驿区",
              "code": "230106"
            },
            {
              "name": "青白江区",
              "code": "230107"
            },
            {
              "name": "新都区",
              "code": "230108"
            },
            {
              "name": "温江区",
              "code": "230109"
            },
            {
              "name": "双流区",
              "code": "230110"
            },
            {
              "name": "郫都区",
              "code": "230111"
            },
            {
              "name": "都江堰市",
              "code": "230112"
            },
            {
              "name": "彭州市",
              "code": "230113"
            },
            {
              "name": "邛崃市",
              "code": "230114"
            },
            {
              "name": "崇州市",
              "code": "230115"
            },
            {
              "name": "简阳市",
              "code": "230116"
            },
            {
              "name": "金堂县",
              "code": "230117"
            },
            {
              "name": "大邑县",
              "code": "230118"
            },
            {
              "name": "蒲江县",
              "code": "230119"
            },
            {
              "name": "新津县",
              "code": "230120"
            }
          ]
        },
        {
          "name": "自贡市",
          "code": "230200",
          "district": [
            {
              "name": "自流井区",
              "code": "230201"
            },
            {
              "name": "贡井区",
              "code": "230202"
            },
            {
              "name": "大安区",
              "code": "230203"
            },
            {
              "name": "沿滩区",
              "code": "230204"
            },
            {
              "name": "荣县",
              "code": "230205"
            },
            {
              "name": "富顺县",
              "code": "230206"
            }
          ]
        },
        {
          "name": "攀枝花市",
          "code": "230300",
          "district": [
            {
              "name": "东区",
              "code": "230301"
            },
            {
              "name": "西区",
              "code": "230302"
            },
            {
              "name": "仁和区",
              "code": "230303"
            },
            {
              "name": "米易县",
              "code": "230304"
            },
            {
              "name": "盐边县",
              "code": "230305"
            }
          ]
        },
        {
          "name": "泸州市",
          "code": "230400",
          "district": [
            {
              "name": "江阳区",
              "code": "230401"
            },
            {
              "name": "纳溪区",
              "code": "230402"
            },
            {
              "name": "龙马潭区",
              "code": "230403"
            },
            {
              "name": "泸县",
              "code": "230404"
            },
            {
              "name": "合江县",
              "code": "230405"
            },
            {
              "name": "叙永县",
              "code": "230406"
            },
            {
              "name": "古蔺县",
              "code": "230407"
            }
          ]
        },
        {
          "name": "德阳市",
          "code": "230500",
          "district": [
            {
              "name": "旌阳区",
              "code": "230501"
            },
            {
              "name": "罗江区",
              "code": "230502"
            },
            {
              "name": "广汉市",
              "code": "230503"
            },
            {
              "name": "什邡市",
              "code": "230504"
            },
            {
              "name": "绵竹市",
              "code": "230505"
            },
            {
              "name": "中江县",
              "code": "230506"
            }
          ]
        },
        {
          "name": "绵阳市",
          "code": "230600",
          "district": [
            {
              "name": "涪城区",
              "code": "230601"
            },
            {
              "name": "游仙区",
              "code": "230602"
            },
            {
              "name": "安州区",
              "code": "230603"
            },
            {
              "name": "江油市",
              "code": "230604"
            },
            {
              "name": "三台县",
              "code": "230605"
            },
            {
              "name": "盐亭县",
              "code": "230606"
            },
            {
              "name": "梓潼县",
              "code": "230607"
            },
            {
              "name": "平武县",
              "code": "230608"
            },
            {
              "name": "北川羌族自治县",
              "code": "230609"
            }
          ]
        },
        {
          "name": "广元市",
          "code": "230700",
          "district": [
            {
              "name": "利州区",
              "code": "230701"
            },
            {
              "name": "昭化区",
              "code": "230702"
            },
            {
              "name": "朝天区",
              "code": "230703"
            },
            {
              "name": "旺苍县",
              "code": "230704"
            },
            {
              "name": "青川县",
              "code": "230705"
            },
            {
              "name": "剑阁县",
              "code": "230706"
            },
            {
              "name": "苍溪县",
              "code": "230707"
            }
          ]
        },
        {
          "name": "遂宁市",
          "code": "230800",
          "district": [
            {
              "name": "船山区",
              "code": "230801"
            },
            {
              "name": "安居区",
              "code": "230802"
            },
            {
              "name": "蓬溪县",
              "code": "230803"
            },
            {
              "name": "射洪县",
              "code": "230804"
            },
            {
              "name": "大英县",
              "code": "230805"
            }
          ]
        },
        {
          "name": "内江市",
          "code": "230900",
          "district": [
            {
              "name": "市中区",
              "code": "230901"
            },
            {
              "name": "东兴区",
              "code": "230902"
            },
            {
              "name": "隆昌市",
              "code": "230903"
            },
            {
              "name": "威远县",
              "code": "230904"
            },
            {
              "name": "资中县",
              "code": "230905"
            }
          ]
        },
        {
          "name": "乐山市",
          "code": "231000",
          "district": [
            {
              "name": "市中区",
              "code": "231001"
            },
            {
              "name": "沙湾区",
              "code": "231002"
            },
            {
              "name": "五通桥区",
              "code": "231003"
            },
            {
              "name": "金口河区",
              "code": "231004"
            },
            {
              "name": "峨眉山市",
              "code": "231005"
            },
            {
              "name": "犍为县",
              "code": "231006"
            },
            {
              "name": "井研县",
              "code": "231007"
            },
            {
              "name": "夹江县",
              "code": "231008"
            },
            {
              "name": "沐川县",
              "code": "231009"
            },
            {
              "name": "峨边彝族自治县",
              "code": "231010"
            },
            {
              "name": "马边彝族自治县",
              "code": "231011"
            }
          ]
        },
        {
          "name": "南充市",
          "code": "231100",
          "district": [
            {
              "name": "顺庆区",
              "code": "231101"
            },
            {
              "name": "高坪区",
              "code": "231102"
            },
            {
              "name": "嘉陵区",
              "code": "231103"
            },
            {
              "name": "阆中市",
              "code": "231104"
            },
            {
              "name": "南部县",
              "code": "231105"
            },
            {
              "name": "营山县",
              "code": "231106"
            },
            {
              "name": "蓬安县",
              "code": "231107"
            },
            {
              "name": "仪陇县",
              "code": "231108"
            },
            {
              "name": "西充县",
              "code": "231109"
            }
          ]
        },
        {
          "name": "眉山市",
          "code": "231200",
          "district": [
            {
              "name": "东坡区",
              "code": "231201"
            },
            {
              "name": "彭山区",
              "code": "231202"
            },
            {
              "name": "仁寿县",
              "code": "231203"
            },
            {
              "name": "洪雅县",
              "code": "231204"
            },
            {
              "name": "丹棱县",
              "code": "231205"
            },
            {
              "name": "青神县",
              "code": "231206"
            }
          ]
        },
        {
          "name": "宜宾市",
          "code": "231300",
          "district": [
            {
              "name": "翠屏区",
              "code": "231301"
            },
            {
              "name": "南溪区",
              "code": "231302"
            },
            {
              "name": "宜宾县",
              "code": "231303"
            },
            {
              "name": "江安县",
              "code": "231304"
            },
            {
              "name": "长宁县",
              "code": "231305"
            },
            {
              "name": "高县",
              "code": "231306"
            },
            {
              "name": "珙县",
              "code": "231307"
            },
            {
              "name": "筠连县",
              "code": "231308"
            },
            {
              "name": "兴文县",
              "code": "231309"
            },
            {
              "name": "屏山县",
              "code": "231310"
            }
          ]
        },
        {
          "name": "广安市",
          "code": "231400",
          "district": [
            {
              "name": "广安区",
              "code": "231401"
            },
            {
              "name": "前锋区",
              "code": "231402"
            },
            {
              "name": "华蓥市",
              "code": "231403"
            },
            {
              "name": "岳池县",
              "code": "231404"
            },
            {
              "name": "武胜县",
              "code": "231405"
            },
            {
              "name": "邻水县",
              "code": "231406"
            }
          ]
        },
        {
          "name": "达州市",
          "code": "231500",
          "district": [
            {
              "name": "通川区",
              "code": "231501"
            },
            {
              "name": "达川区",
              "code": "231502"
            },
            {
              "name": "万源市",
              "code": "231503"
            },
            {
              "name": "宣汉县",
              "code": "231504"
            },
            {
              "name": "开江县",
              "code": "231505"
            },
            {
              "name": "大竹县",
              "code": "231506"
            },
            {
              "name": "渠县",
              "code": "231507"
            }
          ]
        },
        {
          "name": "雅安市",
          "code": "231600",
          "district": [
            {
              "name": "雨城区",
              "code": "231601"
            },
            {
              "name": "名山区",
              "code": "231602"
            },
            {
              "name": "荥经县",
              "code": "231603"
            },
            {
              "name": "汉源县",
              "code": "231604"
            },
            {
              "name": "石棉县",
              "code": "231605"
            },
            {
              "name": "天全县",
              "code": "231606"
            },
            {
              "name": "芦山县",
              "code": "231607"
            },
            {
              "name": "宝兴县",
              "code": "231608"
            }
          ]
        },
        {
          "name": "巴中市",
          "code": "231700",
          "district": [
            {
              "name": "巴州区",
              "code": "231701"
            },
            {
              "name": "恩阳区",
              "code": "231702"
            },
            {
              "name": "通江县",
              "code": "231703"
            },
            {
              "name": "南江县",
              "code": "231704"
            },
            {
              "name": "平昌县",
              "code": "231705"
            }
          ]
        },
        {
          "name": "资阳市",
          "code": "231800",
          "district": [
            {
              "name": "雁江区",
              "code": "231801"
            },
            {
              "name": "乐至县",
              "code": "231802"
            },
            {
              "name": "安岳县",
              "code": "231803"
            }
          ]
        },
        {
          "name": "阿坝藏族羌族自治州",
          "code": "231900",
          "district": [
            {
              "name": "马尔康县",
              "code": "231901"
            },
            {
              "name": "汶川县",
              "code": "231902"
            },
            {
              "name": "理县",
              "code": "231903"
            },
            {
              "name": "茂县",
              "code": "231904"
            },
            {
              "name": "松潘县",
              "code": "231905"
            },
            {
              "name": "九寨沟县",
              "code": "231906"
            },
            {
              "name": "金川县",
              "code": "231907"
            },
            {
              "name": "小金县",
              "code": "231908"
            },
            {
              "name": "黑水县",
              "code": "231909"
            },
            {
              "name": "壤塘县",
              "code": "231910"
            },
            {
              "name": "阿坝县",
              "code": "231911"
            },
            {
              "name": "若尔盖县",
              "code": "231912"
            },
            {
              "name": "红原县",
              "code": "231913"
            }
          ]
        },
        {
          "name": "甘孜藏族自治州",
          "code": "232000",
          "district": [
            {
              "name": "康定市",
              "code": "232001"
            },
            {
              "name": "泸定县",
              "code": "232002"
            },
            {
              "name": "丹巴县",
              "code": "232003"
            },
            {
              "name": "九龙县",
              "code": "232004"
            },
            {
              "name": "雅江县",
              "code": "232005"
            },
            {
              "name": "道孚县",
              "code": "232006"
            },
            {
              "name": "炉霍县",
              "code": "232007"
            },
            {
              "name": "甘孜县",
              "code": "232008"
            },
            {
              "name": "新龙县",
              "code": "232009"
            },
            {
              "name": "德格县",
              "code": "232010"
            },
            {
              "name": "白玉县",
              "code": "232011"
            },
            {
              "name": "石渠县",
              "code": "232012"
            },
            {
              "name": "色达县",
              "code": "232013"
            },
            {
              "name": "理塘县",
              "code": "232014"
            },
            {
              "name": "巴塘县",
              "code": "232015"
            },
            {
              "name": "乡城县",
              "code": "232016"
            },
            {
              "name": "稻城县",
              "code": "232017"
            },
            {
              "name": "得荣县",
              "code": "232018"
            }
          ]
        },
        {
          "name": "凉山彝族自治州",
          "code": "232100",
          "district": [
            {
              "name": "西昌市",
              "code": "232101"
            },
            {
              "name": "盐源县",
              "code": "232102"
            },
            {
              "name": "德昌县",
              "code": "232103"
            },
            {
              "name": "会理县",
              "code": "232104"
            },
            {
              "name": "会东县",
              "code": "232105"
            },
            {
              "name": "宁南县",
              "code": "232106"
            },
            {
              "name": "普格县",
              "code": "232107"
            },
            {
              "name": "布拖县",
              "code": "232108"
            },
            {
              "name": "金阳县",
              "code": "232109"
            },
            {
              "name": "昭觉县",
              "code": "232110"
            },
            {
              "name": "喜德县",
              "code": "232111"
            },
            {
              "name": "冕宁县",
              "code": "232112"
            },
            {
              "name": "越西县",
              "code": "232113"
            },
            {
              "name": "甘洛县",
              "code": "232114"
            },
            {
              "name": "美姑县",
              "code": "232115"
            },
            {
              "name": "雷波县",
              "code": "232116"
            },
            {
              "name": "木里藏族自治县",
              "code": "232117"
            }
          ]
        }
      ]
    },
    {
      "name": "贵州省",
      "code": "240000",
      "city": [
        {
          "name": "贵阳市",
          "code": "240100",
          "district": [
            {
              "name": "观山湖区",
              "code": "240101"
            },
            {
              "name": "南明区",
              "code": "240102"
            },
            {
              "name": "云岩区",
              "code": "240103"
            },
            {
              "name": "花溪区",
              "code": "240104"
            },
            {
              "name": "乌当区",
              "code": "240105"
            },
            {
              "name": "白云区",
              "code": "240106"
            },
            {
              "name": "清镇市",
              "code": "240107"
            },
            {
              "name": "开阳县",
              "code": "240108"
            },
            {
              "name": "息烽县",
              "code": "240109"
            },
            {
              "name": "修文县",
              "code": "240110"
            }
          ]
        },
        {
          "name": "六盘水市",
          "code": "240200",
          "district": [
            {
              "name": "钟山区",
              "code": "240201"
            },
            {
              "name": "盘州市",
              "code": "240202"
            },
            {
              "name": "水城县",
              "code": "240203"
            },
            {
              "name": "六枝特区",
              "code": "240204"
            }
          ]
        },
        {
          "name": "遵义市",
          "code": "240300",
          "district": [
            {
              "name": "汇川区",
              "code": "240301"
            },
            {
              "name": "红花岗区",
              "code": "240302"
            },
            {
              "name": "播州区",
              "code": "240303"
            },
            {
              "name": "赤水市",
              "code": "240304"
            },
            {
              "name": "仁怀市",
              "code": "240305"
            },
            {
              "name": "桐梓县",
              "code": "240306"
            },
            {
              "name": "绥阳县",
              "code": "240307"
            },
            {
              "name": "正安县",
              "code": "240308"
            },
            {
              "name": "凤冈县",
              "code": "240309"
            },
            {
              "name": "湄潭县",
              "code": "240310"
            },
            {
              "name": "余庆县",
              "code": "240311"
            },
            {
              "name": "习水县",
              "code": "240312"
            },
            {
              "name": "道真仡佬族苗族自治县",
              "code": "240313"
            },
            {
              "name": "务川仡佬族苗族自治县",
              "code": "240314"
            }
          ]
        },
        {
          "name": "安顺市",
          "code": "240400",
          "district": [
            {
              "name": "西秀区",
              "code": "240401"
            },
            {
              "name": "平坝县",
              "code": "240402"
            },
            {
              "name": "普定县",
              "code": "240403"
            },
            {
              "name": "镇宁布依族苗族自治县",
              "code": "240404"
            },
            {
              "name": "关岭布依族苗族自治县",
              "code": "240405"
            },
            {
              "name": "紫云苗族布依族自治县",
              "code": "240406"
            }
          ]
        },
        {
          "name": "毕节市",
          "code": "240500",
          "district": [
            {
              "name": "七星关区",
              "code": "240501"
            },
            {
              "name": "大方县",
              "code": "240502"
            },
            {
              "name": "黔西县",
              "code": "240503"
            },
            {
              "name": "金沙县",
              "code": "240504"
            },
            {
              "name": "织金县",
              "code": "240505"
            },
            {
              "name": "纳雍县",
              "code": "240506"
            },
            {
              "name": "赫章县",
              "code": "240507"
            },
            {
              "name": "威宁彝族回族苗族自治县",
              "code": "240508"
            }
          ]
        },
        {
          "name": "铜仁市",
          "code": "240600",
          "district": [
            {
              "name": "碧江区",
              "code": "240601"
            },
            {
              "name": "万山区",
              "code": "240602"
            },
            {
              "name": "江口县",
              "code": "240603"
            },
            {
              "name": "石阡县",
              "code": "240604"
            },
            {
              "name": "思南县",
              "code": "240605"
            },
            {
              "name": "德江县",
              "code": "240606"
            },
            {
              "name": "玉屏侗族自治县",
              "code": "240607"
            },
            {
              "name": "印江土家族苗族自治县",
              "code": "240608"
            },
            {
              "name": "沿河土家族自治县",
              "code": "240609"
            },
            {
              "name": "松桃苗族自治县",
              "code": "240610"
            }
          ]
        },
        {
          "name": "黔西南布依族苗族自治州",
          "code": "240700",
          "district": [
            {
              "name": "兴义市",
              "code": "240701"
            },
            {
              "name": "兴仁县",
              "code": "240702"
            },
            {
              "name": "普安县",
              "code": "240703"
            },
            {
              "name": "晴隆县",
              "code": "240704"
            },
            {
              "name": "贞丰县",
              "code": "240705"
            },
            {
              "name": "册亨县",
              "code": "240706"
            },
            {
              "name": "望谟县",
              "code": "240707"
            },
            {
              "name": "安龙县",
              "code": "240708"
            }
          ]
        },
        {
          "name": "黔东南苗族侗族自治州",
          "code": "240800",
          "district": [
            {
              "name": "凯里市",
              "code": "240801"
            },
            {
              "name": "黄平县",
              "code": "240802"
            },
            {
              "name": "施秉县",
              "code": "240803"
            },
            {
              "name": "三穗县",
              "code": "240804"
            },
            {
              "name": "镇远县",
              "code": "240805"
            },
            {
              "name": "岑巩县",
              "code": "240806"
            },
            {
              "name": "天柱县",
              "code": "240807"
            },
            {
              "name": "锦屏县",
              "code": "240808"
            },
            {
              "name": "剑河县",
              "code": "240809"
            },
            {
              "name": "台江县",
              "code": "240810"
            },
            {
              "name": "黎平县",
              "code": "240811"
            },
            {
              "name": "榕江县",
              "code": "240812"
            },
            {
              "name": "从江县",
              "code": "240813"
            },
            {
              "name": "雷山县",
              "code": "240814"
            },
            {
              "name": "麻江县",
              "code": "240815"
            },
            {
              "name": "丹寨县",
              "code": "240816"
            }
          ]
        },
        {
          "name": "黔南布依族苗族自治州",
          "code": "240900",
          "district": [
            {
              "name": "都匀市",
              "code": "240901"
            },
            {
              "name": "福泉市",
              "code": "240902"
            },
            {
              "name": "荔波县",
              "code": "240903"
            },
            {
              "name": "贵定县",
              "code": "240904"
            },
            {
              "name": "瓮安县",
              "code": "240905"
            },
            {
              "name": "独山县",
              "code": "240906"
            },
            {
              "name": "平塘县",
              "code": "240907"
            },
            {
              "name": "罗甸县",
              "code": "240908"
            },
            {
              "name": "长顺县",
              "code": "240909"
            },
            {
              "name": "龙里县",
              "code": "240910"
            },
            {
              "name": "惠水县",
              "code": "240911"
            },
            {
              "name": "三都水族自治县",
              "code": "240912"
            }
          ]
        }
      ]
    },
    {
      "name": "云南省",
      "code": "250000",
      "city": [
        {
          "name": "昆明市",
          "code": "250100",
          "district": [
            {
              "name": "呈贡县",
              "code": "250101"
            },
            {
              "name": "五华区",
              "code": "250102"
            },
            {
              "name": "盘龙区",
              "code": "250103"
            },
            {
              "name": "官渡区",
              "code": "250104"
            },
            {
              "name": "西山区",
              "code": "250105"
            },
            {
              "name": "东川区",
              "code": "250106"
            },
            {
              "name": "晋宁区",
              "code": "250107"
            },
            {
              "name": "安宁市",
              "code": "250108"
            },
            {
              "name": "富民县",
              "code": "250109"
            },
            {
              "name": "宜良县",
              "code": "250110"
            },
            {
              "name": "嵩明县",
              "code": "250111"
            },
            {
              "name": "石林彝族自治县",
              "code": "250112"
            },
            {
              "name": "禄劝彝族苗族自治县",
              "code": "250113"
            },
            {
              "name": "寻甸回族彝族自治县",
              "code": "250114"
            }
          ]
        },
        {
          "name": "曲靖市",
          "code": "250200",
          "district": [
            {
              "name": "麒麟区",
              "code": "250201"
            },
            {
              "name": "沾益县",
              "code": "250202"
            },
            {
              "name": "宣威市",
              "code": "250203"
            },
            {
              "name": "马龙县",
              "code": "250204"
            },
            {
              "name": "陆良县",
              "code": "250205"
            },
            {
              "name": "师宗县",
              "code": "250206"
            },
            {
              "name": "罗平县",
              "code": "250207"
            },
            {
              "name": "富源县",
              "code": "250208"
            },
            {
              "name": "会泽县",
              "code": "250209"
            }
          ]
        },
        {
          "name": "玉溪市",
          "code": "250300",
          "district": [
            {
              "name": "红塔区",
              "code": "250301"
            },
            {
              "name": "江川县",
              "code": "250302"
            },
            {
              "name": "澄江县",
              "code": "250303"
            },
            {
              "name": "通海县",
              "code": "250304"
            },
            {
              "name": "华宁县",
              "code": "250305"
            },
            {
              "name": "易门县",
              "code": "250306"
            },
            {
              "name": "峨山彝族自治县",
              "code": "250307"
            },
            {
              "name": "新平彝族傣族自治县",
              "code": "250308"
            },
            {
              "name": "元江哈尼族彝族傣族自治县",
              "code": "250309"
            }
          ]
        },
        {
          "name": "保山市",
          "code": "250400",
          "district": [
            {
              "name": "隆阳区",
              "code": "250401"
            },
            {
              "name": "腾冲市",
              "code": "250402"
            },
            {
              "name": "施甸县",
              "code": "250403"
            },
            {
              "name": "龙陵县",
              "code": "250404"
            },
            {
              "name": "昌宁县",
              "code": "250405"
            }
          ]
        },
        {
          "name": "昭通市",
          "code": "250500",
          "district": [
            {
              "name": "昭阳区",
              "code": "250501"
            },
            {
              "name": "鲁甸县",
              "code": "250502"
            },
            {
              "name": "巧家县",
              "code": "250503"
            },
            {
              "name": "盐津县",
              "code": "250504"
            },
            {
              "name": "大关县",
              "code": "250505"
            },
            {
              "name": "永善县",
              "code": "250506"
            },
            {
              "name": "绥江县",
              "code": "250507"
            },
            {
              "name": "镇雄县",
              "code": "250508"
            },
            {
              "name": "彝良县",
              "code": "250509"
            },
            {
              "name": "威信县",
              "code": "250510"
            },
            {
              "name": "水富县",
              "code": "250511"
            }
          ]
        },
        {
          "name": "丽江市",
          "code": "250600",
          "district": [
            {
              "name": "古城区",
              "code": "250601"
            },
            {
              "name": "永胜县",
              "code": "250602"
            },
            {
              "name": "华坪县",
              "code": "250603"
            },
            {
              "name": "玉龙纳西族自治县",
              "code": "250604"
            },
            {
              "name": "宁蒗彝族自治县",
              "code": "250605"
            }
          ]
        },
        {
          "name": "普洱市",
          "code": "250700",
          "district": [
            {
              "name": "思茅区",
              "code": "250701"
            },
            {
              "name": "宁洱哈尼族彝族自治县",
              "code": "250702"
            },
            {
              "name": "墨江哈尼族自治县",
              "code": "250703"
            },
            {
              "name": "景东彝族自治县",
              "code": "250704"
            },
            {
              "name": "景谷傣族彝族自治县",
              "code": "250705"
            },
            {
              "name": "镇沅彝族哈尼族拉祜族自治县",
              "code": "250706"
            },
            {
              "name": "江城哈尼族彝族自治县",
              "code": "250707"
            },
            {
              "name": "孟连傣族拉祜族佤族自治县",
              "code": "250708"
            },
            {
              "name": "澜沧拉祜族自治县",
              "code": "250709"
            },
            {
              "name": "西盟佤族自治县",
              "code": "250710"
            }
          ]
        },
        {
          "name": "临沧市",
          "code": "250800",
          "district": [
            {
              "name": "临翔区",
              "code": "250801"
            },
            {
              "name": "凤庆县",
              "code": "250802"
            },
            {
              "name": "云县",
              "code": "250803"
            },
            {
              "name": "永德县",
              "code": "250804"
            },
            {
              "name": "镇康县",
              "code": "250805"
            },
            {
              "name": "双江拉祜族佤族布朗族傣族自治县",
              "code": "250806"
            },
            {
              "name": "耿马傣族佤族自治县",
              "code": "250807"
            },
            {
              "name": "沧源佤族自治县",
              "code": "250808"
            }
          ]
        },
        {
          "name": "楚雄彝族自治州",
          "code": "250900",
          "district": [
            {
              "name": "楚雄市",
              "code": "250901"
            },
            {
              "name": "双柏县",
              "code": "250902"
            },
            {
              "name": "牟定县",
              "code": "250903"
            },
            {
              "name": "南华县",
              "code": "250904"
            },
            {
              "name": "姚安县",
              "code": "250905"
            },
            {
              "name": "大姚县",
              "code": "250906"
            },
            {
              "name": "永仁县",
              "code": "250907"
            },
            {
              "name": "元谋县",
              "code": "250908"
            },
            {
              "name": "武定县",
              "code": "250909"
            },
            {
              "name": "禄丰县",
              "code": "250910"
            }
          ]
        },
        {
          "name": "红河哈尼族彝族自治州",
          "code": "251000",
          "district": [
            {
              "name": "蒙自县",
              "code": "251001"
            },
            {
              "name": "个旧市",
              "code": "251002"
            },
            {
              "name": "开远市",
              "code": "251003"
            },
            {
              "name": "弥勒县",
              "code": "251004"
            },
            {
              "name": "建水县",
              "code": "251005"
            },
            {
              "name": "石屏县",
              "code": "251006"
            },
            {
              "name": "泸西县",
              "code": "251007"
            },
            {
              "name": "元阳县",
              "code": "251008"
            },
            {
              "name": "红河县",
              "code": "251009"
            },
            {
              "name": "绿春县",
              "code": "251010"
            },
            {
              "name": "屏边苗族自治县",
              "code": "251011"
            },
            {
              "name": "金平苗族瑶族傣族自治县",
              "code": "251012"
            },
            {
              "name": "河口瑶族自治县",
              "code": "251013"
            }
          ]
        },
        {
          "name": "文山壮族苗族自治州",
          "code": "251100",
          "district": [
            {
              "name": "文山市",
              "code": "251101"
            },
            {
              "name": "砚山县",
              "code": "251102"
            },
            {
              "name": "西畴县",
              "code": "251103"
            },
            {
              "name": "麻栗坡县",
              "code": "251104"
            },
            {
              "name": "马关县",
              "code": "251105"
            },
            {
              "name": "丘北县",
              "code": "251106"
            },
            {
              "name": "广南县",
              "code": "251107"
            },
            {
              "name": "富宁县",
              "code": "251108"
            }
          ]
        },
        {
          "name": "西双版纳傣族自治州",
          "code": "251200",
          "district": [
            {
              "name": "景洪市",
              "code": "251201"
            },
            {
              "name": "勐海县",
              "code": "251202"
            },
            {
              "name": "勐腊县",
              "code": "251203"
            }
          ]
        },
        {
          "name": "大理白族自治州",
          "code": "251300",
          "district": [
            {
              "name": "大理市",
              "code": "251301"
            },
            {
              "name": "祥云县",
              "code": "251302"
            },
            {
              "name": "宾川县",
              "code": "251303"
            },
            {
              "name": "弥渡县",
              "code": "251304"
            },
            {
              "name": "永平县",
              "code": "251305"
            },
            {
              "name": "云龙县",
              "code": "251306"
            },
            {
              "name": "洱源县",
              "code": "251307"
            },
            {
              "name": "剑川县",
              "code": "251308"
            },
            {
              "name": "鹤庆县",
              "code": "251309"
            },
            {
              "name": "漾濞彝族自治县",
              "code": "251310"
            },
            {
              "name": "南涧彝族自治县",
              "code": "251311"
            },
            {
              "name": "巍山彝族回族自治县",
              "code": "251312"
            }
          ]
        },
        {
          "name": "德宏傣族景颇族自治州",
          "code": "251400",
          "district": [
            {
              "name": "芒市",
              "code": "251401"
            },
            {
              "name": "瑞丽市",
              "code": "251402"
            },
            {
              "name": "梁河县",
              "code": "251403"
            },
            {
              "name": "盈江县",
              "code": "251404"
            },
            {
              "name": "陇川县",
              "code": "251405"
            }
          ]
        },
        {
          "name": "怒江傈僳族自治州",
          "code": "251500",
          "district": [
            {
              "name": "泸水县",
              "code": "251501"
            },
            {
              "name": "福贡县",
              "code": "251502"
            },
            {
              "name": "贡山独龙族怒族自治县",
              "code": "251503"
            },
            {
              "name": "兰坪白族普米族自治县",
              "code": "251504"
            }
          ]
        },
        {
          "name": "迪庆藏族自治州",
          "code": "251600",
          "district": [
            {
              "name": "香格里拉市",
              "code": "251601"
            },
            {
              "name": "德钦县",
              "code": "251602"
            },
            {
              "name": "维西傈僳族自治县",
              "code": "251603"
            }
          ]
        }
      ]
    },
    {
      "name": "西藏",
      "code": "260000",
      "city": [
        {
          "name": "拉萨市",
          "code": "260100",
          "district": [
            {
              "name": "城关区",
              "code": "260101"
            },
            {
              "name": "堆龙德庆区",
              "code": "260102"
            },
            {
              "name": "达孜区",
              "code": "260103"
            },
            {
              "name": "林周县",
              "code": "260104"
            },
            {
              "name": "当雄县",
              "code": "260105"
            },
            {
              "name": "尼木县",
              "code": "260106"
            },
            {
              "name": "曲水县",
              "code": "260107"
            },
            {
              "name": "墨竹工卡县",
              "code": "260108"
            }
          ]
        },
        {
          "name": "日喀则市",
          "code": "260200",
          "district": [
            {
              "name": "桑珠孜区",
              "code": "260201"
            },
            {
              "name": "南木林县",
              "code": "260202"
            },
            {
              "name": "江孜县",
              "code": "260203"
            },
            {
              "name": "定日县",
              "code": "260204"
            },
            {
              "name": "萨迦县",
              "code": "260205"
            },
            {
              "name": "拉孜县",
              "code": "260206"
            },
            {
              "name": "昂仁县",
              "code": "260207"
            },
            {
              "name": "谢通门县",
              "code": "260208"
            },
            {
              "name": "白朗县",
              "code": "260209"
            },
            {
              "name": "仁布县",
              "code": "260210"
            },
            {
              "name": "康马县",
              "code": "260211"
            },
            {
              "name": "定结县",
              "code": "260212"
            },
            {
              "name": "仲巴县",
              "code": "260213"
            },
            {
              "name": "亚东县",
              "code": "260214"
            },
            {
              "name": "吉隆县",
              "code": "260215"
            },
            {
              "name": "聂拉木县",
              "code": "260216"
            },
            {
              "name": "萨嘎县",
              "code": "260217"
            },
            {
              "name": "岗巴县",
              "code": "260218"
            }
          ]
        },
        {
          "name": "昌都市",
          "code": "260300",
          "district": [
            {
              "name": "卡若区",
              "code": "260301"
            },
            {
              "name": "江达县",
              "code": "260302"
            },
            {
              "name": "贡觉县",
              "code": "260303"
            },
            {
              "name": "类乌齐县",
              "code": "260304"
            },
            {
              "name": "丁青县",
              "code": "260305"
            },
            {
              "name": "察雅县",
              "code": "260306"
            },
            {
              "name": "八宿县",
              "code": "260307"
            },
            {
              "name": "左贡县",
              "code": "260308"
            },
            {
              "name": "芒康县",
              "code": "260309"
            },
            {
              "name": "洛隆县",
              "code": "260310"
            },
            {
              "name": "边坝县",
              "code": "260311"
            }
          ]
        },
        {
          "name": "林芝市",
          "code": "260400",
          "district": [
            {
              "name": "巴宜区",
              "code": "260401"
            },
            {
              "name": "工布江达县",
              "code": "260402"
            },
            {
              "name": "米林县",
              "code": "260403"
            },
            {
              "name": "墨脱县",
              "code": "260404"
            },
            {
              "name": "波密县",
              "code": "260405"
            },
            {
              "name": "察隅县",
              "code": "260406"
            },
            {
              "name": "朗县",
              "code": "260407"
            }
          ]
        },
        {
          "name": "山南市",
          "code": "260500",
          "district": [
            {
              "name": "乃东区",
              "code": "260501"
            },
            {
              "name": "扎囊县",
              "code": "260502"
            },
            {
              "name": "贡嘎县",
              "code": "260503"
            },
            {
              "name": "桑日县",
              "code": "260504"
            },
            {
              "name": "琼结县",
              "code": "260505"
            },
            {
              "name": "曲松县",
              "code": "260506"
            },
            {
              "name": "措美县",
              "code": "260507"
            },
            {
              "name": "洛扎县",
              "code": "260508"
            },
            {
              "name": "加查县",
              "code": "260509"
            },
            {
              "name": "隆子县",
              "code": "260510"
            },
            {
              "name": "错那县",
              "code": "260511"
            },
            {
              "name": "浪卡子县",
              "code": "260512"
            }
          ]
        },
        {
          "name": "那曲市",
          "code": "260600",
          "district": [
            {
              "name": "色尼区",
              "code": "260601"
            },
            {
              "name": "嘉黎县",
              "code": "260602"
            },
            {
              "name": "比如县",
              "code": "260603"
            },
            {
              "name": "聂荣县",
              "code": "260604"
            },
            {
              "name": "安多县",
              "code": "260605"
            },
            {
              "name": "申扎县",
              "code": "260606"
            },
            {
              "name": "索县",
              "code": "260607"
            },
            {
              "name": "班戈县",
              "code": "260608"
            },
            {
              "name": "巴青县",
              "code": "260609"
            },
            {
              "name": "尼玛县",
              "code": "260610"
            }
          ]
        },
        {
          "name": "阿里地区",
          "code": "260700",
          "district": [
            {
              "name": "噶尔县",
              "code": "260701"
            },
            {
              "name": "普兰县",
              "code": "260702"
            },
            {
              "name": "札达县",
              "code": "260703"
            },
            {
              "name": "日土县",
              "code": "260704"
            },
            {
              "name": "革吉县",
              "code": "260705"
            },
            {
              "name": "改则县",
              "code": "260706"
            },
            {
              "name": "措勤县",
              "code": "260707"
            }
          ]
        }
      ]
    },
    {
      "name": "陕西省",
      "code": "270000",
      "city": [
        {
          "name": "西安市",
          "code": "270100",
          "district": [
            {
              "name": "未央区",
              "code": "270101"
            },
            {
              "name": "新城区",
              "code": "270102"
            },
            {
              "name": "碑林区",
              "code": "270103"
            },
            {
              "name": "莲湖区",
              "code": "270104"
            },
            {
              "name": "灞桥区",
              "code": "270105"
            },
            {
              "name": "雁塔区",
              "code": "270106"
            },
            {
              "name": "阎良区",
              "code": "270107"
            },
            {
              "name": "临潼区",
              "code": "270108"
            },
            {
              "name": "长安区",
              "code": "270109"
            },
            {
              "name": "高陵区",
              "code": "270110"
            },
            {
              "name": "鄠邑区",
              "code": "270111"
            },
            {
              "name": "蓝田县",
              "code": "270112"
            },
            {
              "name": "周至县",
              "code": "270113"
            }
          ]
        },
        {
          "name": "铜川市",
          "code": "270200",
          "district": [
            {
              "name": "耀州区",
              "code": "270201"
            },
            {
              "name": "王益区",
              "code": "270202"
            },
            {
              "name": "印台区",
              "code": "270203"
            },
            {
              "name": "宜君县",
              "code": "270204"
            }
          ]
        },
        {
          "name": "宝鸡市",
          "code": "270300",
          "district": [
            {
              "name": "金台区",
              "code": "270301"
            },
            {
              "name": "渭滨区",
              "code": "270302"
            },
            {
              "name": "陈仓区",
              "code": "270303"
            },
            {
              "name": "凤翔县",
              "code": "270304"
            },
            {
              "name": "岐山县",
              "code": "270305"
            },
            {
              "name": "扶风县",
              "code": "270306"
            },
            {
              "name": "眉县",
              "code": "270307"
            },
            {
              "name": "陇县",
              "code": "270308"
            },
            {
              "name": "千阳县",
              "code": "270309"
            },
            {
              "name": "麟游县",
              "code": "270310"
            },
            {
              "name": "凤县",
              "code": "270311"
            },
            {
              "name": "太白县",
              "code": "270312"
            }
          ]
        },
        {
          "name": "咸阳市",
          "code": "270400",
          "district": [
            {
              "name": "秦都区",
              "code": "270401"
            },
            {
              "name": "杨陵区",
              "code": "270402"
            },
            {
              "name": "渭城区",
              "code": "270403"
            },
            {
              "name": "兴平市",
              "code": "270404"
            },
            {
              "name": "三原县",
              "code": "270405"
            },
            {
              "name": "乾县",
              "code": "270406"
            },
            {
              "name": "礼泉县",
              "code": "270407"
            },
            {
              "name": "永寿县",
              "code": "270408"
            },
            {
              "name": "彬县",
              "code": "270409"
            },
            {
              "name": "长武县",
              "code": "270410"
            },
            {
              "name": "旬邑县",
              "code": "270411"
            },
            {
              "name": "淳化县",
              "code": "270412"
            },
            {
              "name": "武功县",
              "code": "270413"
            }
          ]
        },
        {
          "name": "渭南市",
          "code": "270500",
          "district": [
            {
              "name": "临渭区",
              "code": "270501"
            },
            {
              "name": "韩城市",
              "code": "270502"
            },
            {
              "name": "华阴市",
              "code": "270503"
            },
            {
              "name": "华州区",
              "code": "270504"
            },
            {
              "name": "潼关县",
              "code": "270505"
            },
            {
              "name": "大荔县",
              "code": "270506"
            },
            {
              "name": "合阳县",
              "code": "270507"
            },
            {
              "name": "澄城县",
              "code": "270508"
            },
            {
              "name": "蒲城县",
              "code": "270509"
            },
            {
              "name": "白水县",
              "code": "270510"
            },
            {
              "name": "富平县",
              "code": "270511"
            }
          ]
        },
        {
          "name": "延安市",
          "code": "270600",
          "district": [
            {
              "name": "宝塔区",
              "code": "270601"
            },
            {
              "name": "安塞县",
              "code": "270602"
            },
            {
              "name": "延长县",
              "code": "270603"
            },
            {
              "name": "延川县",
              "code": "270604"
            },
            {
              "name": "子长县",
              "code": "270605"
            },
            {
              "name": "志丹县",
              "code": "270606"
            },
            {
              "name": "吴起县",
              "code": "270607"
            },
            {
              "name": "甘泉县",
              "code": "270608"
            },
            {
              "name": "富县",
              "code": "270609"
            },
            {
              "name": "洛川县",
              "code": "270610"
            },
            {
              "name": "宜川县",
              "code": "270611"
            },
            {
              "name": "黄龙县",
              "code": "270612"
            },
            {
              "name": "黄陵县",
              "code": "270613"
            }
          ]
        },
        {
          "name": "汉中市",
          "code": "270700",
          "district": [
            {
              "name": "汉台区",
              "code": "270701"
            },
            {
              "name": "南郑区",
              "code": "270702"
            },
            {
              "name": "城固县",
              "code": "270703"
            },
            {
              "name": "洋县",
              "code": "270704"
            },
            {
              "name": "西乡县",
              "code": "270705"
            },
            {
              "name": "勉县",
              "code": "270706"
            },
            {
              "name": "宁强县",
              "code": "270707"
            },
            {
              "name": "略阳县",
              "code": "270708"
            },
            {
              "name": "镇巴县",
              "code": "270709"
            },
            {
              "name": "留坝县",
              "code": "270710"
            },
            {
              "name": "佛坪县",
              "code": "270711"
            }
          ]
        },
        {
          "name": "榆林市",
          "code": "270800",
          "district": [
            {
              "name": "榆阳区",
              "code": "270801"
            },
            {
              "name": "神木市",
              "code": "270802"
            },
            {
              "name": "府谷县",
              "code": "270803"
            },
            {
              "name": "横山县",
              "code": "270804"
            },
            {
              "name": "靖边县",
              "code": "270805"
            },
            {
              "name": "定边县",
              "code": "270806"
            },
            {
              "name": "绥德县",
              "code": "270807"
            },
            {
              "name": "米脂县",
              "code": "270808"
            },
            {
              "name": "佳县",
              "code": "270809"
            },
            {
              "name": "吴堡县",
              "code": "270810"
            },
            {
              "name": "清涧县",
              "code": "270811"
            },
            {
              "name": "子洲县",
              "code": "270812"
            }
          ]
        },
        {
          "name": "安康市",
          "code": "270900",
          "district": [
            {
              "name": "汉滨区",
              "code": "270901"
            },
            {
              "name": "汉阴县",
              "code": "270902"
            },
            {
              "name": "石泉县",
              "code": "270903"
            },
            {
              "name": "宁陕县",
              "code": "270904"
            },
            {
              "name": "紫阳县",
              "code": "270905"
            },
            {
              "name": "岚皋县",
              "code": "270906"
            },
            {
              "name": "平利县",
              "code": "270907"
            },
            {
              "name": "镇坪县",
              "code": "270908"
            },
            {
              "name": "旬阳县",
              "code": "270909"
            },
            {
              "name": "白河县",
              "code": "270910"
            }
          ]
        },
        {
          "name": "商洛市",
          "code": "271000",
          "district": [
            {
              "name": "商州区",
              "code": "271001"
            },
            {
              "name": "洛南县",
              "code": "271002"
            },
            {
              "name": "丹凤县",
              "code": "271003"
            },
            {
              "name": "商南县",
              "code": "271004"
            },
            {
              "name": "镇安县",
              "code": "271005"
            },
            {
              "name": "山阳县",
              "code": "271006"
            },
            {
              "name": "柞水县",
              "code": "271007"
            }
          ]
        }
      ]
    },
    {
      "name": "甘肃省",
      "code": "280000",
      "city": [
        {
          "name": "兰州市",
          "code": "280100",
          "district": [
            {
              "name": "城关区",
              "code": "280101"
            },
            {
              "name": "七里河区",
              "code": "280102"
            },
            {
              "name": "西固区",
              "code": "280103"
            },
            {
              "name": "安宁区",
              "code": "280104"
            },
            {
              "name": "红古区",
              "code": "280105"
            },
            {
              "name": "永登县",
              "code": "280106"
            },
            {
              "name": "皋兰县",
              "code": "280107"
            },
            {
              "name": "榆中县",
              "code": "280108"
            }
          ]
        },
        {
          "name": "嘉峪关市",
          "code": "280200",
          "district": [
            {
              "name": "嘉峪关市",
              "code": "280201"
            }
          ]
        },
        {
          "name": "金昌市",
          "code": "280300",
          "district": [
            {
              "name": "金川区",
              "code": "280301"
            },
            {
              "name": "永昌县",
              "code": "280302"
            }
          ]
        },
        {
          "name": "白银市",
          "code": "280400",
          "district": [
            {
              "name": "白银区",
              "code": "280401"
            },
            {
              "name": "平川区",
              "code": "280402"
            },
            {
              "name": "靖远县",
              "code": "280403"
            },
            {
              "name": "会宁县",
              "code": "280404"
            },
            {
              "name": "景泰县",
              "code": "280405"
            }
          ]
        },
        {
          "name": "天水市",
          "code": "280500",
          "district": [
            {
              "name": "秦州区",
              "code": "280501"
            },
            {
              "name": "麦积区",
              "code": "280502"
            },
            {
              "name": "清水县",
              "code": "280503"
            },
            {
              "name": "秦安县",
              "code": "280504"
            },
            {
              "name": "甘谷县",
              "code": "280505"
            },
            {
              "name": "武山县",
              "code": "280506"
            },
            {
              "name": "张家川回族自治县",
              "code": "280507"
            }
          ]
        },
        {
          "name": "武威市",
          "code": "280600",
          "district": [
            {
              "name": "凉州区",
              "code": "280601"
            },
            {
              "name": "民勤县",
              "code": "280602"
            },
            {
              "name": "古浪县",
              "code": "280603"
            },
            {
              "name": "天祝藏族自治县",
              "code": "280604"
            }
          ]
        },
        {
          "name": "张掖市",
          "code": "280700",
          "district": [
            {
              "name": "甘州区",
              "code": "280701"
            },
            {
              "name": "民乐县",
              "code": "280702"
            },
            {
              "name": "临泽县",
              "code": "280703"
            },
            {
              "name": "高台县",
              "code": "280704"
            },
            {
              "name": "山丹县",
              "code": "280705"
            },
            {
              "name": "肃南裕固族自治县",
              "code": "280706"
            }
          ]
        },
        {
          "name": "平凉市",
          "code": "280800",
          "district": [
            {
              "name": "崆峒区",
              "code": "280801"
            },
            {
              "name": "泾川县",
              "code": "280802"
            },
            {
              "name": "灵台县",
              "code": "280803"
            },
            {
              "name": "崇信县",
              "code": "280804"
            },
            {
              "name": "华亭县",
              "code": "280805"
            },
            {
              "name": "庄浪县",
              "code": "280806"
            },
            {
              "name": "静宁县",
              "code": "280807"
            }
          ]
        },
        {
          "name": "酒泉市",
          "code": "280900",
          "district": [
            {
              "name": "肃州区",
              "code": "280901"
            },
            {
              "name": "玉门市",
              "code": "280902"
            },
            {
              "name": "敦煌市",
              "code": "280903"
            },
            {
              "name": "金塔县",
              "code": "280904"
            },
            {
              "name": "瓜州县",
              "code": "280905"
            },
            {
              "name": "肃北蒙古族自治县",
              "code": "280906"
            },
            {
              "name": "阿克塞哈萨克族自治县",
              "code": "280907"
            }
          ]
        },
        {
          "name": "庆阳市",
          "code": "281000",
          "district": [
            {
              "name": "西峰区",
              "code": "281001"
            },
            {
              "name": "庆城县",
              "code": "281002"
            },
            {
              "name": "环县",
              "code": "281003"
            },
            {
              "name": "华池县",
              "code": "281004"
            },
            {
              "name": "合水县",
              "code": "281005"
            },
            {
              "name": "正宁县",
              "code": "281006"
            },
            {
              "name": "宁县",
              "code": "281007"
            },
            {
              "name": "镇原县",
              "code": "281008"
            }
          ]
        },
        {
          "name": "定西市",
          "code": "281100",
          "district": [
            {
              "name": "安定区",
              "code": "281101"
            },
            {
              "name": "通渭县",
              "code": "281102"
            },
            {
              "name": "陇西县",
              "code": "281103"
            },
            {
              "name": "渭源县",
              "code": "281104"
            },
            {
              "name": "临洮县",
              "code": "281105"
            },
            {
              "name": "漳县",
              "code": "281106"
            },
            {
              "name": "岷县",
              "code": "281107"
            }
          ]
        },
        {
          "name": "陇南市",
          "code": "281200",
          "district": [
            {
              "name": "武都区",
              "code": "281201"
            },
            {
              "name": "成县",
              "code": "281202"
            },
            {
              "name": "文县",
              "code": "281203"
            },
            {
              "name": "宕昌县",
              "code": "281204"
            },
            {
              "name": "康县",
              "code": "281205"
            },
            {
              "name": "西和县",
              "code": "281206"
            },
            {
              "name": "礼县",
              "code": "281207"
            },
            {
              "name": "徽县",
              "code": "281208"
            },
            {
              "name": "两当县",
              "code": "281209"
            }
          ]
        },
        {
          "name": "临夏回族自治州",
          "code": "281300",
          "district": [
            {
              "name": "临夏市",
              "code": "281301"
            },
            {
              "name": "临夏县",
              "code": "281302"
            },
            {
              "name": "康乐县",
              "code": "281303"
            },
            {
              "name": "永靖县",
              "code": "281304"
            },
            {
              "name": "广河县",
              "code": "281305"
            },
            {
              "name": "和政县",
              "code": "281306"
            },
            {
              "name": "东乡族自治县",
              "code": "281307"
            },
            {
              "name": "积石山保安族东乡族撒拉族自治县",
              "code": "281308"
            }
          ]
        },
        {
          "name": "甘南藏族自治州",
          "code": "281400",
          "district": [
            {
              "name": "合作市",
              "code": "281401"
            },
            {
              "name": "临潭县",
              "code": "281402"
            },
            {
              "name": "卓尼县",
              "code": "281403"
            },
            {
              "name": "舟曲县",
              "code": "281404"
            },
            {
              "name": "迭部县",
              "code": "281405"
            },
            {
              "name": "玛曲县",
              "code": "281406"
            },
            {
              "name": "碌曲县",
              "code": "281407"
            },
            {
              "name": "夏河县",
              "code": "281408"
            }
          ]
        }
      ]
    },
    {
      "name": "青海省",
      "code": "290000",
      "city": [
        {
          "name": "西宁市",
          "code": "290100",
          "district": [
            {
              "name": "城中区",
              "code": "290101"
            },
            {
              "name": "城东区",
              "code": "290102"
            },
            {
              "name": "城西区",
              "code": "290103"
            },
            {
              "name": "城北区",
              "code": "290104"
            },
            {
              "name": "湟中县",
              "code": "290105"
            },
            {
              "name": "湟源县",
              "code": "290106"
            },
            {
              "name": "大通回族土族自治县",
              "code": "290107"
            }
          ]
        },
        {
          "name": "海东市",
          "code": "290200",
          "district": [
            {
              "name": "乐都区",
              "code": "290201"
            },
            {
              "name": "平安区",
              "code": "290202"
            },
            {
              "name": "民和回族土族自治县",
              "code": "290203"
            },
            {
              "name": "互助土族自治县",
              "code": "290204"
            },
            {
              "name": "化隆回族自治县",
              "code": "290205"
            },
            {
              "name": "循化撒拉族自治县",
              "code": "290206"
            }
          ]
        },
        {
          "name": "海北藏族自治州",
          "code": "290300",
          "district": [
            {
              "name": "海晏县",
              "code": "290301"
            },
            {
              "name": "祁连县",
              "code": "290302"
            },
            {
              "name": "刚察县",
              "code": "290303"
            },
            {
              "name": "门源回族自治县",
              "code": "290304"
            }
          ]
        },
        {
          "name": "黄南藏族自治州",
          "code": "290400",
          "district": [
            {
              "name": "同仁县",
              "code": "290401"
            },
            {
              "name": "尖扎县",
              "code": "290402"
            },
            {
              "name": "泽库县",
              "code": "290403"
            },
            {
              "name": "河南蒙古族自治县",
              "code": "290404"
            }
          ]
        },
        {
          "name": "海南藏族自治州",
          "code": "290500",
          "district": [
            {
              "name": "共和县",
              "code": "290501"
            },
            {
              "name": "同德县",
              "code": "290502"
            },
            {
              "name": "贵德县",
              "code": "290503"
            },
            {
              "name": "兴海县",
              "code": "290504"
            },
            {
              "name": "贵南县",
              "code": "290505"
            }
          ]
        },
        {
          "name": "果洛藏族自治州",
          "code": "290600",
          "district": [
            {
              "name": "玛沁县",
              "code": "290601"
            },
            {
              "name": "班玛县",
              "code": "290602"
            },
            {
              "name": "甘德县",
              "code": "290603"
            },
            {
              "name": "达日县",
              "code": "290604"
            },
            {
              "name": "久治县",
              "code": "290605"
            },
            {
              "name": "玛多县",
              "code": "290606"
            }
          ]
        },
        {
          "name": "玉树藏族自治州",
          "code": "290700",
          "district": [
            {
              "name": "玉树市",
              "code": "290701"
            },
            {
              "name": "杂多县",
              "code": "290702"
            },
            {
              "name": "称多县",
              "code": "290703"
            },
            {
              "name": "治多县",
              "code": "290704"
            },
            {
              "name": "囊谦县",
              "code": "290705"
            },
            {
              "name": "曲麻莱县",
              "code": "290706"
            }
          ]
        },
        {
          "name": "海西蒙古族藏族自治州",
          "code": "290800",
          "district": [
            {
              "name": "德令哈市",
              "code": "290801"
            },
            {
              "name": "格尔木市",
              "code": "290802"
            },
            {
              "name": "乌兰县",
              "code": "290803"
            },
            {
              "name": "都兰县",
              "code": "290804"
            },
            {
              "name": "天峻县",
              "code": "290805"
            }
          ]
        }
      ]
    },
    {
      "name": "宁夏",
      "code": "300000",
      "city": [
        {
          "name": "银川市",
          "code": "300100",
          "district": [
            {
              "name": "金凤区",
              "code": "300101"
            },
            {
              "name": "兴庆区",
              "code": "300102"
            },
            {
              "name": "西夏区",
              "code": "300103"
            },
            {
              "name": "灵武市",
              "code": "300104"
            },
            {
              "name": "永宁县",
              "code": "300105"
            },
            {
              "name": "贺兰县",
              "code": "300106"
            }
          ]
        },
        {
          "name": "石嘴山市",
          "code": "300200",
          "district": [
            {
              "name": "大武口区",
              "code": "300201"
            },
            {
              "name": "惠农区",
              "code": "300202"
            },
            {
              "name": "平罗县",
              "code": "300203"
            }
          ]
        },
        {
          "name": "吴忠市",
          "code": "300300",
          "district": [
            {
              "name": "利通区",
              "code": "300301"
            },
            {
              "name": "红寺堡区",
              "code": "300302"
            },
            {
              "name": "青铜峡市",
              "code": "300303"
            },
            {
              "name": "盐池县",
              "code": "300304"
            },
            {
              "name": "同心县",
              "code": "300305"
            }
          ]
        },
        {
          "name": "固原市",
          "code": "300400",
          "district": [
            {
              "name": "原州区",
              "code": "300401"
            },
            {
              "name": "西吉县",
              "code": "300402"
            },
            {
              "name": "隆德县",
              "code": "300403"
            },
            {
              "name": "泾源县",
              "code": "300404"
            },
            {
              "name": "彭阳县",
              "code": "300405"
            }
          ]
        },
        {
          "name": "中卫市",
          "code": "300500",
          "district": [
            {
              "name": "沙坡头区",
              "code": "300501"
            },
            {
              "name": "中宁县",
              "code": "300502"
            },
            {
              "name": "海原县",
              "code": "300503"
            }
          ]
        }
      ]
    },
    {
      "name": "新疆",
      "code": "310000",
      "city": [
        {
          "name": "乌鲁木齐市",
          "code": "310100",
          "district": [
            {
              "name": "天山区",
              "code": "310101"
            },
            {
              "name": "沙依巴克区",
              "code": "310102"
            },
            {
              "name": "新市区",
              "code": "310103"
            },
            {
              "name": "水磨沟区",
              "code": "310104"
            },
            {
              "name": "头屯河区",
              "code": "310105"
            },
            {
              "name": "达坂城区",
              "code": "310106"
            },
            {
              "name": "米东区",
              "code": "310107"
            },
            {
              "name": "乌鲁木齐县",
              "code": "310108"
            }
          ]
        },
        {
          "name": "克拉玛依市",
          "code": "310200",
          "district": [
            {
              "name": "克拉玛依区",
              "code": "310201"
            },
            {
              "name": "独山子区",
              "code": "310202"
            },
            {
              "name": "白碱滩区",
              "code": "310203"
            },
            {
              "name": "乌尔禾区",
              "code": "310204"
            }
          ]
        },
        {
          "name": "吐鲁番市",
          "code": "310300",
          "district": [
            {
              "name": "高昌区",
              "code": "310301"
            },
            {
              "name": "鄯善县",
              "code": "310302"
            },
            {
              "name": "托克逊县",
              "code": "310303"
            }
          ]
        },
        {
          "name": "哈密市",
          "code": "310400",
          "district": [
            {
              "name": "伊州区",
              "code": "310401"
            },
            {
              "name": "伊吾县",
              "code": "310402"
            },
            {
              "name": "巴里坤哈萨克自治县",
              "code": "310403"
            }
          ]
        },
        {
          "name": "阿克苏地区",
          "code": "310500",
          "district": [
            {
              "name": "阿克苏市",
              "code": "310501"
            },
            {
              "name": "温宿县",
              "code": "310502"
            },
            {
              "name": "库车县",
              "code": "310503"
            },
            {
              "name": "沙雅县",
              "code": "310504"
            },
            {
              "name": "新和县",
              "code": "310505"
            },
            {
              "name": "拜城县",
              "code": "310506"
            },
            {
              "name": "乌什县",
              "code": "310507"
            },
            {
              "name": "阿瓦提县",
              "code": "310508"
            },
            {
              "name": "柯坪县",
              "code": "310509"
            }
          ]
        },
        {
          "name": "喀什地区",
          "code": "310600",
          "district": [
            {
              "name": "喀什市",
              "code": "310601"
            },
            {
              "name": "疏附县",
              "code": "310602"
            },
            {
              "name": "疏勒县",
              "code": "310603"
            },
            {
              "name": "英吉沙县",
              "code": "310604"
            },
            {
              "name": "泽普县",
              "code": "310605"
            },
            {
              "name": "莎车县",
              "code": "310606"
            },
            {
              "name": "叶城县",
              "code": "310607"
            },
            {
              "name": "麦盖提县",
              "code": "310608"
            },
            {
              "name": "岳普湖县",
              "code": "310609"
            },
            {
              "name": "伽师县",
              "code": "310610"
            },
            {
              "name": "巴楚县",
              "code": "310611"
            },
            {
              "name": "塔什库尔干塔吉克自治县",
              "code": "310612"
            }
          ]
        },
        {
          "name": "和田地区",
          "code": "310700",
          "district": [
            {
              "name": "和田市",
              "code": "310701"
            },
            {
              "name": "和田县",
              "code": "310702"
            },
            {
              "name": "墨玉县",
              "code": "310703"
            },
            {
              "name": "皮山县",
              "code": "310704"
            },
            {
              "name": "洛浦县",
              "code": "310705"
            },
            {
              "name": "策勒县",
              "code": "310706"
            },
            {
              "name": "于田县",
              "code": "310707"
            },
            {
              "name": "民丰县",
              "code": "310708"
            }
          ]
        },
        {
          "name": "昌吉回族自治州",
          "code": "310800",
          "district": [
            {
              "name": "昌吉市",
              "code": "310801"
            },
            {
              "name": "阜康市",
              "code": "310802"
            },
            {
              "name": "呼图壁县",
              "code": "310803"
            },
            {
              "name": "玛纳斯县",
              "code": "310804"
            },
            {
              "name": "奇台县",
              "code": "310805"
            },
            {
              "name": "吉木萨尔县",
              "code": "310806"
            },
            {
              "name": "木垒哈萨克自治县",
              "code": "310807"
            }
          ]
        },
        {
          "name": "博尔塔拉蒙古自治州",
          "code": "310900",
          "district": [
            {
              "name": "博乐市",
              "code": "310901"
            },
            {
              "name": "精河县",
              "code": "310902"
            },
            {
              "name": "温泉县",
              "code": "310903"
            }
          ]
        },
        {
          "name": "巴音郭楞蒙古自治州",
          "code": "311000",
          "district": [
            {
              "name": "库尔勒市",
              "code": "311001"
            },
            {
              "name": "轮台县",
              "code": "311002"
            },
            {
              "name": "尉犁县",
              "code": "311003"
            },
            {
              "name": "且末县",
              "code": "311004"
            },
            {
              "name": "和静县",
              "code": "311005"
            },
            {
              "name": "和硕县",
              "code": "311006"
            },
            {
              "name": "博湖县",
              "code": "311007"
            },
            {
              "name": "焉耆回族自治县",
              "code": "311008"
            }
          ]
        },
        {
          "name": "克孜勒苏柯尔克孜自治州",
          "code": "311100",
          "district": [
            {
              "name": "阿图什市",
              "code": "311101"
            },
            {
              "name": "阿克陶县",
              "code": "311102"
            },
            {
              "name": "阿合奇县",
              "code": "311103"
            },
            {
              "name": "乌恰县",
              "code": "311104"
            }
          ]
        },
        {
          "name": "伊犁哈萨克自治州",
          "code": "311200",
          "district": [
            {
              "name": "伊宁市",
              "code": "311201"
            },
            {
              "name": "奎屯市",
              "code": "311202"
            },
            {
              "name": "霍尔果斯市",
              "code": "311203"
            },
            {
              "name": "伊宁县",
              "code": "311204"
            },
            {
              "name": "霍城县",
              "code": "311205"
            },
            {
              "name": "巩留县",
              "code": "311206"
            },
            {
              "name": "新源县",
              "code": "311207"
            },
            {
              "name": "昭苏县",
              "code": "311208"
            },
            {
              "name": "特克斯县",
              "code": "311209"
            },
            {
              "name": "尼勒克县",
              "code": "311210"
            },
            {
              "name": "察布查尔锡伯自治县",
              "code": "311211"
            }
          ]
        },
        {
          "name": "塔城地区",
          "code": "311300",
          "district": [
            {
              "name": "塔城市",
              "code": "311301"
            },
            {
              "name": "乌苏市",
              "code": "311302"
            },
            {
              "name": "额敏县",
              "code": "311303"
            },
            {
              "name": "沙湾县",
              "code": "311304"
            },
            {
              "name": "托里县",
              "code": "311305"
            },
            {
              "name": "裕民县",
              "code": "311306"
            },
            {
              "name": "和布克赛尔蒙古自治县",
              "code": "311307"
            }
          ]
        },
        {
          "name": "阿勒泰地区",
          "code": "311400",
          "district": [
            {
              "name": "阿勒泰市",
              "code": "311401"
            },
            {
              "name": "布尔津县",
              "code": "311402"
            },
            {
              "name": "富蕴县",
              "code": "311403"
            },
            {
              "name": "福海县",
              "code": "311404"
            },
            {
              "name": "哈巴河县",
              "code": "311405"
            },
            {
              "name": "青河县",
              "code": "311406"
            },
            {
              "name": "吉木乃县",
              "code": "311407"
            }
          ]
        },
        {
          "name": "石河子市",
          "code": "311500",
          "district": [
            {
              "name": "石河子",
              "code": "311501"
            }
          ]
        },
        {
          "name": "阿拉尔市",
          "code": "311600",
          "district": [
            {
              "name": "阿拉尔",
              "code": "311601"
            }
          ]
        },
        {
          "name": "图木舒克市",
          "code": "311700",
          "district": [
            {
              "name": "图木舒克",
              "code": "311701"
            }
          ]
        },
        {
          "name": "五家渠市",
          "code": "311800",
          "district": [
            {
              "name": "五家渠",
              "code": "311801"
            }
          ]
        },
        {
          "name": "北屯市",
          "code": "311900",
          "district": [
            {
              "name": "北屯市",
              "code": "311901"
            }
          ]
        },
        {
          "name": "铁门关市",
          "code": "312000",
          "district": [
            {
              "name": "铁门关市",
              "code": "312001"
            }
          ]
        },
        {
          "name": "双河市",
          "code": "312100",
          "district": [
            {
              "name": "双河市",
              "code": "312101"
            }
          ]
        },
        {
          "name": "可克达拉市",
          "code": "312200",
          "district": [
            {
              "name": "可克达拉市",
              "code": "312201"
            }
          ]
        },
        {
          "name": "昆玉市",
          "code": "312300",
          "district": [
            {
              "name": "昆玉市",
              "code": "312301"
            }
          ]
        }
      ]
    },
    {
      "name": "香港",
      "code": "320000",
      "city": [
        {
          "name": "香港",
          "code": "320100",
          "district": [
            {
              "name": "深水埗区",
              "code": "320101"
            },
            {
              "name": "油尖旺区",
              "code": "320102"
            },
            {
              "name": "九龙城区",
              "code": "320103"
            },
            {
              "name": "黄大仙区",
              "code": "320104"
            },
            {
              "name": "观塘区",
              "code": "320105"
            },
            {
              "name": "北区",
              "code": "320106"
            },
            {
              "name": "大埔区",
              "code": "320107"
            },
            {
              "name": "沙田区",
              "code": "320108"
            },
            {
              "name": "西贡区",
              "code": "320109"
            },
            {
              "name": "元朗区",
              "code": "320110"
            },
            {
              "name": "屯门区",
              "code": "320111"
            },
            {
              "name": "荃湾区",
              "code": "320112"
            },
            {
              "name": "葵青区",
              "code": "320113"
            },
            {
              "name": "离岛区",
              "code": "320114"
            },
            {
              "name": "中西区",
              "code": "320115"
            },
            {
              "name": "湾仔区",
              "code": "320116"
            },
            {
              "name": "东区",
              "code": "320117"
            },
            {
              "name": "南区",
              "code": "320118"
            }
          ]
        }
      ]
    },
    {
      "name": "澳门",
      "code": "330000",
      "city": [
        {
          "name": "澳门",
          "code": "330100",
          "district": [
            {
              "name": "花地玛堂区",
              "code": "330101"
            },
            {
              "name": "圣安多尼堂区",
              "code": "330102"
            },
            {
              "name": "大堂区",
              "code": "330103"
            },
            {
              "name": "望德堂区",
              "code": "330104"
            },
            {
              "name": "风顺堂区",
              "code": "330105"
            },
            {
              "name": "嘉模堂区",
              "code": "330106"
            },
            {
              "name": "圣方济各堂区",
              "code": "330107"
            },
            {
              "name": "路凼",
              "code": "330108"
            }
          ]
        }
      ]
    },
    {
      "name": "台湾省",
      "code": "340000",
      "city": [
        {
          "name": "台北市",
          "code": "340100",
          "district": [
            {
              "name": "内湖区",
              "code": "340101"
            },
            {
              "name": "南港区",
              "code": "340102"
            },
            {
              "name": "中正区",
              "code": "340103"
            },
            {
              "name": "万华区",
              "code": "340104"
            },
            {
              "name": "大同区",
              "code": "340105"
            },
            {
              "name": "中山区",
              "code": "340106"
            },
            {
              "name": "松山区",
              "code": "340107"
            },
            {
              "name": "大安区",
              "code": "340108"
            },
            {
              "name": "信义区",
              "code": "340109"
            },
            {
              "name": "文山区",
              "code": "340110"
            },
            {
              "name": "士林区",
              "code": "340111"
            },
            {
              "name": "北投区",
              "code": "340112"
            }
          ]
        },
        {
          "name": "新北市",
          "code": "340200",
          "district": [
            {
              "name": "板桥区",
              "code": "340201"
            },
            {
              "name": "汐止区",
              "code": "340202"
            },
            {
              "name": "新店区",
              "code": "340203"
            }
          ]
        },
        {
          "name": "桃园市",
          "code": "340300",
          "district": [
            {
              "name": "其他",
              "code": "340301"
            }
          ]
        },
        {
          "name": "台中市",
          "code": "340400",
          "district": [
            {
              "name": "其他",
              "code": "340401"
            }
          ]
        },
        {
          "name": "台南市",
          "code": "340500",
          "district": [
            {
              "name": "其他",
              "code": "340501"
            }
          ]
        },
        {
          "name": "高雄市",
          "code": "340600",
          "district": [
            {
              "name": "其他",
              "code": "340601"
            }
          ]
        }
      ]
    }
  ]
};